Repository: Xerusion/kde-l10n-th
Catalog: messages/khotkeys/khotkeys._desktop_.po
Languages: th

# Name
source: Input Actions
th: การกระทำเพื่อป้อนข้อมูล

# Comment
source: Input Actions service performing configured actions on key presses
th: บริการการกระทำเพื่อป้อนข้อมูลสำหรับเรียกการกระทำที่ได้ปรับแต่งไว้เมื่อมีการกดปุ่มพิมพ์

source: Comment
th: คำอธิบาย

# Name
source: KMenuEdit
th: แก้ไขเมนู-K

# Name
source: Search
th: ค้นหา

# Comment
source: This group contains various examples demonstrating most of the features of KHotkeys. (Note that this group and all its actions are disabled by default.)
th: กลุ่มนี้จะมีตัวอย่างต่าง ๆ ที่จะแสดงความสามารถส่วนใหญ่ของ KHotkeys (โปรดสังเกตว่า กลุ่มนี้และการกระทำทั้งหมดของกลุ่มจะถูกปิดการใช้งานเป็นค่าปริยาย)

# Name
source: Examples
th: ตัวอย่าง

# Comment
source: After pressing Ctrl+Alt+I, the KSIRC window will be activated, if it exists. Simple.
th: ง่ายมาก หลังจากกด Ctrl+Alt+I, หน้าต่างของ KSIRC จะถูกเรียกขึ้นมาถ้าหากมีหน้าต่างอยู่

# Name
source: Activate KSIRC Window
th: เรียกหน้าต่าง KSIRC ทำงาน

# Comment
source: KSIRC window
th: หน้าต่าง KSIRC

# Comment
source: After pressing Alt+Ctrl+H the input of 'Hello' will be simulated, as if you typed it. This is especially useful if you have call to frequently type a word (for instance, 'unsigned'). Every keypress in the input is separated by a colon ':'. Note that the keypresses literally mean keypresses, so you have to write what you would press on the keyboard. In the table below, the left column shows the input and the right column shows what to type.\n\n"enter" (i.e. new line) Enter or Return\na (i.e. small a) A\nA (i.e. capital a) Shift+A\n: (colon) Shift+;\n' ' (space) Space
th: หลังจากกดปุ่ม Alt+Ctrl+H จะมีการเลียนแบบเสมือนว่าคุณได้ทำการพิมพ์คำว่า 'Hello' โดยจะมีประโยชน์อย่างยิ่งหากคุณมักจะทำการพิมพ์คำเดียวกันอยู่บ่อยครั้ง เช่น 'unsigned' ทุก ๆ การกดปุ่มพิมพ์จะถูกแยกโดยใช้ ':' คุณจึงจะต้องกดปุ่มพิมพ์ในสิ่งที่คุณต้องการจริง ๆ อีกตามตารางด้านล่างนี้ ด้านซ้ายแสดงการรับ และด้านขวาแสดงสิ่งที่คุณพิมพ์\n\n"enter" (บรรทัดใหม่) Enter หรือ Return\na (อักษร a ตัวเล็ก) A\nA (อักษร a ตัวใหญ่) Shift+A\n: (จุลภาค) Shift+;\n' ' (ช่องว่าง) แป้นเว้นวรรค

# Name
source: Type 'Hello'
th: พิมพ์ 'Hello'

# Comment
source: This action runs Konsole, after pressing Ctrl+Alt+T.
th: การกระทำนี้จะเรียกคอนโซล-K หลังจากกด Ctrl+Alt+T

# Name
source: Run Konsole
th: เรียกคอนโซล-K

# Name
source: Remap Ctrl+W to Ctrl+F4 in Qt Designer
th: ตั้งค่าปุ่ม Ctrl+W เป็น Ctrl+F4 ใน Qt Designer

# Comment
source: By pressing Alt+Ctrl+W a D-Bus call will be performed that will show the minicli. You can use any kind of D-Bus call, just like using the command line 'qdbus' tool.
th: เมื่อกด Alt+Ctrl+W จะเป็นเรียก D-Bus เพื่อแสดง minicli โดยคุณสามารถใช้การเรียกแบบต่างๆ เหมือนกับการใช้เครื่องมือ qdbus บนเทอร์มินัล

# Comment
source: Read the comment on the "Type 'Hello'" action first.\n\nJust like the "Type 'Hello'" action, this one simulates keyboard input, specifically, after pressing Ctrl+Alt+B, it sends B to XMMS (B in XMMS jumps to the next song). The 'Send to specific window' checkbox is checked and a window with its class containing 'XMMS_Player' is specified; this will make the input always be sent to this window. This way, you can control XMMS even if, for instance, it is on a different virtual desktop.\n\n(Run 'xprop' and click on the XMMS window and search for WM_CLASS to see 'XMMS_Player').
th: อ่านคำแนะนำของการ "พิมพ์ 'Hello'" ก่อน\n\nคล้ายกับการ "พิมพ์ 'Hello'" ที่จำลองการรับของแป้นพิมพ์ ถ้าจะเป็นการเจาะจง เช่น การกด Ctrl+Alt+B โปรแกรมจะส่ง B ไปยัง XMMS (B ใน XMMS จะเปิดเพลงถัดไป). กล่องกาเครื่องหมายของ 'ส่งไปยังหน้าต่างที่ระบุ' ถูกเปิดใช้งานและหน้าต่างที่มีคลาสของ 'XMMS_Player' ระบุอยู่ ซึ่งจะทำให้การนำเข้าจะถูกส่งมายังหน้าต่างนี้เสมอ ในกรณีนี้ คุณสามารถควบคุม XMMS ถึงแมว่าจะอยู่คนละพื้นที่ทำงานเสมือนกัน\n\n(ให้ 'xprop' ทำงานและคลิกที่หน้าต่างของ XMMS และค้นหา WM_CLASS เพื่อเจอ 'XMMS_Player''XMMS_Player').

# Name
source: Next in XMMS
th: เพลงถัดไปใน XMMS

# Comment
source: XMMS window
th: หน้าต่าง XMMS

# Comment
source: XMMS Player window
th: หน้าต่างโปรแกรมเล่นเพลง XMMS

# Comment
source: Konqueror window
th: หน้าต่าง Konqueror

# Name
source: Back
th: ย้อนกลับ

# Name
source: Forward
th: ถัดไป

# Name
source: Up
th: ขึ้น

# Name
source: Reload
th: โหลดใหม่

# Comment
source: After pressing Win+E (Tux+E) a WWW browser will be launched, and it will open http://www.kde.org . You may run all kind of commands you can run in minicli (Alt+F2).
th: หลังจากการกดแป้น Win+E (Tux+E), จะมีการเรียกเว็บเบราว์เซอร์ให้ทำงาน และเรียกไปที่เว็บไซต์ http://www.kde.org นอกจากนี้คุณยังสามารถสั่งคำสั่งต่าง ๆ ผ่านทางบรรทัดคำสั่งขนาดเล็กได้ โดยการกดแป้น (Alt+F2) เพื่อเรียกบรรทัดคำสั่งขนาดเล็ก

# Name
source: Go to KDE Website
th: ไปยังหน้าเว็บไซต์ KDE

# Comment
source: Basic Konqueror gestures.
th: พื้นฐานการลากเมาส์สำหรับ Konqueror

# Name
source: Konqueror Gestures
th: การลากเมาส์แบบ Konqueror

# Comment
source: Press, move left, release.
th: กด, ลากมาทางซ้าย, ปล่อย

# Comment
source: Opera-style: Press, move up, release.\nNOTE: Conflicts with 'New Tab', and as such is disabled by default.
th: รูปแบบโอเปร่า: กด, ลากขึ้น, ปล่อย\nข้อควรทราบ: ขัดแย้งกับ 'แท็บใหม่' โดยปริยายแล้วรูปแบบนี้จะถูกปิดการทำงาน

# Name
source: Stop Loading
th: หยุดการโหลด

# Comment
source: Going up in URL/directory structure.\nMozilla-style: Press, move up, move left, move up, release.
th: เลื่อนระดับในโครงสร้างที่อยู่ URL/ไดเรกทอรีหนึ่งระดับ\nรูปแบบมอซซิลา: กด, ลากขึ้น, ลากมาทางซ้าย, ลากขึ้น, ปล่อย

# Comment
source: Going up in URL/directory structure.\nOpera-style: Press, move up, move left, move up, release.\nNOTE: Conflicts with "Activate Previous Tab", and as such is disabled by default.
th: เลื่อนระดับในโครงสร้างที่อยู่ URL/ไดเรกทอรีหนึ่งระดับ\nรูปแบบโอเปร่า: กด, ลากขึ้น, ลากมาทางซ้าย, ลากขึ้น, ปล่อย\nข้อควรทราบ: ขัดแย้งกับ "เรียกแท็บก่อนหน้า", โดยปริยายแล้วรูปแบบนี้จะถูกปิดการทำงาน

# Name
source: Up #2
th: ขึ้น #2

# Comment
source: Press, move up, move right, release.
th: กด, ลากขึ้น, ลากมาทางขวา, ปล่อย

# Name
source: Activate Next Tab
th: เรียกแท็บถัดไป

# Comment
source: Press, move up, move left, release.
th: กด, ลากขึ้น, ลากมาทางซ้าย, ปล่อย

# Name
source: Activate Previous Tab
th: เรียกแท็บก่อนหน้านี้

# Comment
source: Press, move down, move up, move down, release.
th: กด, ลากลง, ลากขึ้น, ลากลง, ปล่อย

# Name
source: Duplicate Tab
th: เปิดแท็บซ้ำ

# Comment
source: Press, move down, move up, release.
th: กด, ลากลง, ลากขึ้น, ปล่อย

# Name
source: Duplicate Window
th: สร้างหน้าต่างซ้ำ

# Comment
source: Press, move right, release.
th: กด, ลากมาทางขวา, ปล่อย

# Comment
source: Press, move down, move half up, move right, move down, release.\n(Drawing a lowercase 'h'.)
th: กด, ลากลง, ลากขึ้นครี่งหนึ่ง, ลากมาทางขวา, ลากลง, ปล่อย\n(การวาดตัวอักษรตัวพิมพ์เล็ก 'h')

# Name
source: Home
th: พื้นที่ส่วนตัว

# Comment
source: Press, move right, move down, move right, release.\nMozilla-style: Press, move down, move right, release.
th: กด, ลากมาทางขวา, ลากลง, ลากมาทางขวา, ปล่อย\รูปแบบของมอซซิลา: กด, ลากลง, ลากมาทางขวา, ปล่อย

# Name
source: Close Tab
th: ปิดแท็บ

# Comment
source: Press, move up, release.\nConflicts with Opera-style 'Up #2', which is disabled by default.
th: กด, ลากขึ้น, ปล่อย \nขัดกันกับรูปแบบของโอเปร่า 'Up#2' ซึ่งจะถูกปิดไป โดยปริยาย

# Name
source: New Tab
th: เปิดแท็บใหม่

# Comment
source: Press, move down, release.
th: กดปุ่ม, ลากลง, ปล่อย

# Name
source: New Window
th: สร้างหน้าต่างใหม่

# Comment
source: Press, move up, move down, release.
th: กด, ลากขึ้น, ลากลง, ปล่อย

# Name
source: Custom Shortcuts
th: ทางลัดกำหนดเอง

# Comment
source: Configure Input Actions settings
th: ปรับแต่งการตั้งค่าการกระทำเพื่อป้อนข้อมูล
