Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-workspace/krunner.po
Languages: th

# NAME OF TRANSLATORS
source: Your names
th: Pongsakorn S.

# EMAIL OF TRANSLATORS
source: Your emails
th: kde@xerusion.me

source: Run Command interface
th: เรียกใช้อินเทอร์เฟซคำสั่ง

source: Use the clipboard contents as query for KRunner
th: ใช้เนื้อหาของคลิปบอร์ดเป็นสิ่งค้นหาสำหรับ KRunner

source: Start KRunner in the background, don't show it.
th: เริ่ม KRunner ในพื้นหลัง ไม่ต้องแสดง

source: Replace an existing instance
th: แทนที่อินสแตนซ์ที่มีอยู่

source: Show only results from the given plugin
th: แสดงเฉพาะผลลัพธ์จากปลั๊กอินที่กำหนด

source: List available plugins
th: รายการปลั๊กอินที่พร้อมใช้งาน

source: The query to run, only used if -c is not provided
th: สิ่งค้นหาที่จะรันจะใช้เฉพาะเมื่อไม่ได้ระบุ -c

# Header for command line output
source: Available KRunner plugins, pluginId
th: ปลั๊กอิน KRunner ที่พร้อมใช้งาน, pluginId

source: Configure
th: ปรับแต่ง

source: Configure KRunner Behavior
th: กำหนดพฤติกรรมของ KRunner

source: Configure KRunner…
th: ปรับแต่ง KRunner...

source: Showing only results from %1
th: แสดงเฉพาะผลลัพธ์จาก %1

# Textfield placeholder text, query specific KRunner plugin
source: Search '%1'…
th: ค้นหา '%1'...

# Textfield placeholder text
source: Search…
th: ค้นหา...

source: Show Usage Help
th: แสดงวิธีใช้

source: Pin
th: ปักหมุด

source: Pin Search
th: ค้นหาหมุด

source: Keep Open
th: เปิดไว้

source: Recent Queries
th: สิ่งค้นหาล่าสุด

source: Remove
th: เอาออก
