Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-workspace/plasma_applet_org.kde.plasma.devicenotifier.po
Languages: th

# @action:button check a storageAccess (i.e disk) for error
source: Check for Errors
th: ตรวจสอบหาข้อผิดพลาด

# @action:button Mount a disk without verifying for errors
source: Mount without verifying
th: เมานต์โดยไม่ตรวจสอบ

source: Mount
th: เมานต์

source: Open in File Manager
th: เปิดในเครื่องมือจัดการไฟล์

source: Try to Fix
th: พยายามซ่อมแซม

source: Mount and Open
th: เมานต์และเปิด

source: Eject
th: เอาออก

source: Safely remove
th: ถอดออกอย่างปลอดภัย

source: This device has file system errors.
th: อุปกรณ์นี้มีข้อผิดพลาดของระบบไฟล์

# @label device is a storage disk
source: This device has no errors
th: อุปกรณ์นี้ไม่มีข้อผิดพลาด

source: Successfully repaired!
th: ซ่อมแซมสำเร็จแล้ว!

source: Device Status
th: สถานะอุปกรณ์

source: A device can now be safely removed
th: สามารถถอดอุปกรณ์ออกได้อย่างปลอดภัยแล้ว

source: This device can now be safely removed.
th: อุปกรณ์นี้สามารถถอดออกอย่างปลอดภัยได้แล้ว

source: You are not authorized to mount this device.
th: คุณไม่ได้รับอนุญาตให้เมานต์อุปกรณ์นี้

source: You are not authorized to eject this disc.
th: คุณไม่ได้รับอนุญาตให้เอาแผ่นดิสก์นี้ออก

# Remove is less technical for unmount
source: You are not authorized to remove this device.
th: คุณไม่ได้รับอนุญาตให้เอาอุปกรณ์นี้ออก

source: You are not authorized to repair this device.
th: คุณไม่ได้รับอนุญาตให้ซ่อมแซมอุปกรณ์นี้

source: Unknown error type
th: ไม่ทราบประเภทข้อผิดพลาด

source: Could not mount this device as it is busy.
th: ไม่สามารถเมานต์อุปกรณ์นี้ได้ เนื่องจากอุปกรณ์ไม่ว่าง

source: One or more files on this device are open within an application.
th: ไฟล์อย่างน้อยหนึ่งไฟล์ในอุปกรณ์นี้ถูกเปิดอยู่ภายในแอปพลิเคชันใดแอปพลิเคชันหนึ่ง

source: One or more files on this device are opened in application "%2".
th: ไฟล์อย่างน้อยหนึ่งไฟล์ในอุปกรณ์นี้ถูกเปิดอยู่ภายในแอปพลิเคชันดังต่อไปนี้: %2

source: Could not mount this device.
th: ไม่สามารถเมานต์อุปกรณ์นี้ได้

source: Could not eject this disc.
th: ไม่สามารถเอาแผ่นดิสก์นี้ออกได้

# Remove is less technical for unmount
source: Could not remove this device.
th: ไม่สามารถถอดอุปกรณ์นี้ออกได้

source: Could not repair this device: %1
th: ไม่สามารถซ่อมแซมอุปกรณ์นี้ได้: %1

source: Checking…
th: กำลังตรวจสอบ…

source: Repairing…
th: กำลังซ่อมแซม…

# @info:status Free disk space
source: %1 free of %2
th: ว่าง %1 จากทั้งหมด %2

source: Accessing…
th: กำลังเข้าถึง…

source: Removing…
th: กำลังถอดออก…

source: Don't unplug yet! Files are still being transferred…
th: อย่าเพิ่งถอดออก! ไฟล์ยังอยู่ระหว่างการถ่ายโอน…

source: Remove All
th: ถอดออกทั้งหมด

source: Click to safely remove all devices
th: คลิกเพื่อถอดอุปกรณ์ทั้งหมดออกอย่างปลอดภัย

source: No removable devices attached
th: ไม่มีอุปกรณ์ที่ถอดได้เสียบอยู่

source: No disks available
th: ไม่มีดิสก์ที่ใช้ได้

source: Most Recent Device
th: อุปกรณ์ล่าสุด

source: No Devices Available
th: ไม่มีอุปกรณ์ที่ใช้ได้

# Open auto mounter kcm
source: Configure Removable Devices…
th: ตั้งค่าอุปกรณ์ที่ถอดออกได้

source: Removable Devices
th: อุปกรณ์ที่ถอดออกได้

source: Non Removable Devices
th: อุปกรณ์ที่ถอดออกไม่ได้

source: All Devices
th: อุปกรณ์ทั้งหมด

source: Show popup when new device is plugged in
th: แสดงป๊อปอัปเมื่อเสียบอุปกรณ์ใหม่

source: Don't unplug yet! Files are still being transferred...
th: อย่าเพิ่งถอดออก! ไฟล์ยังอยู่ระหว่างการถ่ายโอน...
