Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-desktop/kcm_desktoppaths.po
Languages: th

# @label:textbox
source: Desktop folder:
th: โฟลเดอร์เดสก์ท็อป:

# @info:tooltip and accessible description
source: This folder contains all the files you see on your desktop.
th: โฟลเดอร์นี้มีไฟล์ทั้งหมดที่คุณเห็นบนเดสก์ท็อปของคุณ

# @label:textbox
source: Documents folder:
th: โฟลเดอร์เอกสาร:

# @info:tooltip and accessible description
source: This folder will be used by default to open or save documents.
th: โฟลเดอร์นี้จะถูกเรียกใช้เป็นค่าเริ่มต้นในการเปิดหรือบันทึกเอกสาร

# @label:textbox
source: Downloads folder:
th: โฟลเดอร์ดาวน์โหลด:

# @info:tooltip and accessible description
source: This folder will be used by default to save your downloaded items.
th: โฟลเดอร์นี้จะถูกเรียกใช้เป็นค่าเริ่มต้นในการบันทึกสิ่งที่ดาวน์โหลดไว้

# @label:textbox
source: Videos folder:
th: โฟลเดอร์วิดีโอ:

# @info:tooltip and accessible description
source: This folder will be used by default to open or save video files.
th: โฟลเดอร์นี้จะถูกเรียกใช้เป็นค่าเริ่มต้นในการเปิดหรือบันทึกวิดีโอ

# @label:textbox
source: Pictures folder:
th: โฟลเดอร์รูปภาพ:

# @info:tooltip and accessible description
source: This folder will be used by default to open or save image files.
th: โฟลเดอร์นี้จะถูกเรียกใช้เป็นค่าเริ่มต้นในการเปิดหรือบันทึกรูปภาพ

# @label:textbox
source: Music folder:
th: โฟลเดอร์เพลง:

# @info:tooltip and accessible description
source: This folder will be used by default to open or save music files.
th: โฟลเดอร์นี้จะถูกเรียกใช้เป็นค่าเริ่มต้นในการเปิดหรือบันทึกเพลง

# @label:textbox
source: Public folder:
th: โฟลเดอร์สาธารณะ:

# @info:tooltip and accessible description
source: This folder will be used by default for publicly-shared files when network sharing is enabled.
th: โฟลเดอร์นี้จะถูกเรียกใช้เป็นค่าเริ่มต้นสำหรับไฟล์ที่ถูกแชร์แบบสาธารณะเมื่อได้เปิดการแชร์แบบเครือข่าย

# @label:textbox
source: Templates folder:
th: โฟลเดอร์แม่แบบ:

# @info:tooltip and accessible description
source: This folder will be used by default to open or save file templates.
th: โฟลเดอร์นี้จะถูกเรียกใช้เป็นค่าเริ่มต้นในการเปิดหรือบันทึกแม่แบบ

# @action:button
source: Choose new location
th: เลือกตำแหน่งใหม่

source: Desktop
th: เดสก์ท็อป

source: Documents
th: เอกสาร

source: Downloads
th: ดาวน์โหลด

source: Music
th: เพลง

source: Pictures
th: รูปภาพ

source: Videos
th: วิดีโอ

source: Public
th: สาธารณะ

source: Templates
th: แม่แบบ

source: <h1>Paths</h1> This module allows you to choose where in the filesystem the files on your desktop should be stored. Use the "Whats This?" (Shift+F1) to get help on specific options.
th: <h1>เส้นทาง</h1> โมดูลนี้ให้คุณเลือกว่าจะเก็บไฟล์เดสก์ท็อปไว้ส่วนไหนของระบบไฟล์เลือกใช้เมนู "นี่คืออะไร ?" (หรือกด Shift+F1) เพื่อดูความช่วยเหลือของตัวเลือกที่ต้องการ

source: Desktop path:
th: เส้นทางเดสก์ท็อป:

source: This folder contains all the files which you see on your desktop. You can change the location of this folder if you want to, and the contents will move automatically to the new location as well.
th: โฟลเดอร์นี้บรรจุไฟล์ทั้งหมดที่คุณเห็นบนเดสก์ท็อป คุณสามารถเปลี่ยนตำแหน่งของโฟลเดอร์นี้ได้ตามต้องการ และไฟล์ต่าง ๆ ที่มีอยู่จะถูกย้ายไปยังตำแหน่งใหม่โดยอัตโนมัติ

source: Documents path:
th: เส้นทางเอกสาร:

source: This folder will be used by default to load or save documents from or to.
th: โฟลเดอร์นี้จะถูกเรียกใช้เป็นค่าเริ่มต้นในการเรียกใช้หรือบันทึกเอกสารจากที่ไหนหรือสู่ที่ไหน

source: Downloads path:
th: เส้นทางดาวน์โหลด:

source: This folder will be used by default to save your downloaded items.
th: โฟลเดอร์นี้จะถูกเรียกใช้เป็นค่าเริ่มต้นในการบันทึกสิ่งที่ดาวน์โหลดไว้

source: Videos path:
th: เส้นทางวิดีโอ:

source: This folder will be used by default to load or save movies from or to.
th: โฟลเดอร์นี้จะถูกเรียกใช้เป็นค่าเริ่มต้นในการเรียกใช้หรือบันทึกวิดีโอจากที่ไหนหรือสู่ที่ไหน

source: Pictures path:
th: เส้นทางรูปภาพ:

source: This folder will be used by default to load or save pictures from or to.
th: โฟลเดอร์นี้จะถูกเรียกใช้เป็นค่าเริ่มต้นในการเรียกใช้หรือบันทึกรูปภาพจากที่ไหนหรือสู่ที่ไหน

source: Music path:
th: เส้นทางเพลง:

source: This folder will be used by default to load or save music from or to.
th: โฟลเดอร์นี้จะถูกเรียกใช้เป็นค่าเริ่มต้นในการเรียกใช้หรือบันทึกเพลงจากที่ไหนหรือสู่ที่ไหน

source: Public path:
th: เส้นทางสาธารณะ:

source: This folder will be used by default to load or save public shares from or to.
th: โฟลเดอร์นี้จะถูกเรียกใช้เป็นค่าเริ่มต้นในการเรียกใช้หรือบันทึกไฟล์ที่ถูกแชร์จากที่ไหนหรือสู่ที่ไหน

source: Templates path:
th: เส้นทางแม่แบบ:

source: This folder will be used by default to load or save templates from or to.
th: โฟลเดอร์นี้จะถูกเรียกใช้เป็นค่าเริ่มต้นในการเรียกใช้หรือบันทึกแม่แบบจากที่ไหนหรือสู่ที่ไหน
