Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-desktop/kcm_krunnersettings.po
Languages: th

source: Position on screen:
th: ตำแหน่งบนหน้าจอ:

source: Top
th: ด้านบน

source: Center
th: ตรงกลาง

source: Activation:
th: การเรียกใช้งาน:

# @option:check
source: Activate when pressing any key on the desktop
th: เรียกใช้งานเมื่อกดปุ่มใดก็ได้บนหน้าเดสก์ท็อป

source: History:
th: ประวัติ:

# @option:check
source: Disabled
th: ปิดการใช้งาน

# @option:check
source: Remember past searches
th: จดจำการค้นหาอดีต

# @option:check
source: Retain last search when re-opening
th: ใช้การค้นหาที่พิมพ์ล่าสุดเมื่อเรียกใช้งานใหม่

# @option:check
source: Activity-aware (last search and history)
th: แยกกิจกรรม (ค้นหาล่าสุดและประวัติ)

# @option:check The thing being enabled is search history
source: Enable suggestions
th: เปิดใช้งานการแนะนำ

# @option:check The thing being enabled is search history
source: Enabled auto-complete
th: เปิดใช้งานการทำให้สมบูรณ์อัตโนมัติอยู่

source: Clear History…
th: ล้างประวัติ…

source: Clear History
th: ล้างประวัติ

# @action:button %1 activity name
source: Clear History for Activity "%1"
th: ล้างประวัติของกิจกรรม "%1"

# @item:inmenu delete krunner history for all activities
source: For all activities
th: ของกิจกรรมทั้งหมด

# @item:inmenu delete krunner history for this activity
source: For activity "%1"
th: ของกิจกรรม "%1"

# @label
source: Plugins:
th: ปลั๊กอิน:

# @action:button
source: Configure Enabled Search Plugins…
th: กำหนดค่าปลั๊กอินค้นหาที่เปิดใช้งานอยู่
