Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-desktop/kcm_activities.po
Languages: th

# @title:window
source: Activity Settings for %1
th: การตั้งค่ากิจกรรมสำหรับ %1

# @title:window
source: Create a New Activity
th: สร้างกิจกรรมใหม่

# @action:button as in, 'save changes'
source: Save
th: บันทึก

# @label:chooser
source: Icon:
th: ไอคอน:

# @label:textbox
source: Name:
th: ชื่อ:

# @label:textbox
source: Description:
th: คำอธิบาย:

# @option:check
source: While on this activity, allow:
th: ระหว่างอยู่ในกิจกรรมนี้ อนุญาติให้:

source: Tracking file and app use
th: ติดตามการใช้งานของไฟล์และแอป

# @option:check
source: Automatically turning off the screen
th: ปิดหน้าจอโดยอัตโนมัติ

# @option:check
source: Automatically shutting down or sleeping
th: ปิดหรือพักเครื่องโดยอัตโนมัติ

source: Shortcut for switching:
th: ปุ่มคีย์ลัดในการเปลี่้ยน:

# @info:tooltip
source: Delete %1 activity
th: ลบกิจกรรม %1

source: Create New…
th: สร้างใหม่…

# @title:window
source: Delete Activity
th: ลบกิจกรรม

# %1 is an activity name
source: Do you want to delete activity '%1'?
th: คุณอยากจะลบกิจกรรม '%1' หรือไม่?

source: Delete Activity
th: ลบกิจกรรม

source: Activities
th: กิจกรรม

source: Are you sure you want to delete '%1'?
th: คุณแน่ใจหรือว่าต้องการจะลบ '%1 ?

source: Error loading the QML files. Check your installation. Missing %1
th: การโหลดไฟล์ QML ล้มเหลว ตรวจสอบการติดตั้งของคุณ %1 หาย

source: General
th: ทั่วไป

# @title:window
source: Activity Settings
th: การตั้งค่ากิจกรรม

# @action:button
source: Create
th: สร้าง

source: Icon:
th: ไอคอน:

source: Name:
th: ชื่อ:

source: Description:
th: คำอธิบาย:

source: Privacy:
th: ความเป็นส่วนตัว:

source: Do not track usage for this activity
th: ห้ามติดตามการใช้งานสำหรับกิจกรรมนี้

source: How many months keep the activity history
th: เก็บประวัติกิจกรรมไว้กี่เดือน

source: Which data to keep in activity history
th: ข้อมูลใดที่จะเก็บไว้ในประวัติกิจกรรม

source: List of Applications whose activity history to save
th: รายการแอปพลิเคชันที่จะบันทึกประวัติใว้ในกิจกรรม

source: List of Applications whose activity history not to save
th: รายการแอปพลิเคชันที่จะไม่บันทึกประวัติใว้ในกิจกรรม

source: Switching
th: การสลับเปลี่ยน

# @info:tooltip
source: Configure %1 activity
th: กำหนดกิจกรรม %1

source: Activity switching
th: การสลับเปลี่ยนกิจกรรม

# @action
source: Walk through activities
th: เลื่อนผ่านกิจกรรมต่าง ๆ

# @action
source: Walk through activities (Reverse)
th: เลื่อนผ่านกิจกรรมต่าง ๆ (แบบตรงกันข้าม)

source: Remember for each activity (needs restart)
th: จดจำค่าสำหรับแต่ละกิจกรรม (ต้องเริ่มระบบใหม่)

source: Current virtual desktop:
th: Virtual Desktop ปัจจุบัน

source: Shortcuts:
th: คีย์ลัด:
