Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-desktop/kcm_landingpage.po
Languages: th

source: Color scheme name
th: ชื่อชุดสี

source: Single click to open files
th: กดครั้งเดียวเพิ่มเปิดไฟล์

source: Global Look and Feel package
th: แพ็กเกจธีมทั่วระบบ

source: Global Look and Feel package, alternate
th: แพ็กเกจธีมทั่วระบบ อันอื่น

source: Animation speed
th: ความเร็วแอนิเมชั่น

source: Theme:
th: ธีม:

# @title:group translate as short as possible
source: More appearance settings:
th: การตั้งค่ารูปลักษณ์เพิ่มเติม:

source: Change Wallpaper…
th: เปลี่ยนวอลเปเปอร์…

source: Animation speed:
th: ความเร็วแอนิเมชั่น:

source: More Appearance Settings…
th: การตั้งค่ารูปลักษณ์เพิ่มเติม…

# Animation speed
source: Slow
th: ช้า

# Animation speed
source: Instant
th: ทันที่

# part of a sentence: 'Clicking files or folders [opens them/selects them]'
source: Clicking files or folders:
th: การกดไฟล์หรือโฟลเดอร์

# part of a sentence: 'Clicking files or folders selects them'
source: Selects them
th: เป็นการเลือก

source: Open by double-clicking instead
th: เปิดโดยการกดดับเบิลคลิกแทย

# part of a sentence: 'Clicking files or folders opens them'
source: Opens them
th: เป็นการเปิด

source: More Behavior Settings…
th: การตั้งค่าพฤติกรรมเพิ่มเติม...

source: Select by clicking on item's selection marker
th: เลือกโดยการกดเครื่องหมายเลือกบนไอเท็มแทน

# @title:group translate as short as possible
source: More behavior settings:
th: การตั้งค่าพฤติกรรมเพิ่มเติม:

source: Most used pages:
th: หน้าที่ใช้บ่อยสุด:

source: Most Used Pages:
th: หน้าที่ใช้บ่อยสุด:
