Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-desktop/kcm_kded.po
Languages: th

source: Background Services
th: บริการพื้นหลัง

source: Failed to stop service: %1
th: การหยุดการทำงานของบริการ %1 ล้มเหลว

source: Failed to start service: %1
th: การเปิดการทำงานของบริการ %1 ล้มเหลว

source: Failed to stop service.
th: การหยุดการทำงานของบริการล้มเหลว

source: Failed to start service.
th: การเปิดการทำงานของบริการล้มเหลว

source: Failed to notify KDE Service Manager (kded6) of saved changed: %1
th: การแจ้งของการเปลี่ยนแปลง: %1 ของตัวจัดการบริการ KDE (kded6) ล้มเหลว

source: Failed to notify KDE Service Manager (kded5) of saved changed: %1
th: การแจ้งของการเปลี่ยนแปลง: %1 ของตัวจัดการบริการ KDE (kded5) ล้มเหลว

source: <p>This module allows you to have an overview of all plugins of the KDE Daemon, also referred to as KDE Services. Generally, there are two types of service:</p> <ul><li>Services invoked at startup</li><li>Services called on demand</li></ul> <p>The latter are only listed for convenience. The startup services can be started and stopped. You can also define whether services should be loaded at startup.</p> <p><b>Use this with care: some services are vital for Plasma; do not deactivate services if you do not know what you are doing.</b></p>
th: <p>โมดูลนี้สามารถให้คุณได้ดูภาพรวมของปลั๊กอินทั้งหมดของดีมอน KDE ซึ่งมีชื่อเรียกอีกชื่อหนึ่งคือบริการ KDE โดยทั่วไปแล้ว จะมีบริการอยู่สองอย่างคือ:</p> <ul><li>บริการที่ทำงานเมื่อระบบเริ่มการทำงาน</li><li>บริการที่ทำงานเมื่อถูกขอเรียกใช้</li></ul> <p>ซึ่งบริการแบบที่สองนั้นมีไว้เพื่อความสะดวกเท่านั้น ส่วนของบริการที่ใช้งานตอนเริ่มระบบนั้นสามารถเปิดหรือปิดก็ได้ คุญสามารถตั้งค่าว่าบริการใดที่ควรจะเริ่มทำงานตอนระบบเริ่มทำงานได้ด้วย</p> <p><b>โปรดปรับแต่งตัวเลือกนี้อย่างระมัดระวัง เนื่องจากบางบริการอาจจะจำเป็นสำหรับการทำงานของ Plasma ดังนั้น อย่าสั่งยกเลิกการทำงานของบริการที่คุณไม่แน่ใจหรือไม่รู้จัก</b></p>

# @info
source: If you're disabling something here to work around an issue, please <link url='%1'>submit a bug report about it as well.</link>
th: ถ้าคุณกำลังปิดใช้งานอะไรบางอย่างตรงนี้เพื่อที่จะแก้ไขปัญหาอะไรบางอย่าง ได้โปรด<link url='%1'>แจ้งข้อผิดพลาดด้วย</link>

source: The background services manager (kded6) is currently not running. Make sure it is installed correctly.
th: ตัวจัดการบริการพื้นหลัง (kded6) ยังไม่ทำงาน กรุณาทำให้แน่ใจว่าระบบได้ถูกติดตั้งอย่างถูกต้อง

source: The background services manager (kded5) is currently not running. Make sure it is installed correctly.
th: ตัวจัดการบริการพื้นหลัง (kded5) ยังไม่ทำงาน กรุณาทำให้แน่ใจว่าระบบได้ถูกติดตั้งอย่างถูกต้อง

source: Some services disable themselves again when manually started if they are not useful in the current environment.
th: บริการบางตัวอาจปิดตัวมันเองเมื่อถูกเริ่มเองโดยมือถ้าหากบริการตัวนั้นไร้ประโยชน์กับสภาพแวดล้อมปัจจุบัน

source: Some services were automatically started/stopped when the background services manager (kded6) was restarted to apply your changes.
th: บริการบางตัวถูกปิด/เปิดโดยอัตโนมัติเมื่อตัวจัดการบริการพื้นหลัง (kded6) ถูกเริ่มใหม่เพื่อที่จะตั้งค่าการเปลี่ยนแปลงของคุณ

source: Some services were automatically started/stopped when the background services manager (kded5) was restarted to apply your changes.
th: บริการบางตัวถูกปิด/เปิดโดยอัตโนมัติเมื่อตัวจัดการบริการพื้นหลัง (kded5) ถูกเริ่มใหม่เพื่อที่จะตั้งค่าการเปลี่ยนแปลงของคุณ

source: All Services
th: บริการทั้งหมด

# List running services
source: Running
th: ทำงานอยู่

# List not running services
source: Not Running
th: ยังไม่ทำงาน

source: Startup Services
th: บริการที่ทำงานตอนเริ่มระบบ

source: Load-on-Demand Services
th: บริการที่จะโหลดเมื่อต้องการ

# @action:button %1 service name
source: Disable automatically loading %1 on startup
th: ปิดการทำงาน %1 โดยอัตโนมัติเมื่อเริ่มระบบ

# @action:button %1 service name
source: Enable automatically loading %1 on startup
th: เปิดการทำงาน %1 โดยอัตโนมัติเมื่อเริ่มระบบ

source: Toggle automatically loading this service on startup
th: ปิด/เปิดการทำงานบริการนี้โดยอัตโนมัติเมื่อเริ่มระบบ

source: Not running
th: ยังไม่ทำงาน

source: Running
th: ทำงานอยู่

# @action:button %1 service name
source: Stop %1
th: หยุด %1

# @action:button %1 service name
source: Start %1
th: เริ่ม %1

source: Stop Service
th: หยุดบริการ

source: Start Service
th: เริ่มบริการ

# NAME OF TRANSLATORS
source: Your names
th: ถนอมทรัพย์ นพบูรณ์, Diskette Guy

# EMAIL OF TRANSLATORS
source: Your emails
th: donga.nb@gmail.com, diskette@dailitation.xyz
