Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-desktop/kcm_keys.po
Languages: th

# @title:group Launch app
source: Launch
th: เปิด

# %1 is the name of the component, %2 is the action for which saving failed
source: Error while saving shortcut %1: %2
th: การบันทึกคีย์ลัด %1 ล้มเหลว: %2

# %1 is the name of an application
source: Error while adding %1, it seems it has no actions.
th: การเพิ่ม %1 ล้มเหลว เหมือนกับว่าไม่มีการกระทำใด ๆ

source: Error while communicating with the global shortcuts service
th: การสื่อสารบริการคีย์ลัดทั่วระบบล้มเหลว

source: Failed to communicate with global shortcuts daemon
th: การสื่อสารกับดีม่อนคีย์ลัดทั่วระบบล้มเหลว

source: Shortcut %1 is already assigned to action '%2' of %3. Do you want to reassign it?
th: คีย์ลัด %1 ถูกกำหนดเป็น '%2' ใน %3 แล้ว คุณอยากจะนำไปใช้ใหม่หรือไม่

# @info %2 is the name of a category inside the 'Common Actions' section
source: Shortcut <shortcut>%1</shortcut> is already assigned to the common %2 action <interface>%3</interface>.<nl/><nl/>Re-assign it to %4?
th: คีย์ลัด <shortcut>%1</shortcut> ถูกกำหนดเป็นคำสั่งสามัญ %3 ของ <interface>%2</interface> อยู่แล้ว<nl/><nl/>คุณอยากจะนำไปใช้ใหม่เป็น %4 หรือไม่?

# %2 is the name of a category inside the 'Common Actions' section
source: Shortcut %1 is already assigned to the common %2 action '%3'. Do you want to reassign it?
th: คีย์ลัด %1 ถูกกำหนดเป็นคำสั่งสามัญ '%3' ของ %2 อยู่แล้ว คุณอยากจะนำไปใช้ใหม่หรือไม่

# @info
source: Shortcut <shortcut>%1</shortcut> is already assigned to action <interface>%2</interface> of <application>%3</application>.<nl/><nl/>Reassign it to action <interface>%4</interface> of <application>%5</application>?
th: คีย์ลัด <shortcut>%1</shortcut> ถูกกำหนดเป็นคำสั่ง <interface>%2</interface> ใน <application>%3</application><nl/><nl/>คุณอยากจะนำไปใช้ใหม่เป็น %4 ในแอป <application>%5</application> หรือไม่?

# @title:window
source: Resolve Shortcut Conflict
th: แก้ปุ่มคีย์ลัดขัดแย้งกัน

# @title:window
source: Found conflict
th: พบเจอปุ่มขัดแย้ง

# @action:button
source: Reassign
th: กำหนดใหม่

source: File
th: ไฟล์

source: Edit
th: แก้ไข

source: Navigation
th: การนำทาง

source: View
th: มุมมอง

source: Settings
th: ตั้งค่า

source: Help
th: ช่วยเหลือ

source: Applications
th: แอปพลิเคชัน

source: Commands
th: คำสั่ง

source: System Services
th: บริการระบบ

source: System Settings
th: การตั้งค่าระบบ

source: Common Actions
th: คำสั่งสามัญ

# @action:button Import shortcut scheme
source: Import…
th: นำเข้า…

# @action:button
source: Cancel Export
th: ยกเลิกการนำออก

source: Cancel Export
th: ยกเลิกการนำออก

# @action:button Export shortcut scheme
source: Export…
th: นำออก...

source: Cannot export scheme while there are unsaved changes
th: ไม่สามารถนำออกชุดคีย์ลัดได้ขณะที่ยังมีการเปลี่ยนแปลวที่ยังไม่ได้บันทึก

source: Select the components below that should be included in the exported scheme
th: เลือกหมวดหมู่ด้านล่างที่จะถูกนำออก

# @action:button Export shortcut scheme
source: Export
th: นำออก

# @action:button Add new shortcut
source: Add New
th: เพิ่มใหม่

# @action:menu End of the sentence 'Add New Application…'
source: Application…
th: แอปพลิเคชั่น...

# @action:menu accessible
source: Add new application
th: เพิ่มแอปพลิเคชันใหม่

source: Remove all shortcuts for %1
th: ลบคีย์ลัดทั้งหมดสำหรับ %1

# @action:menu End of the sentence 'Add New Command or Script…'
source: Command or Script…
th: คำสั่งหรือสคริปต์…

# @action:menu accessible
source: Add new command or script
th: เพิ่มคำสั่งหรือสคริปต์ใหม่…

# @option:check accessible export shortcuts %1 is application/group name
source: Export %1
th: นำออก %1

# @action:button accessible %1 is the name of a custom command
source: Edit command for %1
th: แก้ไขคำสั่งของ %1

# @info:tooltip %1 is the text of a custom command
source: Edit command for %1
th: แก้ไขคำสั่งของ %1

# @tooltip:button %1 is the text of a custom command
source: Edit command for %1
th: แก้ไขคำสั่งของ %1

# @action:button accessible %1 is the name of a shortcut category
source: Remove all shortcuts for %1
th: ลบคีย์ลัดทั้งหมดสำหรับ %1

# @info:tooltip %1 is the text of a shortcut category
source: Remove all shortcuts for %1
th: ลบคีย์ลัดทั้งหมดสำหรับ %1

# @action:button accessible
source: Undo deletion
th: ยกเลิกการลบออก

# @info:tooltip
source: Undo deletion
th: ยกเลิกการลบออก

source: Undo deletion
th: ยกเลิกการลบออก

# @action:button Keep translated text as short as possible
source: Add Application…
th: เพิ่มแอปพลิเคชัน…

# @action:button Keep translated text as short as possible
source: Add Command…
th: เพิ่มคำสั่ง…

source: No items matched the search terms
th: ไม่มีคำสั่งที่พบเจอในการค้นหา

source: Select an item from the list to view its shortcuts here
th: เลือกคำสั่งจากรายการเพื่อที่จะดูคีย์ลัดตรงนี้

source: Export Shortcut Scheme
th: นำออกชุดคำสั่งคีย์ลัด

source: Export Scheme…
th: นำออกชุดคีย์ลัด...

source: Import Shortcut Scheme
th: นำเข้าชุดคำสั่งคีย์ลัด

source: Import Scheme…
th: นำเข้าชุดคีย์ลัด

# Template for file dialog
source: Shortcut Scheme (*.kksrc)
th: ชุดคีย์ลัด (*.kksrc)

# Template for file dialog
source: Script file (*.*sh)
th: ไฟล์สคริปต์ (*.*sh)

source: Edit Command
th: แก้ไขคำสั่ง

source: Add Command
th: เพิ่มคำสั่ง

source: Save
th: บันทึก

source: Save scheme
th: บันทึกชุดคีย์ลัด

source: Add
th: เพิ่ม

source: Enter a command or choose a script file:
th: พิมพ์คำสั่งหรือเลือกไฟล์สคริปต์:

# @label:textbox A shell command
source: Command:
th: คำสั่ง:

# @label:textbox accessible
source: Command
th: คำสั่ง

# @action:button
source: Choose…
th: เลือก...

# @action:button accessible
source: Choose script file
th: เลือกไฟล์สคริปต์

# @label:textfield Human-readable name given to a shell command
source: Name:
th: ชื่อ:

# @info:placeholder
source: Enter name here
th: ป้อนชื่อตรงนี้

# @title:window
source: Choose Script File
th: เลือกไฟล์สคริปต์

source: Script files (.sh, .bash, .zsh, etc.) (*.*sh)
th: ไฟล์สคริปต์ (.sh .bash .zsh ฯลฯ) (*.*sh)

source: Select the scheme to import:
th: เลือกชุดคีย์ลัดที่จะนำเข้า:

source: Custom Scheme
th: ชุดแบบกำหนดเอง

source: Select File…
th: เลือกไฟล์…

source: Import
th: นำเข้า

source: Editing shortcut: %1
th: แก้ไขปุ่มคีย์ลัด: %1

source: No active shortcuts
th: ไม่มีปุ่มคีย์ลัดที่ใช้งานอยู่

# %1 decides if singular or plural will be used
source: Default shortcut
th: คีย์ลัดค่าเริ่มต้น

source: No default shortcuts
th: ไม่มีคีย์ลัดค่าเริ่มต้น

source: Default shortcut %1 is enabled.
th: คีย์ลัดค่าเริ่มต้น %1 ทำงานอยู่

source: Default shortcut %1 is disabled.
th: คีย์ลัดค่าเริ่มต้น %1 ปิดใช้งานอยู่

source: Custom shortcuts
th: คีย์ลัดกำหนดเอง

# @action:button accessible
source: Delete shortcut
th: ลบคีย์ลัด

# @info:tooltip
source: Delete this shortcut
th: ลบคีย์ลัดนี้

source: Delete this shortcut
th: ลบคีย์ลัดนี้

# @action:button Add custom shortcut
source: Add…
th: เพิ่ม...

# @action:button accessible
source: Add custom shortcut
th: เพิ่มปุ่มคีย์ลัดแบบกำหนดเอง

source: Add custom shortcut
th: เพิ่มปุ่มคีย์ลัดแบบกำหนดเอง

# @action:button accessible
source: Cancel capturing shortcut
th: ยกเลิกการจับดูปุ่มที่กด

# @info:tooltip
source: Cancel capturing of new shortcut
th: ยกเลิกการจับดูปุ่มที่กดใหม่

source: Cancel capturing of new shortcut
th: ยกเลิกการจับดูปุ่มที่กดใหม่
