Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-desktop/kcm_plasmasearch.po
Languages: th

source: Favorite Plugins
th: ปลั๊กอินโปรด

source: Available Plugins
th: ปลั๊กอินที่มีอยู่

source: Configure KRunner…
th: กำหนดค่า KRunner...

source: Get New Plugins…
th: รับปลั๊กอินใหม่...

source: Enable or disable plugins (used in KRunner, Application Launcher, and the Overview effect). Mark plugins as favorites and arrange them in order you want to prioritize them.
th: เปิดหรือปิดการใช้งานของปลั๊กอิน (ใช้ใน KRunner, ตัวเปิดแอปพลิเคชัน และโหมดภาพโดยรวม) หมายปลั๊กอินให้กลายเป็นปลั๊กอินโปรดและเรียงลำดามตามที่คุณอยากได้

source: Remove from favorites
th: ลบจากรายการโปรด

source: Add to favorites
th: เพิ่มไปในรายการโปรด

# @info:status
source: Failed to run install script in terminal <message>%1</message>
th: การรันสริปต์ติดตั้งในเทอร์มินอลล้มเหลว <message>%1</message>

# @info
source: Installation executed successfully, you may now close this window
th: การติดตั้งได้ดำเนินการอย่างสำเร็จ สามารถปิดหน้าต่างนี้ได้

# @info
source: Uninstallation executed successfully, you may now close this window
th: การถอนติดตั้งได้ดำเนินการอย่างสำเร็จ สามารถปิดหน้าต่างนี้ได้

source: Failed to copy file %1 to %2
th: การคัดลอกไฟล์ %1 ไปยัง %2 ล้มเหลว

# @info
source: Failed to remove file %1:<nl/>%2
th: การลบไฟล์ %1 ล้มเหลว:<nl/>%2

# @info
source: KRunner plugin installation failed
th: การติดตั้งปลั๊กอิน KRunner ล้มเหลว

# @info:shell
source: Command to execute: install or uninstall
th: คำสั่งที่จะใช้งาน: ติดตั้งหรือถอนการติดตั้ง

# @info:shell
source: Command to execute: install or uninstall.
th: คำสั่งที่จะใช้งาน: ติดตั้งหรือถอนการติดตั้ง

# @info:shell
source: Path to archive or extracted folder
th: เส้นทางไปยังอาร์ไคฟ์หรือโฟล์เดอร์ที่แตกไฟล์แล้ว

# @info:shell
source: Do not show a visual confirmation dialog
th: อย่าแสดงหน้าต่างยืนยัน

# @info:shell
source: Path to archive.
th: พื้นที่ไปยังไฟล์อาร์ไคฟ์

# @info
source: No PackageKit support
th: ไม่มีการรับรอง PackageKit

# @title:window
source: Confirm Installation
th: ยืนยันการติดตั้ง

# @info
source: You are about to install a binary package. You should only install these from a trusted author/packager.
th: คุณกำลังจะติดตั้งแพ็กเกจไบนารี คุณควรที่จะติดตั้งแพ็กเกจพวกนี้จากผู้สร้างหรือผู้ดูแลแพ็กเกจที่เชื่อถือเท่านั้น

# @action:button
source: Accept Risk And Continue
th: ยืนยอมความเสี่ยงและดำเนินการ

# @action:button
source: View File
th: ดูไฟล์

# @info
source: The mime type %1 is not supported by the packagekit backend
th: MIME ชนิด %1 ไม่ได้ถูกรับรองโดย PackageKit

# @info
source: This plugin executes the following command for starting the "%1" service:<nl/>%2
th: ปลั๊กอินนี้รันคำสั่งดังต่อไปนี้เพื่อในการเริ่มบริการ "%1":<nl/>%2

# @info
source: This plugin does not provide an uninstallation script. Please contact the author. You can try to uninstall the plugin manually.<nl/>If you do not feel capable or comfortable with this, click <interface>Cancel</interface> now.
th: ปลั๊กอินนี้ไม่มีสคริปต์ถอนการติดตั้ง กรุณาติดต่อผู้เขียน คุณสามารถลองถอนการติดตั้งเองได้<nl/>ถ้าหากคุณรู้สึกว่าไม่สามารถทำเช่นนั้นได้ กดปุ่ม<interface>ยกเลิก</interface>

# @info
source: This plugin does not provide an uninstallation script. Please contact the author. You can try to uninstall the plugin manually. Please have a look at the README for instructions from the author.<nl/>If you do not feel capable or comfortable with this, click <interface>Cancel</interface> now.
th: ปลั๊กอินนี้ไม่มีสคริปต์ถอนการติดตั้ง กรุณาติดต่อผู้เขียน คุณสามารถลองถอนการติดตั้งเอง โปรดลองไปดูคู่มือจากไฟล์ README ของผู้เขียน<nl/>ถ้าหากคุณรู้สึกว่าไม่สามารถทำเช่นนั้นได้ กดปุ่ม<interface>ยกเลิก</interface>

# @info
source: This plugin does not provide an installation script. Please contact the author. You can try to install the plugin manually.<nl/>If you do not feel capable or comfortable with this, click <interface>Cancel</interface> now.
th: ปลั๊กอินนี้ไม่มีสคริปต์การติดตั้ง กรุณาติดต่อผู้เขียน คุณสามารถลองการติดตั้งเองได้<nl/>ถ้าหากคุณรู้สึกว่าไม่สามารถทำเช่นนั้นได้ กดปุ่ม<interface>ยกเลิก</interface>

# @info
source: This plugin does not provide an installation script. Please contact the author. You can try to install the plugin manually. Please have a look at the README for instructions from the author.<nl/>If you do not feel capable or comfortable with this, click <interface>Cancel</interface> now.
th: ปลั๊กอินนี้ไม่มีสคริปต์การติดตั้ง กรุณาติดต่อผู้เขียน คุณสามารถลองการติดตั้งเองได้ โปรดลองไปดูคู่มือจากไฟล์ README ของผู้เขียน<nl/>ถ้าหากคุณรู้สึกว่าไม่สามารถทำเช่นนั้นได้ กดปุ่ม<interface>ยกเลิก</interface>

# @info
source: This plugin uses a script for installation which can pose a security risk. Please examine the entire plugin's contents before installing, or at least read the script's source code.<nl/>If you do not feel capable or comfortable with this, click <interface>Cancel</interface> now.
th: ปลั๊กอินนี้ใช้สคริปต์ในการติดตั้งซึ่งอาจจะเป็นภัยร้ายต่อระบบคุณได้ กรุณาตรวจสอบเนื้อหาของปลั๊กอินก่อนติดตั้ง หรืออย่างน้อยอ่านรหัสต้นทางของสคริปต์<nl/>ถ้าหากคุณรู้สึกว่าไม่สามารถทำเช่นนั้นได้ กดปุ่ม<interface>ยกเลิก</interface>

# @info
source: This plugin uses a script for installation which can pose a security risk. Please examine the entire plugin's contents before installing, or at least read the README file and the script's source code.<nl/>If you do not feel capable or comfortable with this, click <interface>Cancel</interface> now.
th: ปลั๊กอินนี้ใช้สคริปต์ในการติดตั้งซึ่งอาจจะเป็นภัยร้ายต่อระบบคุณได้ กรุณาตรวจสอบเนื้อหาของปลั๊กอินก่อนติดตั้ง หรืออย่างน้อยอ่านไฟล์ README และรหัสต้นทางของสคริปต์<nl/>ถ้าหากคุณรู้สึกว่าไม่สามารถทำเช่นนั้นได้ กดปุ่ม<interface>ยกเลิก</interface>

# @action:button
source: Mark entry as uninstalled
th: ทำเครื่องหมายว่าถอนการติดตั้งแล้ว

# @action:button
source: Mark entry as installed
th: ทำเครื่องหมายว่าติดตั้งแล้ว

# @action:button
source: View Script
th: ดูสคริปต์

# @action:button
source: View Source Directory
th: ดูไดเร็กทอรีสคริปต์

# @action:button
source: View %1
th: ดู %1

# @info
source: Could not resolve package name of %1
th: ไม่พบเจอชื่อแพ็กเกจ %1

# @info
source: Failed to run install command: <message>%1</message>
th: การรันคำสั่่งติดตั้ง %1 ล้มเหลว

source: Enable or disable plugins (used in KRunner, Application Launcher, and the Overview effect)
th: เปิด/ปิดปลั๊กอิน (ที่ถูกใช้ใน KRunner, ตัวเปิดแอปพลิเคชัน และโหมดโดยรวม)
