Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-desktop/kcm_device_automounter.po
Languages: th

# NAME OF TRANSLATORS
source: Your names
th: ถนอมทรัพย์ นพบูรณ์, Diskette Guy

# EMAIL OF TRANSLATORS
source: Your emails
th: donga.nb@gmail.com, diskette@dailitation.xyz

source: This list contains the storage devices known to the system. If "Automount on Login" is checked, the device will be automatically mounted even though "Mount all removable media at login" is unchecked. The same applies for "Automount on Attach".
th: รายการนี้มีอุปกรณ์จัดเก็บข้อมูลต่าง ๆ ที่ระบบรู้จัก หากเลือกตัวเลือก "ต่อเชื่อมอัตโนมัติเมื่อล็อกอิน" อุปกรณ์จะถูกทำการต่อเชื่อมให้โดยอัตโนมัติ แม้ว่าจะไม่ได้กาเลือกตัวเลือก "ต่อเชื่อมสื่อแบบถอดได้ทั้งหมดเมื่อทำการล็อกอิน" ไว้ก็ตาม ทั้งนี้จะมีผลเช่นเดียวกับตัวเลือก "ต่อเชื่อมอัตโนมัติเมื่อมีการเสียบอุปกรณ์"

source: Clicking this button causes the selected devices to be 'forgotten'. This is only useful if "Only automatically mount removable media that has been manually mounted before" is checked. Once a device is forgotten and the system is set to only automatically mount familiar devices, the device will not be automatically mounted.
th: การกดปุ่มนี้จะทำให้อุปกรณ์ 'ถูกลืม' ซึ่งมีประโยชน์ถ้าหากได้เลือกตัวเลือก "ต่อเชื่อมสื่อแบบถอดได้ที่เคยต่อเชื่อมมาก่อนแล้วโดยอัตโนมัติ" ถ้าหากอุปกรณ์ได้ถูกละลืมและระบบได้ถูกตั้งให้ต่อเชื่อมอุปกรณ์ที่คุ้นเคย อุปกรณ์จะไม่ถูกต่อให้โดยอัตโนมัติ

source: Forget Device
th: ลืมอุปกรณ์

source: When this is not checked, only remembered devices will be automatically mounted. A device is 'remembered' if it has ever been mounted before. For instance, plugging in a USB media player to charge is not sufficient to 'remember' it - if the files are not accessed, it will not be automatically mounted the next time it is seen. Once they have been accessed, however, the device's contents will be automatically made available to the system.
th: เมื่อไม่ได้เลือกตัวเลือกนี้ ระบบจะต่อเชื่อมอุปกรณ์ให้โดยอัตโนมัติเฉพาะกับอุปกรณ์ที่จดจำได้เท่านั้น อุปกรณ์จะถูก 'จดจำ' ต่อเมื่อถูกเคยต่อเชื่อมมาก่อน กรณีเช่น การเสียบอุปกรณ์เครื่องเล่นสื่อแบบ USB เพื่อที่จะชาร์จเท่านั้น จะยังไม่ถือว่าเป็นอุปกรณ์ที่ถูก 'จดจำได้' - ตราบใดที่ยังไม่เคยมีการเข้าถึงไฟล์ต่าง ๆ ที่อยู่ในนั้น จะไม่ถูกต่อเชื่อมโดยอัตโนมัติเมื่อถูกเชื่อมต่อเข้าระบบครั้งหน้า แต่เมื่อใดที่อุปกรณ์เคยถูกเข้าถึงไฟล์ต่าง ๆ มาแล้ว เนื้อหาข้างในของอุปกรณ์จะสามารถใช้งานได้โดยระบบอย่างอัตโนมัติ

source: Automatically mount removable media that have never been mounted before
th: ต่อเชื่อมสื่อแบบถอดได้ที่ไม่เคนถูกต่อเชื่อมมาก่อนโดยอัตโนมัติ

source: Automount Device
th: อุปกรณ์ที่ต่อเชื่อมโดยอัตโนมัติ

# As in automount on login
source: On Login
th: ตอนเข้าสู่ระบบ

# As in automount on attach
source: On Attach
th: ตอนเชื่อมต่อ

source: All Devices
th: อุปกรณ์ทั้งหมด

source: All Known Devices
th: อุปกรณ์ที่รู้จักทั้งหมด

source: Attached Devices
th: อุปกรณ์ที่ถูกเชื่อมต่อเข้ามา

source: Disconnected Devices
th: อุปกรณ์ที่เลิกเชื่อมต่อแล้ว

source: UDI: %1
th: ค่า UDI: %1

source: This device will be automatically mounted at login.
th: อุปกรณ์นี้จะถูกต่อเชื่อมให้โดยอัตโนมัติเมื่อทำการเข้าสู่ระบบ

source: This device will not be automatically mounted at login.
th: อุปกรณ์นี้จะไม่ถูกต่อเชื่อมให้โดยอัตโนมัติเมื่อทำการเข้าสู่ระบบ

source: This device will be automatically mounted when attached.
th: อุปกรณ์นี้จะถูกต่อเชื่อมให้โดยอัตโนมัติเมื่อมีการเชื่อมต่ออุปกรณ์

source: This device will not be automatically mounted when attached.
th: อุปกรณ์นี้จะไม่ถูกต่อเชื่อมให้โดยอัตโนมัติเมื่อมีการเชื่อมต่ออุปกรณ์

source: Device Automounter
th: ตัวต่อเชื่อมอุปกรณ์โดยอัตโนมัติ

source: Original Author
th: ผู้เขียนดั้งเดิม

source: Plasma 5 Port
th: พอร์ต Plasma 5
