Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-desktop/kcm_keyboard.po
Languages: th

# NAME OF TRANSLATORS
source: Your names
th: ถนอมทรัพย์ นพบูรณ์, Diskette Guy

# EMAIL OF TRANSLATORS
source: Your emails
th: donga.nb@gmail.com, diskette@dailitation.xyz

source: Keyboard Layout Switcher
th: ตัวสลับเปลี่ยนผังแป้นพิมพ์

source: Switch to Next Keyboard Layout
th: สลับไปใช้ผังแป้นพิมพ์ถัดไป

source: Switch to Last-Used Keyboard Layout
th: สลับไปใช้ผังแป้นพิมพ์ที่ใช้ล่าสุด

source: Switch keyboard layout to %1
th: สลัปไปใช้ผังแป้นพิมพ์ %1

# unknown keyboard model vendor
source: Unknown
th: ไม่ทราบ

# app display name
source: Keyboard Preview
th: แสดงตัวอย่างแป้นพิมพ์

# app description
source: Keyboard layout visualization
th: การแสดงภาพผังแป้นพิมพ์

# @label
source: The keyboard geometry failed to load. This often indicates that the selected model does not support a specific layout or layout variant. This problem will likely also present when you try to use this combination of model, layout and variant. Previewing layouts that are defined outside your systems xkb directory is not supported and will also trigger this message. These might still work fine if applied
th: การเปิดรูปลักษณะของผังแป้นพิมพ์ล้มเหลว ข้อผิดพลาดนี้ส่วนใหญ่แล้วหมายความว่าโมเดลที่ถูกเลือกไม่มีการรองรับผังที่เจาะโจงหรือรูปแบบอื่น ๆ ของผังนั้น ๆ ปัญหานี้ก็จะเกิดขึ้นเช่นกันถ้าหากคุณพยายามที่จะใช้รุ่น ผัง และรูปแบบนี้เข้าด้วยกัน การแสดงตัวอย่างที่ถูกกำหนดค่านอกเหนือจากไดเรกทอรี xkb ของระบบจะไม่ถูกรับรอง และก็จะแสดงข้่อความนี้เช่นกัน แต่อาจจะใช้งานได้ปกติถ้าหากเป็นเช่นงั้น

# @label
source: The keyboard geometry failed to load. This often indicates that the selected model does not support a specific layout or layout variant. This problem will likely also present when you try to use this combination of model, layout and variant.
th: การเปิดรูปลักษณะของผังแป้นพิมพ์ล้มเหลว ข้อผิดพลาดนี้ส่วนใหญ่แล้วหมายความว่าโมเดลที่ถูกเลือกไม่มีการรองรับผังที่เจาะโจงหรือรูปแบบอื่น ๆ ของผังนั้น ๆ ปัญหานี้ก็จะเกิดขึ้นเช่นกันถ้าหากคุณพยายามที่จะใช้รุ่น ผัง และรูปแบบนี้เข้าด้วยกัน

# @title
source: Key Bindings
th: การตั้งค่าปุ่มพิมพ์

# @label:checkbox
source: Configure keyboard options
th: กำหนดค่าตัวเลือกของแป้นพิมพ์

# @action:button
source: Reset
th: ตั้งค่าใหม่

# @info accessible
source: Reset selected options for this group
th: ตั้งค่าตัวเลือกที่เลือกไว้ใหม่สำหรับกลุ่มนี้

# @info:tooltip
source: Reset selected options for this group
th: ตั้งค่าตัวเลือกที่เลือกไว้ใหม่สำหรับกลุ่มนี้

# @title:window
source: Add Layout
th: เพิ่มผังแป้นพิมพ์

# @label:textbox
source: Short layout name
th: ชื่อผังแป้นพิมพ์แบบสั้น

# @info
source: The abbreviated name of the selected layout, which will be displayed in the system tray. You can change this setting yourself.
th: ชื่อย่อของผังแป้นพิมพ์ที่ถูกเลือกที่จะแสดงในถาดระบบ คุฯสามารถเปลี่ยนการตั้งค่านี้ด้วยตนเอง

# @option:textbox
source: Shortcut:
th: ปุ่มคีย์ลัด:

# @action:button
source: Preview
th: แสดงตัวอย่าง

# @action:button
source: Configure Switching…
th: กำหนดค่าการสลับเปลี่ยน…

# @action:button accessible
source: Configure Switching
th: กำหนดค่าการสลับเปลี่ยน

# @action:button
source: Key Bindings
th: การตั้งค่าปุ่มพิมพ์

# @action:button accessible
source: Key Bindings
th: การตั้งค่าปุ่มพิมพ์

# @action:button Layout
source: Add…
th: เพิ่ม...

# @action:button accessible
source: Add layout
th: เพิ่มผังแป้นพิมพ์

# @label:checkbox configure layouts option
source: Enable
th: เปิดใช้งาน

# @label:checkbox accessible
source: Configure Layouts
th: กำหนดค่าผังแป้นพิมพ์

# @label:listbox Keyboard model
source: Model:
th: รุ่น:

# @label:listbox
source: NumLock on startup:
th: สถานะ NumLock เมื่อระบบเริ่มการทำงาน

# @item:inlistbox Turn on "NumLock" on startup
source: Turn on
th: เปิด

# @item:inlistbox Turn off "NumLock" on startup
source: Turn off
th: ปิด

source: Leave unchanged
th: ไม่เปลี่ยนแปลง

# @label:checkbox
source: Key repeat:
th: การพิมพ์ซ้ำ:

# @label:checkbox accessible
source: Key repeat
th: การพิมพ์ซ้ำ

# @label:textbox Key repeat delay
source: Delay:
th: ระยะหน่วงเวลา:

# @label:spinbox accessible
source: Key repeat delay %1
th: ระยะหน่วงเวลาการพิมพ์ซ้ำ %1

# @label:textbox Key repeat rate
source: Rate:
th: อัตราความเร็ว:

# @label:spinbox accessible
source: Key repeat rate %1
th: อัตราความเร็วของการพิมพ์ซ้ำ %1

# @spinbox:value Key repeat rate
source: %1 repeats/s
th: %1 ครั้ง/วิ

# @spinbox:value Key repeat rate
source: repeats/s
th: ครั้ง/วินาที

# @label:textbox
source: Test area:
th: พื้นที่ทดสอบ:

# @info:placeholder
source: Type here to test settings
th: พิมพ์ตรงนี้เพื่อทดสอบ

# @title:view
source: Layouts
th: ผังแป้นพิมพ์

# @action:button
source: Move Up
th: ย้ายขึ้น

# @action:button accessible
source: Move %1 layout up
th: ย้ายผัง %1 ขึ้น

# @action:button
source: Move Down
th: ย้ายลง

# @action:button accessible
source: Move %1 layout Down
th: ย้ายผัง %1 ลง

# @action:button accessible
source: Preview
th: แสดงตัวอย่าง

# @action:button
source: Remove
th: เอาออก

# @action:button accessible
source: Remove layout %1
th: เอาออกผัง %1

# @label:checkbox
source: Spare layouts:
th: ผังแป้นพิมพ์สำรอง:

# @label:spinbox
source: Number of spared main layouts
th: จำนวนของผังแป้นพิมพ์สำรองหลัก

# @label:textbox completes spinbox, x main layouts
source: main layouts
th: ผังแป้นพิมพ์หลัก

# @info
source: You can have up to 4 main layouts, all other layouts are spare. Spare layouts are not included when cycling through the layouts, but can be accessed through the keyboard indicator applet or by setting a custom shortcut.
th: คุณสามารถมีผังแป้นพิมพ์หลักทั้งหมด 4 ตัวได้ ผังอื่น ๆ จะเป็นผังสำรองหมด ผังสำรองจะไม่ถูกใช้งานเมื่อถูกสลับเปลี่ยนไปยังผังต่าง ๆ แต่จะสามารถเข้าถึงได้ผ่านทางแอปเพล็ตบ่งชี้แป้นพิมพ์และคีย์ลัดที่ถูกตั้งไว้

# @label:group Shortcut to change the keyboard layout. Keep it short
source: Change layout shortcut:
th: คีย์ลัดเปลี่ยนผัง:

# @label Change layout shortcut or "Configure Switching"
source: or
th: หรือ

# @title
source: Configure Switching
th: กำหนดค่าการสลับเปลี่ยน

# @title:group
source: Behavior
th: พฤติกรรม

# @label:listbox
source: Switching layout affects:
th: การสลับเปลี่ยนผังมีผลกระทบต่อ:

# @item:inlistbox
source: All windows
th: หน้าต่างทุกบาน

# @item:inlistbox
source: All windows on current desktop
th: หน้าต่างทุกบานบนหน้าเดสก์ท็อปปัจจุบัน

# @item:inlistbox
source: All windows of current application
th: หน้าต่างทุกบานของหน้าแอปพลิเคชันปัจจุบัน

# @item:inlistbox
source: Current window only
th: หน้าต่างปัจจุบันเท่านั้น

# @label:checkbox
source: Show OSD popup on layout change
th: แสดงป๊อปอัพบนหน้าจอเมื่อเปลี่ยนผัง

# @label:checkbox
source: Show notification on layout change
th: แสดงการแจ้งเตือนเมื่อเปลี่ยนผัง

# @title:group
source: Shortcuts
th: ปุ่มคีย์ลัด

# @option:textbox
source: Change layout:
th: เปลี่ยนผังแป้นพิมพ์:

# @option:textbox
source: Switch to last used layout:
th: สลับไปใช้ผังแป้นพิมพ์ที่ใช้ล่าสุด:

# @title:group
source: Legacy Shortcuts
th: ปุ่มคีย์ลัดแบบเก่า

# @info
source: Legacy X11 shortcuts allow finer control of modifier-only shortcuts and have slightly better support on X11 in edge cases. They can also be used on Wayland.<nl/><nl/>Setting these shortcuts will take you to the Key bindings page.
th: ปุ่มคีย์ลัดแบบเก่าของ X11 สามารถควบคุมคีย์ลัดที่มีปุ่มดัดแปรเท่านั้นได้ และมีการรับรอง X11 ดีกว่านิดหน่อย แต่ก็ใช้ได้กับ Wayland ด้วยเช่นกัน<nl/><nl/>การตั้งค่าปุ่มพวกนี้จะนำพาคุณไปยังหน้าการตั้งค่าปุ่มพิมพ์

# @option:textbox
source: Alternative symbols:
th: สัญลักษณ์อื่น ๆ :

# @info
source: Modifier keys can be used to type additional characters, symbols, and diacritical marks.
th: ปุ่มดัดแปรสามารถใช้ในการพิมพ์ตัวอักษรอื่น ๆ สัญลักษณ์ และเครื่องหมายวรรณยุกต์

source: %1 shortcut
th: %1 ปุ่มคีย์ลัด

# no shortcuts defined
source: None
th: ไม่มี

source: Add Layout
th: เพิ่มผังแป้นพิมพ์

source: Search…
th: ค้นหา...

source: Shortcut:
th: ปุ่มคีย์ลัด:

source: Label:
th: แถบป้าย:

source: Preview
th: แสดงตัวอย่าง

source: KDE Keyboard Control Module
th: โมดูลควบคุมแป้นพิมพ์ของ KDE

source: <h1>Keyboard</h1> This control module can be used to configure keyboard parameters and layouts.
th: <h1>แป้นพิมพ์</h1> โมดูลควบคุมนี้ใช้ปรับแต่งพารามิเตอร์และผังแป้นพิมพ์

source: Hardware
th: ฮาร์ดแวร์

source: Keyboard &model:
th: &รุ่นของแป้นพิมพ์:

source: Here you can choose a keyboard model. This setting is independent of your keyboard layout and refers to the "hardware" model, i.e. the way your keyboard is manufactured. Modern keyboards that come with your computer usually have two extra keys and are referred to as "104-key" models, which is probably what you want if you do not know what kind of keyboard you have.
th: คุณสามารถเลือกรุ่นของแป้นพิมพ์ได้ที่นี่ การตั้งค่าตรงนี้ขึ้นอยู่กับผังแป้นพิมพ์ของคุณ และสื่อไปถึงรุ่น "ฮาร์ดแวร์" ด้วย เช่น คีย์บอร์ดได้ถูกผลิตมาอย่างไร แป้นพิมพ์สมัยใหม่ที่มากับเครื่องคอมพิวเตอร์ของคุณนั้น ตามปกติจะมากับปุ่มพิเศษ 2 ปุ่ม ซึ่งเราจะเรียกว่า เป็นแป้นพิมพ์รุ่น "104 ปุ่มพิมพ์" ซึ่งอาจจะเป็นรุ่นที่คุณต้องการ ในกรณีที่คุณไม่ทราบว่าแป้นพิมพ์ที่คุณมีเป็นรุ่นอะไร

source: Layouts
th: ผังแป้นพิมพ์

source: If you select "Application" or "Window" switching policy, changing the keyboard layout will only affect the current application or window.
th: หากคุณเลือกข้อกำหนดการสลับผังแป้นพิมพ์ในแบบ "แอปพลิเคชัน" หรือ "หน้าต่าง" การเปลี่ยนผังแป้นพิมพ์จะมีผลกับแต่ละโปรแกรมหรือแต่ละหน้าต่างปัจจุบันเท่านั้น

source: Switching Policy
th: ข้อกำหนดการเปลี่ยนผังแป้นพิมพ์

source: &Global
th: ใช้ร่วมกันทั้ง&ระบบ

source: &Desktop
th: ใช้ร่วมกันในแต่ละ&เดสก์ท็อป

source: &Application
th: ใช้ร่วมกันในแต่ละแ&อปพลิเคชัน

source: &Window
th: ห&น้าต่าง

source: Shortcuts for Switching Layout
th: คีย์ลัดของการสลับผังแป้นพิมพ์

source: Main shortcuts:
th: ปุ่มคีย์ลัดหลัก:

source: This is a shortcut for switching layouts which is handled by X.org. It allows modifier-only shortcuts.
th: นี่เป็นปุ่มคีย์ลัดสำหรับการสลับผังแป้นพิมพ์ ซึ่งควบคุมโดย X.org โดยสามารถใช้ปุ่มคีย์ลัดมีแต่ปุ่มดัดแปรเท่านั้นได้

# no shortcut defined
source: None
th: ไม่มี

source: 3rd level shortcuts:
th: ปุ่มคีย์ลัดระดับที่ 3:

source: This is a shortcut for switching to a third level of the active layout (if it has one) which is handled by X.org. It allows modifier-only shortcuts.
th: นี่เป็นปุ่มคีย์ลัดของการสลับไปยังระดับที่สามของผังที่ใช้อยู่ (ถ้ามี) ซึ่งควบคุมโดย X.org โดยสามารถใช้ปุ่มคีย์ลัดมีแต่ปุ่มดัดแปรเท่านั้นได้

source: Alternative shortcut:
th: คีย์ลัดอื่น ๆ :

source: This is a shortcut for switching layouts. It does not support modifier-only shortcuts and also may not work in some situations (e.g. if popup is active or from screensaver).
th: นี่เป็นปุ่มคีย์ลัดของการสลับเปลี่ยนผังแป้นพิมพ์ ปุ่มคีย์ลัดนี้ ไม่รองรับการใช้งานที่มีแต่ปุ่มดัดแปรเท่านั้น และอาจจะไม่ทำงานในบางสถานการณ์ (เช่น เมื่อหน้าต่างป็อปอัพโผล่มา หรือจากโปรแกรมรักษาจอภาพ)3

source: Configure layouts
th: ปรับแต่งผังแป้นพิมพ์

source: Add
th: เพิ่ม

source: Remove
th: เอาออก

source: Move Up
th: ย้ายขึ้น

source: Move Down
th: ย้ายลง

source: Spare layouts
th: ผังแป้นพิมพ์สำรอง

source: Main layout count:
th: จำนวนผังแป้นหลัก:

source: Advanced
th: ตั้งค่าขั้นสูง

source: &Configure keyboard options
th: &ปรับแต่งตัวเลือกต่าง ๆ ของแป้นพิมพ์

# layout map name
source: Map
th: ตั้งค่า

source: Layout
th: ผังแป้นพิมพ์

source: Variant
th: รูปแบบ

source: Label
th: ป้ายกำกับ

source: Shortcut
th: คีย์ลัด

# variant
source: Default
th: ค่าเริ่มต้น

source: When a key is held:
th: เมื่อปุ่มได้ถูกกดค้าง:

source: &Show accented and similar characters
th: &แสดงตัวอักษรที่มีเครื่องหมายวรรณยุกต์และที่คล้ายกัน

source: &Repeat the key
th: &กดปุ่มซ้ำ

source: &Do nothing
th: &ไม่ทำอะไรเลย

source: Test area:
th: พื้นที่ทดสอบ:

source: Allows to test keyboard repeat and click volume (just don't forget to apply the changes).
th: เป็นพื้นที่เพื่อที่จะทดสอบการกดปุ่มซ้ำของแป้นพิมพ์และจำนวนการกด (แค่อย่าลืมนำค่ามาใช้ก็พอ)

source: If supported, this option allows you to setup the state of NumLock after Plasma startup.<p>You can configure NumLock to be turned on or off, or configure Plasma not to set NumLock state.
th: ถ้ามีการรองรับ ตัวเลือกนี้จะให้คุณตั้งค่าสถานะของปุ่มพิมพ์ NumLock หลังจาก Plasma เริ่มทำงาน<p>คุณสามารถปรับแต่ง NumLock ให้เปิดหรือปิดได้ หรืออาจจะปรับแต่ง Plasma ไม่ให้ตั้งค่าสถานะ NumLock ก็ได้

source: NumLock on Plasma Startup
th: สถานะ NumLock เมื่อ Plasma เริ่มการทำงาน

source: T&urn on
th: เปิ&ด

source: &Turn off
th: ปิ&ด

source: Leave unchan&ged
th: ไม่เปลี่&ยนแปลง

source: &Rate:
th: อัตราเ&ร็วของการพิมพ์ซ้ำ:

source: If supported, this option allows you to set the delay after which a pressed key will start generating keycodes. The 'Repeat rate' option controls the frequency of these keycodes.
th: ถ้ามีการรองรับ ตัวเลือกนี้จะให้คุณตั้งค่าระยะเวลาว่ากดปุ่มพิมพ์ค้างนานเท่าไรจึงจะเริ่มพิมพ์ซ้ำ ตัวเลือก 'อัตราการเร็วของการพิมพ์ซ้ำ' จะควบคุมความถี่ของการพิมพ์ซ้ำเหล่านี้

source: If supported, this option allows you to set the rate at which keycodes are generated while a key is pressed.
th: ถ้ามีการรองรับ ตัวเลือกนี้จะให้คุณตั้งค่าอัตราการพิมพ์ซ้ำเมื่อมีการกดแป้น

source: repeats/s
th: ครั้ง/วินาที

source: ms
th: มิลลิวินาที

source: &Delay:
th: &ระยะหน่วงเวลาก่อนพิมพ์ซ้ำ:
