Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-desktop/kcm_access.po
Languages: th

source: Press %1 while NumLock, CapsLock and ScrollLock are active
th: กด %1 ขณะที่ NumLock, CapsLock และ ScrollLock เปิดใช้งานอยู่

source: Press %1 while CapsLock and ScrollLock are active
th: กด %1 ขณะที่ CapsLock และ ScrollLock เปิดใช้งานอยู่

source: Press %1 while NumLock and ScrollLock are active
th: กด %1 ขณะที่ NumLock และ ScrollLock เปิดใช้งานอยู่

source: Press %1 while ScrollLock is active
th: กด %1 ขณะที่ ScrollLock เปิดใช้งานอยู่

source: Press %1 while NumLock and CapsLock are active
th: กด %1 ขณะที่ NumLock และ CapsLock เปิดใช้งานอยู่

source: Press %1 while CapsLock is active
th: กด %1 ขณะที่ CapsLock เปิดใช้งานอยู่

source: Press %1 while NumLock is active
th: กด %1 ขณะที่ NumLock เปิดใช้งานอยู่

source: Press %1
th: กด %1

source: Could not set gsettings for Orca: "%1" failed
th: การตั้งค่า Orca ใน gsettings: "%1" ล้มเหลว

source: Error: Could not launch "orca --setup"
th: ผิดพลาด: ไม่สามารถเปิด "orca --setup"

source: Use Gestures
th: ใช้ท่าทาง

source: Ask for Confirmation for a gesture
th: ถามยืนยันการใช้ท่าทาง

source: Confirm access to the Keyboard
th: ยืนยันการเข้าถึงแป้นพิมพ์

source: Use a timeout delay
th: ใช้การหมดเวลาล่าช้า:

source: Delay for timeout
th: ช่วงหมดเวลาล่าช้า

source: Use a beep for access
th: ส่งเสียงบี๊บเพื่อการเข้าถึง

source: Use System Bell
th: ใช้เบลระบบ

source: Customize system bell
th: ปรับแต่งเบลระบบ

source: Sound file for the Bell
th: ไฟล์เสียงสำหรับเบล

source: Use a visual bell instead of a sound
th: ใช้เบลที่เห็นได้แทนเสียง

source: Invert the system colors on the bell
th: กลับสีหน้าจอเมื่อเบลทำงาน

source: Color of the Visible Bell
th: สีของเบลที่เห็น

source: Duration of the Visible Bell
th: ระยะเวลาของเบลที่เห็น

source: Whether Colorblindness Correction is enabled
th: ไม่ว่าจะเปิดใช้งานการแก้ไขสีสำหรับคนพิการทางสายตา

source: Use sticky Keys
th: ใช้ปุ่มหนืด

source: Lock the sticky keys
th: ล็อคปุ่มหนืด

source: Turn sticky keys off when two keys are pressed simultaneously
th: การกดปุ่มพิมพ์ค้างจะถูกปิดเมื่อมีการกดปุ่มพิมพ์สองปุ่มพร้อม ๆ กัน

source: Beep on a sticky key press
th: ส่งเสียงบี๊บเมื่อกดปุ่มหนืด

source: Toggle keys beep
th: เปิด/ปิดปุ่มเสียงบี๊บ

source: Notify when a keyboard modifier is pressed
th: แจ้งเตือนเมื่อปุ่มดัดแปรได้ถูกกด

source: Use slow keypresses
th: ใช้ปุ่มพิมพ์ช้า

source: Delay for the key press
th: ระยะการกดปุ่มล่าช้า

source: Beep on a slow keypress
th: ส่งเสียงบี๊บเมื่อกดปุ่มช้า

source: Beep on an accepted keypress
th: ส่งเสียงบี๊บเมื่อใช้งานปุ่ม

source: Beep on a rejected keypress
th: ส่งเสียงบี๊บเมื่อปฏิเสธการกดปุ่ม

source: Bounce Keys
th: ป้องกันปุ่มซ้ำ

source: Use a delay for bouncing
th: ใช้การระยะเวลาการล่าช้าสำหรับการป้องกันปุ่มซ้ำ

source: Beep if a bounce key event is rejected
th: ส่งเสียงบี๊บเมื่อถูกปฏิเสธการป้องกันปุ๊มซ้ำ

source: Use keys to control the mouse
th: ใช้ปุ่มแป้นพิมพ์เพื่อที่จะควบคุมเมาส์

source: Delay for the mouse movement
th: ระยะเวลาล่าช้าของการขยับเมาส์

source: Repetition interval for the mouse movement
th: เวลาระยะห่างของการทำซ้ำของการขยับเมาส์

source: Time to hit maximum velocity
th: ระยะเวลาจนกว่าจะถึงความเร็วสูงสุด

source: Maximum Velocity
th: ความเร็วสูงสุด

source: Mouse Key Curve
th: เส้นโค้งปุ่มเมาส์

source: Enable Screen Reader
th: เปิดตัวอ่านหน้าจอ

source: Whether Shake Cursor is enabled
th: แม้ว่าจะเปิดการเขย่าเคอร์เซอร์

source: Magnification
th: การขยาย

# @option:check
source: Activation shortcuts:
th: คีย์ลัดการเปิดใช้งาน

# Enable activation shortcuts
source: Enable
th: เปิดใช้งาน

# @label
source: Press Shift 5 times to enable Sticky Keys
th: กด Shift 5 รอบเพื่อเปิดปุ่มหนืด

# @label
source: Hold Shift for 8 seconds to enable Slow Keys
th: กดปุ่ม Shift ค้างไว้ 8 วินาทีเพื่อเปิดคีย์ช้า

# @option:check
source: Disable sticky and slow keys after:
th: ปิดการใช้งานปุ่มหนืดและปุ่มช้าหลังจาก:

source: %1 min
th: %1 นาที

# short for minute(s)
source: min
th: นาที

source: When a shortcut is used:
th: เมื่อถูกใช้งานปุ่มคีย์ลัด:

source: Display a confirmation dialog
th: แสดงหน้าต่างยืนยัน

source: Ring the system bell
th: ส่งเสียงเบลระบบ

source: Show a notification
th: แสดงการแจ้งเตือน

source: Configure Notifications…
th: ปรับแต่งการแจ้งเตือน...

source: Please choose an audio file
th: กรุณาเลือกไฟล์เสียง

# Name filters in a file dialog. Do not translate `(*.ogg *.oga *.wav)`
source: ogg, oga, and wav audio files (*.ogg *.oga *.wav)
th: ogg, oga, และไฟล์เสียง wav (*.ogg *.oga *.wav)

source: Audio Files (*.mp3 *.ogg *.wav)
th: เสียงไฟล์ (*.mp3 *.ogg *.wav)

source: Audible bell:
th: เสียงเบล:

# Enable the system bell
source: Enable
th: เปิดใช้งาน

# Defines if the system will use a sound system bell
source: Custom sound:
th: เสียงที่กำหนดไว้เอง:

source: Search audio file for the system bell
th: ค้นหาไฟล์เสียงสำหรับเบลระบบ

source: Button search audio file
th: ปุ่มค้นหาไฟล์เสียง

source: Visual bell:
th: เบลแบบที่เห็นได้:

# Enable visual bell
source: Enable
th: เปิดใช้งาน

# @option:radio Invert screen colors when a system bell is rung
source: Invert screen colors
th: กลับสีจอ

# Invert screen on a system bell
source: Invert Screen
th: กลับสีจอ

# @option:radio Flash screen when a system bell is rung
source: Flash screen
th: กระพริบหน้าจอ

# Flash screen on a system bell
source: Flash
th: กระพริบ

# Color of the system bell
source: Color
th: สี

# Duration of the system bell
source: Duration:
th: ระยะเวลา:

# @label
source: Color blindness correction:
th: การแก้ไขสีหน้าจอสำหรับคนพิการทางสายตา

# @option check, Enable color blindness correction effect
source: Enable
th: เปิดใช้งาน

# @label
source: Mode:
th: โหมด:

# @option
source: Protanopia (red weak)
th: โพรทาโนเปีย (อ่อนสีแดง)

# @option
source: Deuteranopia (green weak)
th: ดิวเทอเรโนเปีย (อ่อนสีเขียว

# @option
source: Tritanopia (blue-yellow)
th: ทริตาโนเปีย (น้ำเงิน-เหลือง)

# @label
source: Intensity:
th: ความเข้มสี:

# @label Mild color blindness correction intensity
source: Mild
th: อ่อน

# @label Intense color blindness correction intensity
source: Intense
th: เข้มข้น

source: Red
th: สีแดง

source: Green
th: สีเขียว

source: Blue
th: สีน้ำเงิน

source: Purple
th: สีม่วง

source: Slow keys:
th: ปุ่มพิมพ์ช้า:

source: For a key to be accepted, it has to be held until the set amount of time
th: ต้องกดปุ่มนานตามที่ตั้งค่าไว้ถึงปุ่มจะใช้งานได้

# Enable slow keys
source: Enable
th: เปิดใช้งาน

# @info:tooltip
source: For a key to be accepted, it has to be held until the set amount of time. Useful if you accidentally type more than one key at a time or have difficulty pressing the key you want the first time.
th: ต้องกดปุ่มนานตามที่ตั้งค่าไว้ถึงปุ่มจะใช้งานได้ มีประโยชน์ถ้าหากคุณกดปุ่มมากกว่าหนึ่งครั้งโดยไม่ได้ตั้งใจบ่อยหรือมีอุปสรรคต่อการกดปุ่มที่คุณต้องการใช้งานในครั้งแรก

# Slow keys Delay
source: Delay:
th: หน่วงเวลาล่าช้า:

source: Ring system bell:
th: ส่งเสียงเบลระบบ:

# Use system bell when a key is pressed
source: when any key is &pressed
th: เมื่อปุ่มใดก็ตามที่มี&การกดปุ่ม

# Use system bell when a key is accepted
source: when any key is &accepted
th: เมื่อปุ่มใดก็ตามได้ใช้&งาน

# Use system bell when a key is rejected
source: when any key is &rejected
th: เมื่อปุ่มใดก็ตามได้&ถูกปฏิเสธ

source: Ignore rapid, repeated keypresses of the same key
th: ละเว้นการกดปุ่มเดียวกันรัว ๆ

source: Bounce keys:
th: ป้องกันปุ่มซ้ำ:

# Bounce keys enable
source: Enable
th: เปิดใช้งาน

# @info:tooltip
source: Ignore rapid, repeated keypresses of the same key. Useful if you have hand tremors that cause you to press a key multiple times when you only intend to press once.
th: ละเว้นการกดปุ่มเดียวกันรัว ๆ มีประโยชน์ถ้าหากคุณมือสั่นจนกระทั่งกดปุ่มรัว ๆ โดยไม่ได้ตั้งใจ

# Bounce keys delay
source: Delay:
th: หน่วงเวลาล่าช้า:

source: Ring system bell when rejected
th: ส่งสัญญานเบลเมื่อถูกปฏิเสธ

source: This module lets you configure the accessibility features such as a screen reader.
th: โมดูลนี้ช่วยให้คุณกำหนดค่าคุณลักษณะการช่วยสำหรับการเข้าถึงเช่น ตัวอ่านหน้าจอ

# System Bell
source: Bell
th: เบล

# @title Category name in sidebar
source: System Bell
th: เบลระบบ

# System Modifier Keys
source: Modifier Keys
th: แป้นดัดแปร

# System keyboard filters
source: Keyboard Filters
th: ตัวกรองแป้นพิมพ์

# System mouse navigation
source: Mouse Navigation
th: การนำทางเมาส์

source: Activation Shortcuts
th: คีย์ลัดการเปิดใช้งาน

# System mouse navigation
source: Screen Reader
th: เปิดตัวอ่านหน้าจอ

# Correction for color blindness
source: Color Blindness Correction
th: การแก้ไขสีหน้าจอสำหรับคนพิการทางสายตา

# Shake cursor to find it
source: Shake Cursor
th: เขย่าเคอร์เซอร์

# @option:check
source: Sticky keys:
th: ปุ่มหนืด:

# @option:check Enable sticky keys
source: Enable
th: เปิดใช้งาน

# @info:tooltip
source: Modifier keys like Ctrl, Shift, Alt, and the Meta/Super/Windows key act as though they “stick in place” and no longer need to be held down when typing a keyboard shortcut.
th: ปุ่มดัดแปรเช่น Ctrl, Shift, Alt และ ปุ่ม Meta/Super/Windows จะถูกเหมือนว่า "ติดไว้กับที่" และไม่จำเป็นที่จะต้องกดค้างไว้เมื่อใช้คีย์ลัด

# @option:check
source: Lock sticky keys
th: ล็อคปุ่มหนืด

# @info:tooltip
source: Pressing a modifier key twice will keep it in active state until pressed again.
th: กดปุ่มดัดแปรสองรอบจะเป็นการเปิดใช้งานจนกว่าจะกดอีกรอบ

source: Disable when two keys are held down
th: ปิดการทำงานเมื่อการกดปุ่ม 2 ปุ่มค้างไว้

source: Ring system bell when modifier keys are used
th: ส่งเสียงเบลระบบเมื่อปุ่มดัดแปรได้ถูกใช้งาน

# @option:check Feedback options:
source: Feedback:
th: การตอบสนอง:

# @option:check
source: Ring system bell when locking keys are used
th: ส่งเสียงเบลระบบเมื่อปุ่มล็อคได้ถูกใช้งาน

# @info:tooltip
source: The locking keys are Caps Lock, Num Lock, and Scroll Lock.
th: ปุ่มที่ถูกล็อคได้แก่ Caps Lock, Num Lock และ Scroll Lock

# @option:check
source: Show notification when modifier or locking keys are used
th: แสดงการแจ้งเตือนเมื่อปุ่มดัดแปรหรือปุ่มล็อคได้ถูกใช้งาน

# @action:button
source: Configure Notifications…
th: ปรับแต่งการแจ้งเตือน...

# @option:check
source: Use number pad to move cursor:
th: ใช้แป้นกดหมายเลขในการขยับเคอร์เซอร์

# @option:check Enable mouse navigation
source: Enable
th: เปิดใช้งาน

# @info:tooltip
source: The numpad key <shortcut>5</shortcut> functions as a mouse click. The keys <shortcut>2</shortcut>, <shortcut>4</shortcut>, <shortcut>6</shortcut>, and <shortcut>8</shortcut> allow for cardinal movement (down, left, right, and up). The keys <shortcut>1</shortcut>, <shortcut>3</shortcut>, <shortcut>7</shortcut>, and <shortcut>9</shortcut> allow for diagonal movement.
th: ปุ่มแป้นกดหมายเลข <shortcut>5</shortcut> ทำงานเสมือนกับการคลิกของเมาส์ ปุ่ม <shortcut>2</shortcut>, <shortcut>4</shortcut>, <shortcut>6</shortcut> และ <shortcut>8</shortcut> ใช้ในการขยับแบบลูกศร (ลง ซ้าย ขวา บน) ส่วนปุ่ม <shortcut>1</shortcut>, <shortcut>3</shortcut>, <shortcut>7</shortcut> และ <shortcut>9</shortcut> ใช้ในการขยับแบบแนวทแยง

# @label:spinbox
source: Acceleration delay:
th: การเร่งความเร็วล่าช้า:

# @label:spinbox
source: Repeat interval:
th: ช่วงเวลาทำซ้ำ:

# @label:spinbox
source: Acceleration time:
th: เวลาของการเร่งความเร็ว:

# @label:spinbox
source: Maximum speed:
th: ความเร็วสูงสุด:

# @label:spinbox
source: Pointer acceleration:
th: การเร่งความเร็วตัวชี้:

# @info Placeholder message title
source: The Orca Screen Reader is not installed
th: ไม่ได้ติดตั้งตัวอ่านหน้าจอ Orca

# @info Placeholder message explanation
source: Please install it, then close and reopen this window
th: กรุณาไปติดตั้งให้เรียบร้อย และปิดและเปิดหน้าต่างนี้ใหม่

# @option:check
source: Enable Screen Reader
th: เปิดใช้งานตัวอ่านหน้าจอ

# @action:button
source: Launch Orca Screen Reader Configuration…
th: เปิดใช้งานการกำหนดค่าตัวอ่านหน้าจอ Orca

# @label
source: Shake cursor to find it:
th: เขย่าเคอร์เซอร์เพื่อหาให้พบ:

# @option check, Enable shake cursor effect
source: Enable
th: เปิดใช้งาน

# @label Cursor magnification level
source: Magnification:
th: การขยาย:

# @label Normal cursor size
source: Normal
th: ปกติ

# @label Large cursor size
source: Large
th: ใหญ่

source: Sticky keys:
th: ปุ่มหนืด:

# Enable sticky keys
source: Enable
th: เปิดใช้งาน

# Lock sticky keys
source: Lock
th: ล็อค

source: Feedback:
th: การตอบสนอง:

source: Ring system bell when locking keys are toggled
th: ส่งเสียงเบลระบบเมื่อปุ่มล็อคได้ถูกเปิด/ปิด

source: Show notification when modifier or locking keys are used
th: แสดงการแจ้งเตือนเมื่อปุ่มดัดแปรหรือปุ่มล็อคได้ถูกใช้งาน

source: Use number pad to move cursor:
th: ใช้แป้นกดหมายเลขในการขยับเคอร์เซอร์

source: Enable
th: เปิดใช้งาน

source: When a gesture is used:
th: เมื่อใช้ท่าทาง:

source: Ring the System Bell
th: ส่งเสียงเบลระบบ

source: Acceleration delay:
th: การเร่งความเร็วล่าช้า:

source: Repeat interval:
th: ช่วงเวลาทำซ้ำ:

source: Acceleration time:
th: เวลาของการเร่งความเร็ว:

source: Maximum speed:
th: ความเร็วสูงสุด:

source: Acceleration profile:
th: โปรไฟล์การเร่งความเร็ว:

source: Launch Orca Screen Reader Configuration…
th: เปิดใช้งานการกำหนดค่าตัวอ่านหน้าจอ Orca...

source: Please note that you may have to log out or reboot once to allow the screen reader to work properly.
th: กรุณาของแจ้งให้ทราบว่า คุณอาจจะต้องออกจากระบบหรือเริ่มระบบใหม่เพื่อให้ตัวอ่านหน้าจอทำงานได้อย่างปกติ

source: It appears that the Orca Screen Reader is not installed. Please install it before trying to use this feature, and then log out or reboot
th: พบว่าไม่ได้ติดตั้งตัวอ่านหน้าจอ Orca กรุณาติดตั้งก่อนที่จะใช้ฟีเจอร์นี้ และออกจากระบบหรือเริ่มระบบใหม่
