Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-desktop/kcm_baloofile.po
Languages: th

source: This module lets you configure the file indexer and search functionality.
th: โมดูลนี้ช่วยให้คุณกำหนดค่าของการเก็บดัชนีไฟล์และฟังค์ชันค้นหา

source: Pause Indexer
th: หยุดการทำงานการเก็บดัชนีไฟล์

source: Resume Indexer
th: เปิดใช้งานการสร้างดัชนีต่อ

source: This will disable file searching in KRunner and launcher menus, and remove extended metadata display from all KDE applications.
th: ตัวเลือกนี้จะปิดการค้นหาไฟล์ใน KRunner และเมนูตัวเปิดต่างๆ และลบเมตาดาต้าเพิ่มเติมออกจากแอปพลิเคชัน KDE ทั้งหมด

source: Do you want to delete the saved index data? %1 of space will be freed, but if indexing is re-enabled later, the entire index will have to be re-created from scratch. This may take some time, depending on how many files you have.
th: คุณอยากจะลบข้อมูลดัชนีไฟล์หรือไม่? พื้นที่ทั้งหมด %1 จะถูกลบ แต่ถ้าหากได้เปิดการสร้างดัชนีใหม่อีกครั้งที่หลัง ดัชนีจะถูกสร้างใหม่หมด อาจใช้เวลานานหรือไม่นานขึ้นอยู่กับว่าคุณมีไฟล์เยอะแค่ไหน

source: Delete Index Data
th: ลบข้อมูลดัชนี

source: The system must be restarted before these changes will take effect.
th: คุณต้องเริ่มระบบใหม่ถึงการเปลี่ยนแปลงพวกนี้จะมีผล

source: Delete entry
th: ลบค่า

source: File Search helps you quickly locate your files. You can choose which folders and what types of file data are indexed.
th: การค้นหาไฟล์ช่วยให้คุณหาไฟล์ของคุณได้อย่างรวดเร็ว คุณสามารถเลือกได้ว่าโฟลเดอร์ไหนและไฟล์ชนิดไหนจะถูกเก็บในดัชนี

source: File Search helps you quickly locate all your files based on their content.
th: การค้นหาไฟล์ช่วยให้คุณหาไฟล์ของคุณโดยอิงตามเนื้อหาของไฟล์นั้น

# @title:group
source: File indexing:
th: การเก็บดัชนี้ไฟล์:

# @action:check
source: Enabled
th: เปิดใช้งาน

source: Enable File Search
th: เปิดใช้งานการค้นหาไฟล์

# @title:group
source: Data to index:
th: ข้อมูลที่จะถูกเก็บ:

source: Also index file content
th: เก็บเนื้อหาไฟล์ใว้ในดัชนีด้วย

source: File names and contents
th: ชื่อไฟล์และเนื้อหา

source: File names only
th: ชื่อไฟล์เท่านั้น

source: Hidden files and folders
th: ไฟล์ที่ซ่อนอยู่และโฟลเดอร์

source: Index hidden files and folders
th: เก็บดัชนีของไฟล์ที่ซ่อนอยู่และโฟลเดอร์

source: Status: %1, %2% complete
th: สถานะ: %1 เสร็จไปแล้ว %2%

source: Currently indexing: %1
th: กำลังเก็บดัชนีของ: %1

# @title:table Locations to include or exclude from indexing
source: Locations
th: ตำแหน่งที่อยู่

source: Folder specific configuration:
th: การกำหนดค่าโฟลเดอร์โดยเฉพาะ:

# @action:button
source: Start Indexing a Folder…
th: เริ่มการเก็บดัชนีโฟลเดอร์...

source: Start indexing a folder…
th: เริ่มการเก็บดัชนีโฟลเดอร์...

# @action:button
source: Stop Indexing a Folder…
th: หยุดการเก็บดัชนีโฟลเดอร์...

# @action:button
source: Restart
th: เริ่มใหม่

source: Stop indexing a folder…
th: หยุดการเก็บดัชนีโฟลเดอร์...

# State and a percentage of progress
source: %1, %2% complete
th: %1 เสร็จไปแล้ว %2%

# @info Currently Indexing
source: Currently indexing: <filename>%1</filename>
th: กำลังเก็บดัชนีของ: <filename>%1 </filename>

source: Not indexed
th: ไม่ได้เก็บไว้ในดัชนี

source: Indexed
th: เก็บไว้ในดัชนีแล้ว

# Remove the list item for this filesystem path
source: Remove entry
th: ลบรายการ

source: Select a folder to include
th: เลือกโฟลเดอร์ที่จะเก็บ

source: Select a folder to exclude
th: เลือกโฟลเดอร์ที่จะไม่เก็บ
