Repository: Xerusion/kde-l10n-th
Catalog: messages/systemsettings/systemsettings.po
Languages: th

# NAME OF TRANSLATORS
source: Your names
th: สหชาติ อนุกูลกิจ, ถนอมทรัพย์ นพบูรณ์, Pongsakorn S., Diskette Guy

# EMAIL OF TRANSLATORS
source: Your emails
th: drrider@gmail.com, donga.nb@gmail.com, kde@xerusion.me, diskette@dailitation.xyz

source: %1 is an external application and has been automatically launched
th: แอปพลิเคชัน %1 เป็นแอปพลิเคชันภายนอก และได้ถูกเรียกใช้งานโดยอัตโนมัติ

source: Relaunch %1
th: เปิด %1 ใหม่

source: Dialog
th: กล่องโต้ตอบ

source: Info Center
th: ศูนย์ข้อมูลระบบ

source: Centralized and convenient overview of system information.
th: ศูนย์รวมข้อมูลระบบที่สะดวก

source: System Settings
th: การตั้งค่าระบบ

source: Central configuration center by KDE.
th: ศูนย์รวมการกำหนดค่าโดย KDE

source: Maintainer
th: ผู้ดูแล

source: Author
th: ผู้เขียน

source: Developer
th: ผู้พัฒนา

source: Internal module representation, internal module model
th: ตัวแทนของโมดูลภายใน โมเดลของโมดูลภายใน

source: List all possible modules
th: รายการโมดูลที่เป็นไปได้ทั้งหมด

source: Configuration module to open
th: ปรับแต่งโมดูลที่จะเปิด

source: Arguments for the module
th: อาร์กิวเมนต์สำหรับโมดูล

source: The following modules are available:
th: มีโมดูลที่ใช้งานได้ต่อไปนี้:

source: No description available
th: ไม่มีคําอธิบาย

source: Reset all current changes to previous values
th: กลับคืนค่าต่าง ๆ ที่เปลี่ยนแปลงสู่ค่าก่อนหน้า

source: The current page has unsaved changes. Apply the changes or discard them?
th: หน้าปัจจุบันมีการเปลี่ยนแปลงที่ยังไม่ได้บันทึก ปรับใช้การเปลี่ยนแปลงหรือย้อนการเปลี่ยนแปลงที่ตั้งไว้?

source: Apply Settings
th: ปรับใช้ค่าที่ตั้งไว้

# A search yielded no results
source: No items matching your search
th: ไม่มีรายการที่ตรงกับการค้นหาของคุณ

source: Show menu
th: แสดงเมนู

# Search through a list of control modules
source: Search
th: ค้นหา

source: Highlight Changed Settings
th: เน้นการตั้งค่าที่เปลี่ยนไป

source: Report a Bug in the Current Page…
th: รายงานข้อบกพร่องในหน้าปัจจุบัน...

source: Switch to Icon View
th: เปลี่ยนเป็นมุมมองไอคอน

source: Switch to Sidebar View
th: เปลี่ยนเป็นมุมมองแถบข้าง

source: Help
th: ช่วยเหลือ

source: System Settings was unable to find any views, and hence has nothing to display.
th: การตั้งค่าระบบไม่พบมุมมองใด ๆ ดังนั้นจึงไม่สามารถแสดงอะไรให้เห็นได้

source: No views found
th: ไม่พบมุมมองใด ๆ

source: About Active View
th: เกี่ยวกับมุมมองที่ใช้งานอยู่

source: About %1
th: เกี่ยวกับ %1

source: Sidebar
th: แถบข้าง

source: Most Used
th: ใช้มากที่สุด

source: Finds system settings modules whose names or descriptions match :q:
th: ค้นหาโมดูลการตั้งค่าระบบที่มีชื่อหรือคําอธิบายตรงกับ :q:

source: System Information
th: ข้อมูลระบบ

source: Internal name for the view used
th: ชื่อภายในสำหรับใช้กับมุมมอง

source: About System Settings
th: เกี่ยวกับการตั้งค่าระบบ

source: Contains 1 item
th: มีอยู่ %1 รายการ

source: The settings of the current module have changed. Do you want to apply the changes or discard them?
th: มีการเปลี่ยนแปลงที่ยังไม่ได้บันทึกในโมดูลที่ใช้งานอยู่ คุณต้องการที่จะนำการเปลี่ยนแปลงไปใช้งาน หรือทิ้งการเปลี่ยนแปลง?

source: Icon View
th: มุมมองไอคอน

source: Provides a categorized icons view of control modules.
th: แสดงโมดูลควบคุมในรูปแบบไอคอนที่จัดเป็นหมวดหมู่

source: All Settings
th: การตั้งค่าทั้งหมด

source: Keyboard Shortcut: %1
th: ปุ่มพิมพ์ลัด: %1

source: Show intro page
th: แสดงหน้าเริ่มต้น

source: Sidebar View
th: มุมมองแถบด้านข้าง

source: Provides a categorized sidebar for control modules.
th: แสดงโมดูลควบคุมในรูปแบบแถบข้าง
