Repository: Xerusion/kde-l10n-th
Catalog: messages/systemsettings/systemsettings._desktop_.po
Languages: th

# GenericName
source: KDE System Settings
th: การตั้งค่าระบบ KDE

# Name
source: KDE System Settings
th: การตั้งค่าระบบ KDE

# Comment
source: Configuration tools for your computer
th: เครื่องมือปรับแต่งคอมพิวเตอร์ของคุณ

# Keywords
source: systemsettings
th: การตั้งค่าระบบ

# GenericName
source: System Settings
th: การตั้งค่าระบบ

# Name
source: System Settings
th: การตั้งค่าระบบ

# Name
source: Global Theme
th: ธีมทั่วระบบ

# Name
source: Users
th: ผู้ใช้งาน

# Name
source: Screen Locking
th: การล็อคหน้าจอ

# Name
source: Power Management
th: การจัดการพลังงาน

# Name
source: Display Configuration
th: การกําหนดค่าหน้าจอ

# Name
source: Energy Saving
th: การประหยัดพลังงาน

# Name
source: Hidden
th: ซ่อนอยู่

# Name
source: Text & Fonts
th: ข้อความและฟอนต์

# Name
source: Fonts
th: ฟอนต์

# Name
source: Colors & Themes
th: สีและธีม

# Name
source: Appearance & Style
th: รูปลักษณ์และสไตล์

# Name
source: Appearance
th: รูปลักษณ์

# Name
source: Default Applications
th: แอปพลิเคชันค่าเริ่มต้น

# Name
source: Application Permissions
th: สิทธิ์ของแอปพลิเคชัน

# Name
source: Apps & Windows
th: แอปและหน้าต่าง

# Name
source: Display & Monitor
th: ระบบแสดงผลและจอภาพ

# Name
source: Display and Monitor
th: ระบบแสดงผลและจอภาพ

# Comment
source: Display Settings
th: การตั้งค่าการแสดงผล

# Name
source: Mouse & Touchpad
th: เมาส์และทัชแพด

# Name
source: Touchscreen
th: หน้าจอสัมผัส

# Name
source: Input & Output
th: อินพุตและเอาต์พุต

# Name
source: Input Devices
th: อุปกรณ์ป้อนข้อมูล

# Name
source: Keyboard
th: แป้นพิมพ์

# Name
source: Multimedia
th: มัลติมีเดีย

# Name
source: Disks & Cameras
th: ดิสก์และกล้อง

# Name
source: Removable Storage
th: พื้นที่ถอดเสียบได้

# Name
source: Connected Devices
th: อุปกรณ์ที่เชื่อมต่อ

# Name
source: Hardware
th: ฮาร์ดแวร์

# Name
source: Wi-Fi & Internet
th: Wi-Fi และอินเตอร์เน็ต

# Name
source: Settings
th: การตั้งค่า

# Name
source: Networking
th: ระบบเครือข่าย

# Name
source: Network
th: เครือข่าย

# Name
source: Personalization
th: การปรับแต่งส่วนบุคคล

# Name
source: Language & Time
th: ภาษาและเวลา

# Name
source: Root
th: รูท

# Name
source: Security & Privacy
th: ความปลอดภัยและความเป็นส่วนตัว

# Name
source: System
th: ระบบ

# Name
source: System Administration
th: การดูแลบริหารระบบ

# Name
source: Search
th: ค้นหา

# Name
source: Session
th: เซสชัน

# Name
source: Startup and Shutdown
th: การเริ่มการทำงานและการปิดเครื่อง

# Name
source: Window Management
th: การจัดการหน้าต่าง

# Name
source: Workspace
th: พื้นที่ทำงาน

# Name
source: Colors
th: สี

# Name
source: Connectivity
th: การเชื่อมต่อ

# Name
source: Applications
th: แอปพลิเคชัน

# Name
source: Regional Settings
th: การตั้งค่าภูมิประเทศ

# Name
source: Workspace Behavior
th: พฤติกรรมของพื้นที่ทำงาน

# Name
source: Shortcuts
th: ปุ่มคีย์ลัด

# Name
source: Info Center External Application
th: โปรแกรมภายนอกของศูนย์ข้อมูลระบบ

# Name
source: System Settings External Application
th: แอปพลิเคชันภายนอกของการตั้งค่าระบบ

# X-KDE-Keywords
source: System Settings
th: การตั้งค่าระบบ

# Name
source: Icon View
th: มุมมองไอคอน

# Comment
source: The KDE 4 icon view style
th: รูปแบบมุมมองแบบไอคอน KDE 4

# Name
source: Sidebar View
th: มุมมองแถบด้านข้าง

# Comment
source: Categorized sidebar style
th: สไตล์แถบด้านข้างแบบจัดหมวดหมู่
