Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-*/kcm_pulseaudio.po
Languages: pa

# @info:status error message
source: Changes have not been applied.<nl/>Failed to restart wireplumber.service. The command crashed.
pa: บันทึกความเปลี่ยนแปลงล้มเหลว<nl/>การเริ่มต้นใหม่ของ wireplumber.service ล้มเหลว คำสั่งหยุดทำงาน

# @info:status error message %1 is an integer exit code
source: Changes have not been applied.<nl/>Failed to restart wireplumber.service. The command terminated with code: %1.
pa: บันทึกความเปลี่ยนแปลงล้มเหลว<nl/>การเริ่มต้นใหม่ของ wireplumber.service ล้มเหลว คำสั่งหยุดทำงานโดยที่ส่งโคด: %1

# @info error %1 is a list of device identifiers
source: Failed to handle devices: %1.
pa: การรับมือกับอุปกรณ์: %1 ล้มเหลว

# @info error %1 is a path
source: Failed to create directory: %1.
pa: สร้างไดเรกทอรี: %1 ล้มเหลว

# @info error %1 is a path
source: Failed to open file for writing: %1.
pa: การเปิดไฟล์สำหรับการเขียน: %1 ล้มเหลว

# @label
source: Profile:
pa: โปรไฟล์:

# @label
source: Connection to the Sound Service Lost
pa: การเชื่อมต่อไปยังบริการเสียงได้หายไป

# @info reconnecting to pulseaudio
source: Trying to reconnect…
pa: กำลังพยายามเชื่อมต่อใหม่...

# @action retry connecting to pulseaudio
source: Retry
pa: ลองใหม่

source: Device name not found
pa: ไม่พบชื่ออุปกรณ์

source: Port:
pa: พอร์ต:

# Port is unavailable
source: %1 (unavailable)
pa: %1 (ไม่พร้อมใช้งาน)

# Port is unplugged
source: %1 (unplugged)
pa: %1 (ไม่ได้เสียบ)

# Perform an audio test of the device
source: Test
pa: ทดสอบ

# Show audio channels (e.g. to control left/right audio balance
source: Show Channels
pa: แสดงช่องเสียง

# Audio balance (e.g. control left/right volume individually
source: Balance
pa: ปรับสมดุล

source: This module allows configuring the Pulseaudio sound subsystem.
pa: โมดูลนี้ช่วยในการตั้งค่าระบบเสียง PulseAudio

source: Show Inactive Devices
pa: แสดงอุปกรณ์ที่ไม่ได้ทำงาน

source: Rename Devices…
pa: เปลี่ยนชื่ออุปกรณ์...

source: Configure Volume Controls…
pa: ตั้งค่าการควบคุมเสียง...

source: Configure…
pa: ตั้งค่า...

source: Requires %1 PulseAudio module
pa: ต้องใช้โมดูล PulseAudio %1

source: Add virtual output device for simultaneous output on all local sound cards
pa: เพิ่มอุปกรณ์เสมือนอาท์พุตเพื่อการเอาต์พุตเสียงทั้งหมดบนการ์ดเสียงในเครื่อง

source: Automatically switch all running streams when a new output becomes available
pa: เปลี่ยนกระแสข้อมูลเสียงเมื่อมีอุปกรณ์เอาต์พุตใหม่ที่พร้อมใช้งานโดยอัตโนมัติ

source: Playback Devices
pa: อุปกรณ์เล่นเสียง

source: Recording Devices
pa: อุปกรณ์อัดเสียง

source: Inactive Cards
pa: การ์ดไม่ได้ทำงาน

source: Playback Streams
pa: กระแสข้อมูลเล่นเสียง

source: Recording Streams
pa: กระแสข้อมูลอัดเสียง

source: Error trying to play a test sound. The system said: "%1"
pa: เกิดข้อผิดพลาดในทดสอบเสียง ระบบได้แจ้งว่า: "%1"

source: Front Left
pa: ด้านซ้ายหน้า

source: Front Center
pa: ตรงกลางหน้า

source: Front Right
pa: ด้านขวาหน้า

source: Side Left
pa: ด้านข้างซ้าย

source: Side Right
pa: ด้านข้างขวา

source: Rear Left
pa: ด้านหลังซ้าย

source: Subwoofer
pa: ซับวูฟเฟอร์

source: Rear Right
pa: ด้านหลังขวา

source: Mono
pa: โมโน

source: Click on any speaker to test sound
pa: กดที่ลำโพงใดก็ได้เพื่อทดสอบเสียง

# Unmute audio stream
source: Unmute %1
pa: เปิดเสียง %1

# Mute audio stream
source: Mute %1
pa: ปิดเสียง %1

# @title rename audio devices
source: Rename Devices
pa: เปลี่ยนชื่ออุปกรณ์

# @action save changes
source: Save
pa: บันทึก

# @info
source: Saving changes will restart audio services. Apps playing audio will experience interruptions and may need to be restarted.
pa: การบันทึกการตั้งค่าจะเป็นการเริ่มต้นบริการเสียงใหม่ แอปพลิเคชันต่าง ๆ ที่เล่นเสียงอยู่จะถูกตัดและอาจต้องได้เริ่มใหม่เช่นกัน

# @action
source: Report Bug
pa: รายงานจุดบกพร่อง

# @info:status reloading the backing data
source: Reloading
pa: โหลดใหม่

# place holder text, %1 is a device name
source: %1 (click 'Save' to apply)
pa: %1 (กด 'บันทึก' เพื่อนำไปใช้)

# @action apply currently editing test
source: Apply
pa: นำไปใช้

# @action reset device name to default
source: Reset
pa: ตั้งค่าใหม่

# @label placeholder text when we don't know the default value of a device yet
source: DEFAULT
pa: ค่าเริ่มต้น

source: Notification Sounds
pa: เสียงแจ้งเตือน

source: Volume Controls
pa: ควบคุมเสียง

source: Raise maximum volume
pa: ขยายระดับเสียงที่สูงที่สุด

source: Volume change step:
pa: ขั้นระดับเสียง:

source: Play audio feedback for changes to:
pa: เล่นเสียงตอบรับสำหรับการเปลี่ยนแปลงของ:

source: Show visual feedback for changes to:
pa: แสดงภาพตอบรับสำหรับการเปลี่ยนแปลงของ:

source: Audio volume
pa: ระดับเสียง

source: Show OSD popups for changes to:
pa: แสดงป๊อปอัพสำหรับการเปลี่ยนแปลงของ:

source: Microphone sensitivity
pa: ระดับการตรวจจับไมโครโฟน

source: Mute state
pa: สถานะปิดเสียง

source: Default output device
pa: อุปกรณ์เอาต์พุตค่าเริ่มต้น

source: Increase Volume
pa: เพิ่มระดับเสียง

source: Decrease Volume
pa: ลดระดับเสียง

source: Increase Volume by 1%
pa: เพิ่มระดับเสียงเป็น 1%

source: Decrease Volume by 1%
pa: ลดระดับเสียงเป็น 1%

source: Increase Microphone Volume
pa: เพิ่มระดับเสียงไมโครโฟน

source: Decrease Microphone Volume
pa: ลดระดับเสียงไมโครโฟน

source: Mute
pa: ปิดเสียง

source: Mute Microphone
pa: ปิดเสียงไมโครโฟน

source: Audio Volume
pa: ระดับเสียง

source: No such device
pa: ไม่มีอุปกรณ์ดังกล่าว

source: No output device
pa: ไม่มีอุปกรณ์เอาต์พุต

# Device name (Battery percent)
source: %1 (%2% Battery)
pa: %1 (%2% แบตเตอรี)

source: Play all audio via this device
pa: เล่นเสียงทั้งหมดโดยอุปกรณ์นี้

source: Record all audio via this device
pa: อัดเสียงทั้งหมดโดยอุปกรณ์นี้

source: Ports
pa: พอร์ต

source: Profiles
pa: โปรไฟล์

source: Play audio using
pa: เล่นเสียงโดยใช้

source: Record audio using
pa: อัดเสียงโดยใช้

source: Microphone
pa: ไมโครโฟน

source: Microphone Muted
pa: ไมโครโฟนปิดเสียง

# List of apps is using mic
source: %1 are using the microphone
pa: %1 กำลังใช้ไมโครโฟนอยู่

# App %1 is using mic with name %2
source: %1 is using the microphone (%2)
pa: %1 กำลังใช้ไมโครโฟนอยู่ (%2)

# App is using mic
source: %1 is using the microphone
pa: %1 กำลังใช้ไมโครโฟนอยู่
