Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-welcome/plasma-welcome.po
Languages: th

# @info:usagetip
source: This will let you access their content in KDE apps. You can set it up in System Settings, and here too.
th: ตัวเลือกนี้จะเปิดให้คุณเข้าถึงเนื้อหานั้นในแอป KDE ต่าง ๆ คุณสามารถเริ่มตั้งค่าได้ตรงนี้ หรือที่การตั้งค่าระบบ

# @title:window
source: Manage Software
th: จัดการซอฟต์แวร์

# @info:usagetip
source: The <application>Discover</application> app helps you find and install applications, games, and tools. You can search or browse by category, look at screenshots, and read reviews to help you find the perfect app.
th: แอปพลิเคชัน <application>Discover</application> ช่วยให้คุณหาและติดตั้งแอปพลิเคชัน เกม และเครื่องมือต่าง ๆ คุณสามารถค้นหาหรือดูตามหมวดหมู่ ดูภาพหน้าจอ และอ่านรีวิวได้เพื่อในการหาแอปพลิเคชันที่ดีที่สุด

# @action:button
source: Launch Discover now
th: เปิด Discover ตอนนี้

# @title:window
source: Support Your Freedom
th: สนับสนุนความอิสรภาพของคุณ

# @info:usagetip
source: Miraculously, KDE operates on a shoestring budget, relying largely on donations of labor and resources. You can help change that!<nl/><nl/>Financial donations help KDE pay for development sprints, hardware and server resources, and expanded employment. Donations are tax-deductible in Germany.
th: KDE นั้นทำงานโดยใช้งบประมาณจำกัดอย่างอัศจรรย์ โดยใช้เงินบริจาคไปใช้กับแรงงานและทรัพยากร คุณสามารถช่วยเหลือพวกเราได้<nl/><nl/>การบริจาคนั้นจะช่วยเหลือพวกเราในการจ่ายค่าฮาร์ตแวร์และเซิร์ฟเวอร์ ทรัพยากรอื่น ๆ และการจ้างงานที่เพิ่มขึ้นซึ่งจะทำให้การพัฒนาเร็วขึ้น การบริจาคสามารถนำไปลดหย่อนภาษีได้ในเยอรมนี

# @title:window
source: Plasma has been updated to version %1
th: Plasma ได้อัพเดทเป็นเวอร์ชัน %1

# @action:button
source: Find out what's new in Plasma %1
th: มาดูกันว่ามีอะไรใหม่ใน Plasma %1

# @action:button
source: Help work on the next release
th: ช่วยทำ Plasma เวอร์ชั่นถัดไป

# @info:usagetip
source: Plasma is an extremely feature-rich environment, designed to super-charge your productivity! Here is just a smattering of the things it can do for you:
th: Plasma เป็นสภาพแวดล้อมที่เต็มไปด้วยฟีเจอร์ที่เยอะมาก ๆ ออกแบบมาให้ทุกมีประสิทธิผลอย่างที่สุด นี้่คือรายการตัวอย่างเล็ก ๆ น้อย ๆ ว่า Plasma สามารถทำอะไรได้:

# @title:row
source: Get Hot New Stuff
th: รับสิ่งของใหม่ที่ได้รับความนิยม

# @info Caption for Get Hot New Stuff button
source: Extend the system with add-ons
th: ขยายระบบเพิ่มเติมโดยใช้ส่วนเสริม

# @info:usagetip
source: Plasma Vaults allows you to create encrypted folders, called <interface>Vaults.</interface> Inside each Vault, you can securely store your passwords, files, pictures, and documents, safe from prying eyes. Vaults can live inside folders that are synced to cloud storage services too, providing extra privacy for that content.<nl/><nl/>To get started, click the arrow on the <interface>System Tray</interface> to show hidden items, and then click the <interface>Vaults</interface> icon.
th: Plasma Vaults สามารถสร้างโฟลเดอร์ที่เข้ารหัสได้ที่เรียกว่า <interface>Vaults</interface> ข้างใน Vault แต่ละอัน คุณสามารถเก็บรหัสผ่าน ไฟล์ รูป และเอกสารได้อย่างปลอดภัย Vaults สามารถอยู่ข้างในโฟลเดอร์ที่ซิงค์ไปยังบริการพื้นที่จัดกับคลาวด์ได้ด้วย ทำให้มีความปลอดภัยยิ่งขึ้น<nl/><nl/>ถ้าหากจะเริ่มใช้งาน กดลูกศรที่<interface>ถาดระบบ</interface>เพื่อที่จะแสดงรายการที่ซ่อนอยู่ จากนั้นกดที่ไอคอน <interface>Vaults</interface>

# @action:button
source: See More Features
th: ดูฟีเจอร์เพิ่มเติม

# @info:usagetip
source: Activities can be used to separate high-level projects or workflows so you can focus on one at a time. You can have an activity for "Home", "School", "Work", and so on. Each Activity has access to all your files but has its own set of open apps and windows, recent documents, "Favorite" apps, and desktop widgets.<nl/><nl/>To get started, launch <interface>System Settings</interface> and search for "Activities". On that page, you can create more Activities. You can then switch between them using the <shortcut>Meta+Tab</shortcut> keyboard shortcut.
th: สามารถเรียกใช้ "กิจกรรม" เพื่อการแยกโปรเจคหรือเวิร์กโฟลว์ระดับสูง เพื่อนำไปใช้ในการมุ่งเน้นการทำงานหนึ่งงานในเวลาหนึ่งเดียว คุณสามารถสร้างกิรกรรมสำหรับ "บ้าน" "โรงเรียน" "ที่ทำงาน" และ ฯลฯ กิจกรรมแต่ละอันสามารถเข้าถึงไฟล์ทุกอย่างของคุณได้ แต่มีแอปพลิเคชันและหน้าต่างที่เปิดอยู่ เอกสารที่ใช้ล่าสุด แอปพลิเคชันที่ชอบ และวิดเจ็ต เป็นของมันเอง<nl/><nl/>ถ้าหากจะเริ่มใช้งาน เปิด<interface>การตั้งค่าระบบ</interface> และค้นหา "กิจกรรม" คุณสามารถสร้างกิจกรรมเพิ่มเติมได้ และจากนั้นก็สลับเปลี่ยนระหว่างกิจกรรมโดยใช้ปุ่มคีย์ลัด <shortcut>Meta+Tab</shortcut>

# @action:button
source: Open Activities Page in System Settings
th: เปิดหน้ากิจกรรมในการตั้งค่าระบบ

# @info:usagetip
source: KDE Connect lets you integrate your phone with your computer in various ways:<nl/><list><item>See notifications from your phone on your computer</item><item>Reply to text messages from your phone on your computer</item><item>Sync your clipboard contents between your computer and your phone</item><item>Make a noise on your phone when it's been misplaced</item><item>Copy pictures, videos, and other files from your phone to your computer, and vice versa</item><item>…And much more!</item></list><nl/>To get started, launch <interface>System Settings</interface> and search for "KDE Connect". On that page, you can pair your phone.
th: KDE Connect สามารถทำให้โทรศัพท์ของคุณเชื่อมต่อกับคอมพิวเตอร์ของคุณได้หลายวิธี:<nl/><list><item>ดูการแจ้งเตือนจากโทรศัพท์บนคอมพิวเตอร์ของคุณ</item><item>ตอบข้อความต่าง ๆ บนคอมพิวเตอร์ของคุณ</item><item>ซิงค์เนื้อหาคลิปบอร์ดระหว่างคอมพิวเตอร์และโทรศัพท์ของคุณ</item><item>ทำให้โทรศัพท์เสียงดังเมื่อคุณทำโทรศัพท์หาย</item><item>คัดลอกรูปภาพ วิดีทัศน์ และไฟล์อื่น ๆ จากโทรศัพท์ไปยังคอมพิวเตอร์และในทางกลับกัน</item><item>...และมากกว่านี้!</item></list><nl/>ถ้าหากจะเริ่มใช้งาน เปิด<interface>การตั้งค่าระบบ</interface> และค้นหา "KDE Connect" คุณสามารถเชื่อมต่อไปยังโทรศัพท์คุณบนหน้านั้นได้

# @action:button
source: Open KDE Connect Page in System Settings
th: เปิดหน้า KDE Connect ใน System Settings

source: KRunner is Plasma's exceptionally powerful and versatile search system. It powers the search functionality in the Application Launcher menu and the Overview screen, and it can be accessed as a standalone search bar using the <shortcut>Alt+F2</shortcut> keyboard shortcut.<nl/><nl/>In addition to finding your files and folders, KRunner can launch apps, search the web, convert between currencies, calculate math problems, and a lot more. Try typing any of the following into one of those search fields:<nl/><list><item>"time Shanghai"</item><item>"27/3"</item><item>"200 EUR in USD"</item><item>"25 miles in km"</item><item>…And much more!</item></list><nl/>To learn more, open the KRunner search bar using the <shortcut>Alt+F2</shortcut> keyboard shortcut and click on the question mark icon.
th: KRunner เป็นระบบค้นหาอเนกประสงค์ของ Plasma ที่มีสมรรถภาพสูง ซึ่งถูกใช้ในเมนู Application Launcher และโหมดภาพโดยรวม และสามารถเข้าถึงกล่องค้นหาได้ผ่านคีย์ลัด <shortcut>Alt+F2</shortcut><nl/><nl/>ทั้งที่สามารถหาไฟล์และโฟลเดอร์ KRunner สามารถเปิดแอปพลิเคชัน ค้นหาบนอินเทอร์เน็ต แปลงค่าเงิน คำนวนเลขคณิตฯ และอีกมากมาย ลองพิมพ์สิ่งพวกนี้ในกล่องค้นหาดูสิ:<nl/><list><item>"time Shanghai"</item><item>"27/3"</item><item>"200 EUR in USD"</item><item>"25 miles in km"</item><item>…และอีกมากมาย!</item></list><nl/>ถ้าอยากเรียนรู้มากกว่านี้เกี่ยวกับ KRunner ให้เปิด KRunner โดยใช้ปุ่มคีย์ลัด <shortcut>Alt+F2</shortcut> และกดไอคอนเครื่องหมายคำถาม

# @info:usagetip
source: Overview is a full-screen overlay that shows all of your open windows, letting you easily access any of them. It also shows your current Virtual Desktops, allowing you to add more, remove some, and switch between them. Finally, it offers a KRunner-powered search field that can also filter through open windows.<nl/><nl/>You can access Overview using the <shortcut>Meta+W</shortcut> keyboard shortcut.
th: โหมดภาพโดยรวมเป็นโหมดเต็มหน้าจอที่แสดงหน้าต่างที่คุณเปิดไว้อยู่ เพื่อให้การเข้าถึงไปยังหน้าต่างนั้นเข้าถึงง่าย โหมดนี้จะแสดง Virtual Desktop ปัจจุบันและสามารถเพิ่ม ลบ และเปลี่ยน Virtual Desktop ได้ และในที่สุดโหมดนี้มีฟังค์ชันค้นหาที่ใช้ KRunner ที่สามารถกรอกหน้าต่างที่เปิดอยู่ได้ด้วย<nl/><nl/>คุณสามารถใช้โหมดภาพโดยรวมได้โดยการกดปุ่ม <shortcut>Meta+W</shortcut>

# @info:window
source: Get Hot New Stuff
th: รับสิ่งของใหม่ที่ได้รับความนิยม

# @info:usagetip
source: Throughout Plasma, System Settings, and KDE apps, you'll find buttons marked "Get New [thing]…". Clicking on them will show you 3rd-party content to extend the system, made by other people like you! In this way, it is often possible to add functionality you want without having to ask KDE developers to implement it themselves.<nl/><nl/>Note that content acquired this way has not been reviewed by your distributor for functionality or stability.
th: ทั้งทั่วใน Plasma การตั้งค่าระบบและแอปพลิเคชัน KDE คุณจะเห็นปุ่มที่เขียนว่า "รับ [สิ่งของ] ใหม่..." ถ้าหากกดไปแล้วจะเป็นการแสดงเนื้อหาจากบุคคลที่สามที่ถูกสร้างโดยคน ๆ อื่นเหมือนกับคุณ! เพื่อที่จะขยายระบบให้มากกว่านี้<nl/><nl/>แต่ขอชี้แจงไว้ก่อนว่าเนื้อหาพวกนี้ไม่ได้ถูกตรวจสอบโดยผู้จัดทำระบบของท่านเพื่อความเสถียรและความหลากหลายของคุณสมบัติ

# @action:button
source: See All Available 3rd-Party Content
th: แสดงเนื้อหาที่สร้างโดยบุคคลที่สามทั้งหมด

# @info:usagetip
source: Plasma is designed to be simple and usable out of the box. Things are where you'd expect, and there is generally no need to configure anything before you can be comfortable and productive.<nl/><nl/>Should you feel the need to, you'll find what you need in the <application>System Settings</application> app.
th: Plasma ได้ถูกออกแบบให้ใช้งานง่ายและเปิดมาใช้ได้เลย สิ่งที่คุณคิดว่าอยู่ตรงไหนอยู่ตรงนั้น และไม่ต้องตั้งค่าอะไรก่อนที่จะทำให้ระบบใช้งานได้อย่างสะดวกสบายและมีประสิทธิผล<nl/><nl/>แต่ถ้าหากว่าอยากจะลองไปเล่นกับการตั้งค่าระบบดู ก็สามารถเข้าไปยังแอปพลิเคชัน<application>การตั้งค่าระบบ</application>ได้

# @action:button
source: Launch System Settings now
th: เปิดการตั้งค่าระบบตอนนี้

# @title the name of the 'System Settings' app
source: System Settings
th: การตั้งค่าระบบ
