Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-welcome/plasma-welcome.po
Languages: th

# NAME OF TRANSLATORS
source: Your names
th: Diskette Guy

# EMAIL OF TRANSLATORS
source: Your emails
th: diskette@dailitation.xyz

# @info:usagetip
source: Friendly onboarding wizard for Plasma
th: ตัวช่วยเริ่มต้นการใช้งานที่เป็นมิตรแก่ผู้ใช้ของ Plasma

# @info:usagetip
source: A welcome app for KDE Plasma
th: แอปยินดีต้อนรับสำหรับ KDE Plasma

# @title
source: Welcome to KDE Plasma
th: ยินดีต้อนรับสู่ KDE Plasma

# @info:credit
source: Author
th: ผู้เขียน

source: Display release notes for the current Plasma release.
th: แสดงบันทึกการเปลี่ยนแปลงสำหรับเวอร์ชัน Plasma ปัจจุบัน

source: Display the live page intended for distro live environments.
th: แสดงหน้าไลฟ์สำหรับดิสโทรที่เป็นสภาพแวดล้อมไลฟ์

source: Specify comma-delimited list of page(s) (by internal name) to be displayed.
th: ใส่รายชื่อหน้าที่จะแสดง (โดยชื่อภายใน) ที่แยกโดยเครื่องหมายจุลภาค

source: Version number of the Plasma release to display release notes for, e.g. 5.25
th: เลขเวอร์ชันของ Plasma ที่ใช้แสดงสำหรับบันทึกการเปลี่ยนแปลง เช่น 5.25

# %1 is the filesystem path to a settings module
source: Unknown module %1 requested
th: ไม่ทราบโมดูล %1 ที่ถูกขอ

# @info:progress
source: The command <command>%1</command> could not be found.
th: ไม่พบเจอคำสั่ง <command>%1</command>

# @info:progress
source: No error message provided
th: ไม่มีข้อความผิดพลาด

source: The command <command>%1</command> failed: %2
th: คำสั่ง <command>%1</command> ล้มเหลว: %2

# @action:button
source: Launch %1 now
th: เปิด %1

source: This settings module could not be loaded
th: โมดูลการตั้งค่าไม่สามารถโหลดได้

# @info:usagetip
source: If you find Plasma to be useful, consider getting involved or donating. KDE is an international volunteer community, not a big company; your contributions make a real difference!
th: ถ้าหากคุณคิดว่า Plasma มีประโยชน์ ลองมีส่วนร่วมหรือบริจาคให้กับ KDE ดูสิ KDE เป็นชุมชนอาสาสมัครนานาชาติและไม่ใช่บริษัทใด ๆ การมีส่วนร่วมของคุณใด ๆ สามารถสร้างความแตกต่างที่เห็นได้จริง!

# @action:button
source: Make a donation
th: บริจาคเงิน

# @action:button
source: Get involved
th: มีส่วนร่วม

# @action:button
source: &Skip
th: &ข้าม

# @action:button
source: &Back
th: &ย้อนกลับ

# @action:button
source: &Finish
th: เ&สร็จสิ้น

# @action:button
source: &Next
th: &ถัดไป

# @option:check
source: Show after Plasma is updated
th: แสดงผลหลังจาก Plasma ได้ถูกอัปเดต

# @action:button
source: &OK
th: &ตกลง

# @title:window Title of the Plasma activities sidebar
source: Activities
th: กิจกรรม

# @title The name of an example Plasma activity
source: Home
th: บ้าน

# @title The name of an example Plasma activity
source: School
th: โรงเรียน

# @title The name of an example Plasma activity
source: Work
th: ที่ทำงาน

# @info:status An example last used message for a Plasma activity
source: Currently being used
th: ใช้ตอนนี้อยู่

# @info:status An example last used message for a Plasma activity
source: Used 3 hours ago
th: ใช้ไป 3 ชั่วโมงก่อน

# @action:button Button in the Plasma activities sidebar
source: Create activity…
th: สร้างกิจกรรมใหม่…

source: Search…
th: ค้นหา...

# @title The default name of a Plasma desktop as seen in the overview
source: Desktop 1
th: เดสก์ท็อป 1

# @info:window
source: Error loading page
th: ผิดพลาดในการโหลดหน้า

# @action:button
source: Report Bug…
th: รายงานข้อผิดพลาด…

# @action:button
source: Copy Details
th: คัดลอกรายละเอียด

# @info:usagetip
source: This page could not be loaded
th: ไม่สามารถโหลดหน้านี้ได้

# @info:usagetip
source: This page provided by your distribution could not be loaded
th: ไม่สามารถโหลดหน้านี้โดยผู้จัดทำระบบได้

# @info:usagetip
source: This page provided by Welcome Center could not be loaded
th: ไม่สามารถโหลดหน้านี้โดย Welcome Center ได้

# @title:window
source: Find Great Apps
th: หาแอปยอดเยี่ยม

source: There’s no need to search the web to download app installers or use a command-line package manager; KDE’s app store <application>%1</application> does it all for you!<nl/><nl/>Click on any of the icons below to give it a try!
th: ไม่ต้องค้นหาบนเว็ปเพื่อในการติดตั้งแอป หรือใช้ตัวจัดการแพ็กเกจแบบบรรทัดคำสั่ง แอปสโตร์ของ KDE <application>%1</application> ทำให้คุณทั้งหมดอยู่แล้ว!<nl/><nl/>กดไอคอนใดข้างล่างเพื่อลอง

# @action:button %1 is the name of an app
source: Show %1 in Discover
th: แสดง %1 ใน Discover

# @title:window
source: Enjoy It!
th: สนุกไปกับมัน!

# @info:usagetip
source: We hope you love Plasma as much as we loved making it for you! Now it’s time to jump right in. Explore its features, install your favorite apps and games, and get busy doing what makes you you!
th: พวกเราหวังว่าคุณชอบ Plasma เท่ากับพวกเราที่ทำมาให้คุณ ตอนนี้ได้ถึงเวลาที่จะกระโดดเข้าไปและสำรวจฟีเจอร์มัน ติดตั้งแอปและเกมที่คุณชอบ และทำให้อะไรก็ตามที่เป็นคุณอยู่ทุกวันนี้

# @label:URL
source: Learn more about the KDE community
th: เรียนรู้เพิ่มเติมเกี่ยวกับชุมชน KDE

# @label:URL
source: Get help at KDE’s discussion forums
th: รับความช่วยเหลือจากกระดานสนทนา KDE

# @action:button
source: Supporting Members
th: สมาชิกต่าง ๆ ที่สนับสนุน

# @title:window
source: Supporting Members
th: สมาชิกต่าง ๆ ที่สนับสนุน

# @info:usagetip
source: We thank the following supporting members for their recurring donation to KDE:
th: พวกเราขอขอบคุณสมาชิกที่บริจากให้แก่ KDE เป็นประจำ:

# @action:button %1 is the selected sort order, e.g. Random
source: Sort: %1
th: จัดเรียง: %1

# @action:inmenu An order to sort a list
source: Random
th: สุ่ม

# @action:inmenu An order to sort a list
source: Last Name
th: สกุล

# @action:inmenu An order to sort a list
source: First Name
th: ชื่อ

source: Contribution Date
th: วันที่ที่มีส่วนช่วย

# @action:inmenu An option to sort a list in reverse order
source: Reverse
th: ย้อนกลับ

# @title: window
source: Share Anonymous Usage Information
th: ส่งข้อมูลการใช้งานอย่างไม่ระบุตัวตน

# @info:usagetip
source: Our developers will use this anonymous data to improve KDE software. You can choose how much to share in System Settings, and here too.
th: ผู้พัฒนาของเราจะใช้ข้อมูลพวกนี้เพื่อการพัฒนาซอฟต์แวร์ KDE ให้ดีขึ้น คุณสามารถเลือกว่าจะส่งข้อมูลไปมากเท่าไหร่ที่นี้ หรือในการตั้งค่า

# @title:window %1 is the name of the user's distro
source: Welcome to %1!
th: ยินดีต้อนรับสู่ %1!

# @info:usagetip %1 is the name of the user's distro
source: Pressing the icon below will begin installing %1. Alternatively, you can close the window to explore the live environment or continue here to find out about KDE Plasma.
th: กดไอคอนข้างล่างจะเริ่มการติดตั้ง %1 หรือคุณสามารถปิดหน้าต่างนี้เพื่อสำรวจสภาพแวดล้อมแบบไลฟ์หรือดำเนินการต่อที่นี่เพื่อทำความรู้จักเกี่ยวกับ KDE Plasma เพิ่มเติม

# @info:usagetip %1 is the name of the user's distro
source: You can close the window to explore the live environment or continue here to find out about KDE Plasma.
th: คุณสามารถปิดหน้าต่างนี้เพื่อสำรวจสภาพแวดล้อมแบบไลฟ์หรือดำเนินการต่อที่นี่เพื่อทำความรู้จักเกี่ยวกับ KDE Plasma เพิ่มเติม

# @action:button
source: Visit home page
th: เยี่ยมชมหน้าโฮมเพจ

# @info:window
source: Access the Internet
th: เข้าถึงอินเทอร์เน็ต

# @info:usagetip
source: You can connect to the internet and manage your network connections with the <interface>Networks applet</interface>. To access it, click on the <interface>Networks</interface> icon in your <interface>System Tray</interface>, which lives in the bottom-right corner of the screen.
th: คุณสามารถเชื่อมต่อไปยังอินเทอร์เน็ตได้และจัดการการเชื่อมต่อได้โดยใช้<interface>แอปเพล็ตเครือข่าย</interface> ถ้าจะใช้แอปเพล็ตเครือข่าย ให้กดที่ปุ่มไอคอน<interface>เครือข่าย</interface>ใยน<interface>ถาดระบบ</interface> ที่อยู่ตรงด้านขวาล่างของหน้าจอ

# @info:placeholder
source: Networking support for Plasma is not currently installed
th: ไม่ได้ติดตั้งการรองรับเครือข่ายสำหรับ Plasma

# @info:usagetip %1 is the name of the user's distro
source: To manage network connections, Plasma requires <icode>plasma-nm</icode> to be installed. Please report this omission to %1.
th: การจัดการเชื่อมต่อต่าง ๆ ต้องติดตั้ง<icode>plasma-nm</icode> กรุณาแจ้งกับ %1

# @info:placeholder Shown when connected to the internet
source: You’re connected
th: คุณเชื่อมต่อแล้ว

# @info:usagetip Shown when connected to the internet
source: All good to go!
th: พร้อมใช้งานแล้ว!

# @info
source: This page is being shown regardless of network connectivity because you are using a development version. To manually preview the different states of the page, you can use the button.
th: หน้านี้ได้แสดงขึ้นมาถึงแม้ว่าจะมีหรือไม่มีการเชื่อมต่อเครือข่ายเพราะคุณกำลังใช้เวอร์ชันที่พัฒนาอยู่ ถ้าจะแสดงตัวอย่างสำหรับ

# @action:button
source: Change state
th: เปลี่ยนสถานะ

# @title:window
source: Plasma has been updated to %1
th: Plasma ได้อัพเดทเป็น %1

# @info:usagetip
source: Thank you for testing this beta release of Plasma — your feedback is fundamental to helping us improve it! Please report any and all bugs you find so that we can fix them.
th: ขอบคุณที่ทดสอบเวอร์ชัน Plasma เบต้านี้ ข้อเสนอแนะของคุณมีประโยชน์มากแก่พวกเรา! ฉะนั้นขอรบกวนแจ้งข้อผิดพลาดที่พบเห็นในเวอร์ชันนี้ จะได้นำไปแก้พวกมัน

# @info:usagetip
source: KDE contributors have spent the last four months hard at work on this release. We hope you enjoy using Plasma as much as we enjoyed making it!
th: ผู้ช่วย KDE ได้ใช้เวลาสี่เดือนที่แล้วในการทำเวอร์ชันนี้ขึ้นมา พวกเราหวังว่าคุณจะสำราญใจกับการใช้ Plasma เท่ากับการที่พวกเราทำมัน

# @label:URL
source: Report a bug
th: รายงานข้อผิดพลาด

# @info
source: Download an embedded preview of the release announcement?
th: ดาวน์โหลดหน้าตัวอย่างของ Plasma เวอร์ชันนี้ไหม?

# @info
source: The preview has not been automatically downloaded because you are using a metered network connection.
th: ไม่สามารถโหลดหน้าตัวอย่างอัตโนมัติได้เพราะคุณใช้เครือข่ายที่จำกัดอยู่

# @info, %1 is an error code
source: The preview could not be downloaded — a network error occurred (%1).
th: ไม่สามารถโหลดหน้าตัวอย่างได้ เครือข่ายมีปัญหา (%1)

# @info
source: The preview could not be loaded — a parse error occurred.
th: ไม่สามารถโหลดหน้าตัวอย่างได้ การแยกวิเคราะห์ข้อความมีปัญหา

# @action:button
source: Download Preview
th: ดาวน์โหลดตัวอย่าง

# @action:button
source: Download Anyway
th: ดาวน์โหลดไปเลย

# @action:button
source: Retry
th: ลองใหม่

# @action:button
source: Open in Browser…
th: เปิดในเบราว์เซอร์…

# @option:check
source: Load preview automatically
th: โหลดหน้าตัวอย่างอัตโนมัติ

# @info:tooltip
source: The preview will be loaded automatically when this page is shown for future Plasma updates, except when using a metered network connection.
th: หน้าตัวอย่างจะถูกโหลดโดยอัตโนมัติเมื่อมีอัพเดท Plasma ใหม่ ยกเว้นว่าจะใช้การเชื่อมต่อเครือข่ายแบบจำกัด

# @info
source: <b>Click to read the announcement</b>
th: <b>คลิกเพื่อเปิดการประกาศ</b>

# @info:window
source: Powerful When Needed
th: ทรงพลังเมื่อจำเป็น

# @title:row Name of the 'Overview' KWin effect
source: Overview
th: โหมดภาพโดยรวม

# @info Caption for Overview button
source: Your system command center
th: ศูนย์คำสั่งระบบของคุณ

# @info Caption for KRunner button
source: Search for anything
th: ค้นหาอะไรก็ได้

# @info Caption for KDE Connect button
source: Connect your phone and your computer
th: เชื่อมต่อโทรศัพท์และคอมพิวเตอร์ของคุณ

# @title:row Name of the 'Activities' Plasma feature
source: Activities
th: กิจกรรม

source: Separate work, school, or home tasks
th: แยกงานต่าง ๆ อย่างทำงาน โรงเรียน หรืองานบ้าน

# @info Caption for Plasma Vaults button
source: Store sensitive files securely
th: เก็บไฟล์อย่างปลอดภัย

# @action:button
source: Learn about more Plasma features
th: เรียนรู้เพิ่มเติมเกี่ยวกับฟีเจอร์ Plasma

# @info:window
source: Activities
th: กิจกรรม

# @info:usagetip
source: Activities can be used to separate high-level projects or workflows so you can focus on one at a time. You can have an activity for “Home”, “School”, “Work”, and so on. Each Activity has access to all your files but has its own set of open apps and windows, recent documents, “Favorite” apps, and desktop widgets.
th: สามารถเรียกใช้ "กิจกรรม" เพื่อการแยกโปรเจคหรือเวิร์กโฟลว์ระดับสูง เพื่อนำไปใช้ในการมุ่งเน้นการทำงานหนึ่งงานในเวลาหนึ่งเดียว คุณสามารถสร้างกิจกรรมสำหรับ "บ้าน" "โรงเรียน" "ที่ทำงาน" และ ฯลฯ กิจกรรมแต่ละอันสามารถเข้าถึงไฟล์ทุกอย่างของคุณได้ แต่มีแอปพลิเคชันและหน้าต่างที่เปิดอยู่ เอกสารที่ใช้ล่าสุด แอปพลิเคชันที่ชอบ และวิดเจ็ต เป็นของมันเอง

# @action:button
source: Open Settings…
th: เปิดการตั้งค่า...

# @info:usagetip
source: To get started, launch <interface>System Settings</interface> and search for “Activities”. On that page, you can create more Activities. You can then switch between them using the <shortcut>Meta+Q</shortcut> keyboard shortcut.
th: ถ้าหากจะเริ่มใช้งาน เปิด<interface>การตั้งค่าระบบ</interface> และค้นหา "กิจกรรม" คุณสามารถสร้างกิจกรรมเพิ่มเติมได้ และจากนั้นก็สลับเปลี่ยนมันโดยใช้ปุ่มคีย์ลัด <shortcut>Meta+Tab</shortcut>

# @info:usagetip
source: KRunner is Plasma’s exceptionally powerful and versatile search system. It powers the search functionality in the Application Launcher menu and the Overview screen, and it can be accessed as a standalone search bar using the <shortcut>Alt+Space</shortcut> keyboard shortcut.<nl/><nl/>In addition to finding your files and folders, KRunner can launch apps, search the web, convert between currencies, calculate math problems, and a lot more.
th: KRunner เป็นระบบค้นหาอเนกประสงค์ของ Plasma ที่มีสมรรถภาพสูง ซึ่งถูกใช้ในเมนูเปิดใช้แอปพลิเคชัน และโหมดภาพโดยรวม และสามารถเข้าถึงกล่องค้นหาได้ผ่านคีย์ลัด <shortcut>Alt+เว้นวรรค</shortcut><nl/><nl/>ทั้งที่สามารถหาไฟล์และโฟลเดอร์ได้ KRunner สามารถเปิดแอปพลิเคชัน ค้นหาบนอินเทอร์เน็ต แปลงค่าเงิน คำนวนเลขคณิตฯ และอีกมากมายมากว่านี้

# @info:usagetip
source: To learn more, open the KRunner search bar using the <shortcut>Alt+Space</shortcut> keyboard shortcut and click on the question mark icon.
th: ถ้าอยากเรียนรู้มากกว่านี้เกี่ยวกับ KRunner ให้เปิด KRunner โดยใช้ปุ่มคีย์ลัด <shortcut>Alt+เว้นวรรค</shortcut> และกดไอคอนเครื่องหมายคำถาม

source: ...and much more!
th: ...และอื่น ๆ อีกมากมาย!

# @info:window The name of a KWin effect
source: Overview
th: โหมดภาพโดยรวม

# @info:usagetip
source: Overview is a full-screen overlay that shows all of your open windows, letting you easily access any of them. It also shows your current Virtual Desktops, allowing you to add more, remove some, and switch between them. Finally, it offers a KRunner-powered search field that can also filter through open windows.
th: โหมดภาพโดยรวมเป็นโหมดเต็มหน้าจอที่แสดงหน้าต่างที่คุณเปิดไว้อยู่ เพื่อให้การเข้าถึงไปยังหน้าต่างนั้นเข้าถึงง่าย โหมดนี้จะแสดง Virtual Desktop ปัจจุบันและสามารถเพิ่ม ลบ และเปลี่ยน Virtual Desktop ได้ และในที่สุดโหมดนี้มีฟังค์ชันค้นหาที่ใช้ KRunner ที่สามารถกรอกหน้าต่างที่เปิดอยู่ได้ด้วย

# @info:usagetip
source: You can access Overview using the <shortcut>Meta+W</shortcut> keyboard shortcut, or by moving your mouse into the top-left corner of the screen. You can also press <shortcut>Meta+G</shortcut> for Grid View, which shows Virtual Desktops in a grid.
th: คุณสามารถใช้โหมดภาพโดยรวมได้โดยการกดปุ่มคีย์ลัด <shortcut>Meta+W</shortcut> หรือโดยการเอาเมาส์ดันไปที่มุมหน้าจอทางด้านซ้าย-บน คุณสามารถดูแบบตารางได้โดยใช้ปุ่มคีย์ลัด <shortcut>Meta+G</shortcut> และจะแสดงหน้า Virtual Desktop เป็นตาราง

# @info:usagetip
source: Plasma Vaults allows you to create encrypted folders, called <interface>Vaults.</interface> Inside each Vault, you can securely store your passwords, files, pictures, and documents, safe from prying eyes. Vaults can live inside folders that are synced to cloud storage services too, providing extra privacy for that content.
th: Plasma Vaults สามารถสร้างโฟลเดอร์ที่เข้ารหัสได้ที่เรียกว่า <interface>Vaults</interface> ข้างใน Vault แต่ละอัน คุณสามารถเก็บรหัสผ่าน ไฟล์ รูป และเอกสารได้อย่างปลอดภัย Vaults สามารถอยู่ข้างในโฟลเดอร์ที่ซิงค์ไปยังบริการพื้นที่จัดกับคลาวด์ได้ด้วย ทำให้มีความปลอดภัยยิ่งขึ้น

# @title The name of an example Plasma vault
source: Important Documents
th: เอกสารสำคัญ

# @title The name of an example Plasma vault
source: My Photos
th: รูปของฉัน

source: Unlock and Open
th: เปิดล็อกและเปิด

# @info:usagetip
source: To get started, click the arrow on the <interface>System Tray</interface> to show hidden items, and then click the <interface>Vaults</interface> icon.
th: ถ้าหากจะเริ่มใช้งาน กดลูกศรที่<interface>ถาดระบบ</interface>เพื่อที่จะแสดงรายการที่ซ่อนอยู่ จากนั้นกดที่ไอคอน <interface>Vaults</interface>

# @info:window
source: Simple by Default
th: เรียบง่ายเป็นค่าเริ่มต้น

# @info:usagetip
source: Plasma is designed to be simple and usable out of the box. Things are where you would expect, and there is generally no need to configure anything before you can be comfortable and productive.<nl/><nl/>Below is a visual representation of a typical Plasma Desktop; move the pointer over or click on something to learn about it!
th: Plasma ได้ถูกออกแบบให้ใช้งานง่ายและเปิดมาใช้ได้เลย สิ่งที่คุณคิดว่าอยู่ตรงไหนอยู่ตรงนั้น และไม่ต้องตั้งค่าอะไรก่อนที่จะทำให้ระบบใช้งานได้อย่างสะดวกสบายและมีประสิทธิผล<nl/><nl/>ข้างล่างนี้เป็นตัวอย่างของหน้า Plasma Desktop ทั่วไปของคุณ ลองเอาเมาส์เคอร์เซอร์ของคุณไปชี้หรือคลิ๊กอะไรบางอย่างเพื่อเรียนรู้เกี่ยวกับมันเพิ่มเติม

# @info
source: This is the “Desktop”. It shows files and folders that are contained in your <filename>Desktop</filename> folder, and can hold widgets. Right-click on it and choose <interface>Desktop and Wallpaper…</interface> to configure the appearance of the desktop. You can also choose <interface>Enter Edit Mode</interface> to add, remove or modify widgets.
th: นี้คือ "เดสก์ท็อป" เป็นที่อยู่ไฟล์และโฟลเดอร์ที่เก็บไว้ในโฟลเดอร์<filename>เดสก์ท็อป</filename>ของคุณ และสามารถใส่วิดเจ็ตได้ด้วย ถ้าหากจะเปลี่ยนวอลล์เปเปอร์กดคลิกขวาที่หน้าเดสก์ท็อปและเลือก<interface>เดสก์ท็อปและวอลล์เปเปอร์…</interface> ถ้าจะตกแต่งหน้าเดสก์ท็อปโดยใช้วิดเจ็ตสามารถกดปุ่ม<interface>เข้าโหมดแก้ไข</interface>ได้ด้วย

# @info
source: This is a “Panel” — a container to hold widgets. Right-click on it and choose <interface>Show Panel Configuration</interface> to change how it behaves, which screen edge it lives on, and to add, remove or modify widgets.
th: นี้คือ "แผง" เป็นอยู่ของวิดเจ็ตต่าง ๆ สามารถกดคลิกขวาที่นั้นและเลือก<interface>แสดงการตั้งค่าแผง</interface>เพื่อการตั้งค่าแผงนั้น ๆ ว่าอยู่ตรงไหน หรือจะลบ เพิ่ม และแก้ไขวิดเจ็ตใด ๆ

# @info
source: This is the “Task Manager” widget, where you can switch between open apps and also launch new ones. Drag app icons to re-arrange them.
th: นี้คือวิดเจ็ต "ตัวจัดการงาน" คุณสามารถใช้วิดเจ็ตนี้ในการเปลี่ยนระหว่างแอปพลิเคชันที่เปิดอยู่ เปิดแอปใหม่ และย้ายโดยการลากไอคอนแอป

# @info
source: This is the “System Tray” widget, which lets you control system functions like changing the volume and connecting to networks. Items will become visible here only when relevant. To see all available items, click the ⌃ arrow next to the clock.
th: นี้คือวิดเจ็ต "ถาดระบบ" สามารถควบคุมฟังก์ชันรพบบต่าง ๆ เช่น ลดหรือเพิ่มระดับเสียง หรือเชื่อมต่อไปยังเครือข่ายไร้สาย ไอคอนแต่ละตัวจะแสดงตัวตนเมื่อมีประโยชน์เท่านั้น ถ้าจะดูไอคอนทั้งหมดกดลูกศร ^ ข้าง ๆ นาฬิกา

# @info
source: This is the “Digital Clock” widget. Click on it to show a calendar. It can be also configured to show other timezones and events from your digital calendars.
th: นี้คือวิดเจ็ต "นาฬิกาดิจิตอล" สามารถแสดงปฏิทินได้โดยการกดคลิกที่นั้น สามารถตั้งให้แสดงกิจกรรมจากปฏิทินและโซนเวลาอื่นได้ด้วย

# @info
source: This is the “Peek at Desktop” widget. Click on it to temporarily hide all open windows so you can access the desktop. Click on it again to bring them back.
th: นี้คือวิดเจ็ต "ดูหน้าเดสก์ท็อป" สามารถซ่อนแอปพลิเคชันทั้งหมดที่เปิดอยู่ได้โดยการกดคลิกซ้าย และถ้าอยากเรียกแอปพลิเคชันกลับมาก็กดอีกครั้งได้

# @title:window
source: Get Involved
th: มีส่วนร่วม

# @info:usagetip
source: KDE is not a big company; it's an international volunteer community, and its software is made by people like you donating their time and passion. You too can help make things better, whether it's through translation, visual design, and promotion, or programming and bug triaging.<nl/><nl/>By contributing to KDE, you can become part of something special, meet new friends, learn new skills, and make a difference to millions while working with people from around the globe to deliver a stunning free software computing experience.
th: KDE ไม่ใช่บริษัทใหญ่ ๆ ใด ๆ แต่เป็นชุมชนอาสาสมัครนานาชาติ และซอฟต์แวร์ทั้งหมดได้ถูกสร้างโดยผู้คนอย่างคุณโดยการบริจาคน้ำเหงือไม่ว่าจะเป็นเวลาหรือความรักกับโปรเจ็คนี้ คุณก็สามารถช่วยให้โปรเจ็คนี้ดีขึ้นได้ไม่ว่าจะเป็นการช่วยแปลภาษา การออกแบบภาพ การส่งเสริมสนับสนุน หรือการเขียนโปรแกรมและไล่ตามหาบัคต่าง ๆ<nl/><nl/>การที่ช่วยเหลือ KDE นั้น คุณสามารถเป็นส่วนหนึ่งในอะไรบางอย่างที่พิเศษ พบเพื่อนใหม่ เรียนรู้ทักษะใหม่ และสร้างความแตกต่างให้กับคนเป็นล้าน ๆ ระหว่างที่ทำงานกับคนทั่วโลกเพื่อที่จะมอบประสบการณ์ซอฟต์แวร์เวร์ที่เหลือเชื่อ

# @info:usagetip
source: Plasma is a free and open-source desktop environment created by KDE, an international software community of volunteers. The Plasma desktop environment is simple by default for a smooth experience, but powerful when needed to help you really get things done. We hope you love it!
th: Plasma เป็นสภาพแวดล้อมเดสก์ท็อปเสรีและโอเพนซอร์สสร้างโดยชุมชน KDE ที่เต็มไปด้วยอาสาสมัครนานาชาติ Plasma นั้นออกแบบมาให้เรียบง่ายโดยค่าเริ่มต้นแต่ทรงพลังเมื่อผู้ใช้ต้องการ ห พวกเราหวังว่าคุณจะชอบมัน!

# @title
source: Welcome
th: ยินดีต้อนรับ

# @info:usagetip %1 is custom text supplied by the distro
source: %1<nl/><nl/>This operating system is running Plasma, a free and open-source desktop environment created by KDE, an international software community of volunteers. It is designed to be simple by default for a smooth experience, but powerful when needed to help you really get things done. We hope you love it!
th: %1<nl/><nl/>ระบบปฏิบัติการนี้กำลังใช้ Plasma อยู่ เป็นสภาพแวดล้อมเดสก์ท็อปเสรีและโอเพนซอร์สสร้างโดยชุมชน KDE ที่เต็มไปด้วยอาสาสมัครนานาชาติ Plasma นั้นออกแบบมาให้เรียบง่ายโดยค่าเริ่มต้นแต่ทรงพลังเมื่อผู้ใช้ต้องการ พวกเราหวังว่าคุณจะชอบมัน!

# @info:usagetip %1 is the name of the user's distro
source: Welcome to the %1 operating system running KDE Plasma!<nl/><nl/>Plasma is a free and open-source desktop environment created by KDE, an international software community of volunteers. It is designed to be simple by default for a smooth experience, but powerful when needed to help you really get things done. We hope you love it!
th: ยินดีต้อนรับสู่ระบบปฏิบัติการ %1 ที่ใช้ KDE Plasma Plasma เป็นสภาพแวดล้อมเดสก์ท็อปเสรีและโอเพนซอร์สสร้างโดยชุมชน KDE ที่เต็มไปด้วยอาสาสมัครนานาชาติ Plasma นั้นออกแบบมาให้เรียบง่ายโดยค่าเริ่มต้นแต่ทรงพลังเมื่อผู้ใช้ต้องการ พวกเราหวังว่าคุณจะชอบมัน!

# @action:inmenu
source: About Welcome Center
th: เกี่ยวกับ Welcome Center

# @action:inmenu
source: About KDE
th: เกี่ยวกับ KDE

# @action:button
source: Learn more about the KDE community
th: เรียนรู้เพิ่มเติมเกี่ยวกับชุมชน KDE

# @action:button
source: Start Contributing!
th: เริ่มการมีส่วนร่วม!

# @action:button %1 is the name of the user's distro
source: Learn more about %1
th: เรียนรู้เพิ่มเติมเกี่ยวกับ %1

# @info
source: The KDE mascot Konqi welcomes you to the KDE community!
th: มาสคอต KDE ที่มีชื่อว่า Konqi ยินดีต้อนรับคุณสู่ชุมชน KDE

# @title
source: Image loading failed
th: การโหลดรูปล้มเหลว

# @title
source: Welcome to KDE Plasma!
th: ยินดีต้อนรับสู่ KDE Plasma!

# @info:placeholder
source: Could not load <filename>%1</filename>. Make sure it exists.
th: ไม่สามารถโหลด <filename>%1</filename> ได้ กรุณาดูว่าไฟล์นี้มีอยู่ในเครื่องจริงไหม

# @action:button clicking on this takes the user to a web page
source: Visit %1
th: เยี่ยมชม %1

# @label %1 is the Plasma version
source: %1 Beta
th: %1 เบต้า

# @label %1 is the Plasma version, %2 is the beta release number
source: %1 Beta %2
th: %1 เบต้า %2

# @info
source: Page %1 of %2
th: หน้า %1 จาก %2

# @title: window
source: Share Anonymous Usage Information With KDE
th: ส่งข้อมูลการใช้งานอย่างไม่ระบุตัวตนให้ KDE

# @title: window
source: Connect Your Online Accounts
th: เชื่อมต่อบัญชีออนไลน์ของคุณ
