Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-nm/plasma_applet_org.kde.plasma.networkmanagement.po
Languages: th

source: Connect
th: เชื่อมต่อ

source: Connected
th: เชื่อมต่อแล้ว

source: Disconnect
th: ตัดการเชื่อมต่อ

source: Show Network's QR Code
th: แสดง QR โคดของเครือข่าย:

source: Configure…
th: ตั้งค่า

source: Speed
th: ความเร็ว

source: Details
th: รายละเอียด

# @info:tooltip
source: Current download speed is %1 kibibytes per second; current upload speed is %2 kibibytes per second
th: ความเร็วอัปโหลดคือ %1 คิบิไบต์ต่อวินาที ความเร็วดาวน์โหลดคือ %2 คิบิไบต์ต่อวินาที

source: Connected, ⬇ %1/s, ⬆ %2/s
th: ความเร็วการเชื่อมต่อ ⬇ %1/วิ ⬇ %2/วิ

source: You need to log in to this network
th: คุณต้องลงชื่อเข้าใช้เครือข่ายนี้

# @action:button
source: Log in
th: ลงชื่อเข้าใช้

source: Airplane mode is enabled
th: โหมดเครื่องบินได้ถูกเปิด

source: Wireless and mobile networks are deactivated
th: เครือข่ายไร้สายและข้อมูลมือถือปิดอยู่

source: Wireless is deactivated
th: เครือข่ายไร้สายปิดใช้งานอยู่

source: Mobile network is deactivated
th: ข้อมูลมือถือปิดใช้งานอยู่

source: No matches
th: ไม่เจอ

source: No available connections
th: ไม่มีการเชื่อมต่อที่ใช้ได้

source: Copy
th: คัดลอก

source: Networks
th: เครือข่าย

# @info:tooltip
source: Middle-click to turn off Airplane Mode
th: กดปุ่มเมาส์กลางเพื่อปิดโหมดเครื่องบิน

# @info:tooltip
source: Middle-click to turn on Airplane Mode
th: กดปุ่มเมาส์กลางเพื่อเปิดโหมดเครื่องบิน

source: Enable Wi-Fi
th: เปิด Wi-Fi

source: Enable Mobile Network
th: เปิดข้อมูลมือถือ

source: Enable Airplane Mode
th: เปิดโหมดเครื่องบิน

source: Open Network Login Page…
th: เปิดหน้าลงชื่อเข้าใช้...

source: &Configure Network Connections…
th: &ตั้งค่าการเชื่องต่อเครือข่าย

# @title:window
source: QR Code for %1
th: QR โคดสำหรับ %1

# @action:button
source: Return to Network Connections
th: กลับไปยังการเชื่อมต่อเครือข่าย

source: Scan this QR code with another device to connect to the "%1" network.
th: สแกน QR โคดนี้กับอุปกรณ์อื่นเพื่อที่จะเชื่อมต่อไปยังเครือข่าย "%1"

source: Enable mobile network
th: เปิดใช้งานข้อมูลมือถือ

# @info
source: Disable airplane mode<nl/><nl/>This will enable Wi-Fi and Bluetooth
th: ปิดโหมดเครื่องบิน<nl/> <nl/> ตัวเลือกนี้จะเปิด Wi-Fi และ Bluetooth

# @info
source: Enable airplane mode<nl/><nl/>This will disable Wi-Fi and Bluetooth
th: เปิดโหมดเครื่องบิน<nl/> <nl/> ตัวเลือกนี้จะปิด Wi-Fi และ Bluetooth

source: Hotspot
th: ฮอตสปอต

source: Disable Hotspot
th: ปิดฮอตสปอต

source: Create Hotspot
th: สร้างฮอตสปอต

source: Configure network connections…
th: ตั้งค่าการเชื่อต่อเครือข่าย...

source: Upload
th: อัพโหลด

source: Download
th: ดาวน์โหลด

source: Password…
th: รหัสผ่าน...
