Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-nm/plasmanetworkmanagement-kcm.po
Languages: th

source: Import the VPN configuration from "%1"?
th: นำเข้าไฟล์การตั้งค่า VPN จาก "%1" ไหม?

# @title:window
source: Import VPN Configuration
th: นำเข้าการตั้งค่า VPN

source: Import
th: นำเข้า

source: Failed to import VPN connection: %1
th: การนำเข้าการเชื่อมต่อ VPN ล้มเหลว: %1

source: Connection imported.
th: นำเข้าการเชื่อมต่อแล้ว

source: Export VPN Connection
th: นำออกการเชื่อมต่อ VPN

source: Do you want to save changes made to the connection '%1'?
th: คุณอยากจะบันทึกการเปลี่ยนแปลงกับการเชื่อมต่อ '%1' ไหม

# @title:window
source: Save Changes
th: บันทึกการเปลี่ยนแปลง

source: Import VPN Connection
th: นำเข้าการเชื่อมต่อ VPN

source: VPN connections (%1)
th: การเชื่อมต่อ VPN (%1)

source: No file was provided
th: ไม่มีไฟล์ให้มา

source: Unknown VPN type
th: ไม่รู้จักชนิด VPN

# @title:window
source: Choose a Connection Type
th: เลือกชนิดการเชื่อมต่อ

source: Create
th: สร้าง

source: Cancel
th: ยกเลิก

source: Configuration
th: การตั้งค่า

# @title:window
source: Configuration
th: การตั้งค่า

source: General
th: ทั่วไป

source: Ask for PIN on modem detection
th: ถามหา PIN ตอนพบเจอโมเด็ม

source: Show virtual connections
th: แสดงการเชื่อมต่อเสมือนจริง

source: Create new connections as system connections
th: สร้างการเชื่อมต่อใหม่เป็นการเชื่อมต่อของระบบ

source: Hotspot
th: ฮอตสปอต

source: Hotspot name:
th: ชื่อฮอตสปอต:

# @label Hotspot name
source: Name:
th: ชื่อ:

# @label Hotspot password
source: Password:
th: รหัสผ่าน:

source: Hotspot password:
th: รหัสผ่านฮอตสปอต:

source: Hotspot name must not be empty
th: ชื่อฮอตสปอตต้องไม่ว่าง

source: OK
th: ตกลง

source: Hotspot password must either be empty or consist of anywhere from 8 up to 64 characters
th: รหัสผ่านฮอตสปอตต้องว่างเปล่าหรือมีอักขระใดก็ได้ระหว่าง 8 ถึง 64 ตัว

source: Hotspot password must either be empty or consist of one of the following:<ul><li>Exactly 5 or 13 any characters</li><li>Exactly 10 or 26 hexadecimal characters:<br/>abcdef, ABCDEF or 0-9</li></ul>
th: รหัสผ่านฮอตสปอตต้องว่างเปล่าหรือเป็นดังนี้:<ul><li>อักขระ 5 หรือ 13 ตัวเท่านั้น แต่จะเป็นอะไรก็ได้</li><li>อักขระฐานสิบหก 10 หรือ 26 ตัวเท่านั้น ได้แก่ตัว:<br/>abcdef, ABCDEF และ 0-9</li></ul>

source: Connect
th: เชื่อมต่อ

source: Disconnect
th: ตัดการเชื่อมต่อ

source: Delete
th: ลบ

source: Export
th: ส่งออก

source: Connected
th: เชื่อมต่อแล้ว

source: Connecting
th: กำลังเชื่อมต่อ

source: Add new connection
th: เพิ่มการเชื่อมต่อใหม่

source: Remove selected connection
th: ลบการเชื่อมต่อที่ถูกเลือก

source: Export selected connection
th: นำออกการเชื่อมต่อที่ถูกเลือก

# @title:window
source: Remove Connection
th: ลบการเชื่อมต่อ

source: Do you want to remove the connection '%1'?
th: คุณอยากจะลบการเชื่อมต่อ '%1' หรือไม่?
