Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-nm/plasmanetworkmanagement_openconnectui.po
Languages: th

source: Failed to initialize software token: %1
th: การเริ่มซอฟต์แวร์โทเคนล้มเหลว: %1

source: Contacting host, please wait…
th: กำลังติดต่อโฮสต์ กรุณารอ...

# Verb, to proceed with login
source: Login
th: ลงชื่อเข้าใช้

source: Check failed for certificate from VPN server "%1". Reason: %2 Accept it anyway?
th: การตรวจสอบใบรับรองล้มเหลวจากเซิร์ฟเวอร์ VPN "%1" เหตุผล: %2 ยอมรับเลยไหม?

source: Connection attempt was unsuccessful.
th: การเชื่อมต่อล้มเหลว

source: OpenConnect VPN Authentication
th: การรับรองความถูกต้อง OpenConnect VPN

source: VPN Host
th: โฮสต์ VPN

source: Connect
th: เชื่อมต่อ

source: Automatically start connecting next time
th: เริ่มต้นการเชื่อมต่อโดยอัตโนมัติในครั้งต่อไป

source: Store passwords
th: เก็บรหัสผ่าน

source: Store browser cookies in plain-text
th: เก็บคุกกี้เบราว์เซอร์เป็นเพลนเท็กซ์

source: View Log
th: ดูบันทึก log

source: Log Level:
th: ระดับ log:

source: Error
th: ผิดพลาด

source: Info
th: รายละเอียด

source: Trace
th: แกะรอย

source: OpenConnect Settings
th: การตั้งค่า OpenConnect

# like in General settings
source: General
th: ทั่วไป

source: Gateway:
th: เกตเวย์:

source: CA Certificate:
th: ใบรับรอง CA:

source: Proxy:
th: พร็อกซี:

source: CSD Wrapper Script:
th: สคริปต์ CSD Wrapper:

source: Allow Cisco Secure Desktop trojan
th: อนุญาตใช้ Cisco Secure Desktop trojan

source: VPN Protocol:
th: โพรโทคอล VPN:

source: Reported OS:
th: ระบบปฏิบัติการที่ถูกรายงาน:

source: Reported Version
th: เวอร์ชันที่ถูกรายงาน

source: Certificate Authentication
th: การรับรองความถูกต้องใบรับรอง

source: Machine Certificate:
th: รับรองของเครื่อง:

source: Private Key:
th: กุญแจส่วนตัว:

source: User Certificate:
th: ใบรับรองผู้ใช้:

source: Use FSID for key passphrase
th: ใช้ FSID เป็นรหัสผ่านกุญแจ

source: Prevent user from manually accepting invalid certificates
th: ไม่อนุญาตให้ผู้ใช้ใช้ใบรับรองที่ไม่ถูกต้อง

source: Token Authentication
th: การรับรองความถูกต้องแบบโทเคน

source: OpenConnect OTP Tokens
th: โทเคน OpenConnect OTP

source: Software Token Authentication
th: การรับรองความถูกต้องแบบซอฟต์แวร์โทเคน

source: Token Mode:
th: โหมดโทเคน:

source: Token Secret:
th: รหัสลับโทเคน:

source: Choose a Passkey
th: เลือก Passkey

source: Which passkey do you want to use for %1?
th: จะใช้ passkey ตัวไหนสำหรับ %1?

source: Ok
th: ตกลง

source: Use your security key with %1
th: ใช้กุญแจความปลอดภัยของคุณกับ %1

source: Touch your security key again to complete the request.
th: แตะกุญแจความปลอดภัยอีกรอบหนึ่งเพื่อทำส่งคำขอให้สำเร็จ

source: Next
th: ต่อไป

source: PIN Required
th: ต้องใช้ PIN

source: Enter the PIN for your security key
th: ใส่รหัสผ่าน PIN สำหรับกุญแจความปลอดภัยของคุณ

source: New PIN Required
th: ต้องใช้ PIN ใหม่

source: Set new PIN for your security key
th: ตั้ง PIN ใหม่สำหรับกุญแจความปลอดภัยของคุณ

source: Change PIN Required
th: ต้องเปลี่ยน PIN

source: Change PIN for your security key
th: เปลี่ยน PIN สำหรับกุญแจความปลอดภัยของคุณ

source: Internal User Verification Locked
th: การยืนยันตัวตนผู้ใช้แบบภายในถูกล็อค

source: Wrong PIN. %1 attempts remaining.
th: PIN ผิด สามารถลองได้อีก %1 ครั้ง

source: Too Short. %1 attempts remaining.
th: สั้นเกินไป สามารถลองได้อีก %1 ครั้ง

source: Invalid Characters. %1 attempts remaining.
th: ตัวอักษรไม่ถูกต้อง สามารถลองได้อีก %1 ครั้ง

source: Same as current PIN. %1 attempts remaining.
th: PIN เดียวกันกับปัจจุบัน สามารถลองได้อีก %1 ครั้ง

source: Something went wrong
th: อะไรบางอย่าผิดพลาด

source: Request Timeout
th: คำขอหมดเวลา

source: Key not registered
th: กุญแจไม่ได้จดทะเบียน

source: You already registered this device.Try again with device
th: คุณจดทะเบียนอุปกรณ์นี้แล้ว ลองอีกอุปกรณ์

source: The security key is locked because the wrong PIN was entered too many times.To unlock it, remove and reinsert it.
th: กุญแจความปลอดภัยนี้ได้ถูกล็อกเนื่องจากใช้ PIN ผิดพลาดมากเกินไป ถ้าหากจะปลดล็อกให้ถอดออกและเสียบใหม่

source: The security key is locked because the wrong PIN was entered too many times. You'll need to reset the security key.
th: กุญแจความปลอดภัยนี้ได้ถูกล็อกเนื่องจากใช้ PIN ผิดพลาดมากเกินไป ถ้าหากจะปลดล็อกต้องรีเซ็ตกุญแจความปลอดภัย

source: Authenticator removed during verification. Please reinsert and try again
th: ตัวรับรองความถูกต้องได้ถูกลบระหว่างการตรวจสอบ กรุณาเสียบใส่ใหม่และลองอีกรอบ

source: Authenticator doesn't have resident key support
th: ตัวรับรองความถูกต้องไม่มีการรองรอบกุญแจถิ่นที่อยู่ (resident key)

source: Authenticator missing user verification
th: ตัวรับรองความถูกต้องไม่มีการยืนยันตัวตนผู้ใช้

source: Authenticator missing Large Blob support
th: ตัวรับรองความถูกต้องไม่มีการรับรอง Large Blob

source: No common algorithms
th: ไม่มีอัลกอริทึมที่พบเจอได้ง่าย

source: Storage Full
th: พื้นที่เต็ม

source: User consent denied
th: ได้ถูกปฏิเสธความยินยอมผู้ใช้

source: User Cancelled Request
th: ผู้ใช้ได้ยกเลิกคำขอ

source: Close
th: ปิด

source: Description
th: คำอธิบาย

source: Confirm PIN
th: ยืนยัน PIN
