Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-nm/plasmanetworkmanagement-libs.po
Languages: th

# network interface connected state label
source: Connected
th: เชื่อมต่อแล้ว

# network interface connected state label
source: Connected to %1
th: เชื่อมต่อไปยัง %1

# network interface disconnecting state label
source: Deactivating connection
th: กำลังถอนการเชื่อมต่อ

# network interface connection failed state label
source: Connection Failed
th: การเชื่อต่อล้มเหลว

# interface state
source: Error: Invalid state
th: ผิดพลาด: สถานะไม่ถูกต้อง

# The state of the VPN connection is unknown
source: Unknown
th: ไม่รู้จัก

# The VPN connection is preparing to connect
source: Preparing to connect
th: เตรียมที่จะเชื่อมต่อ

# The VPN connection needs authorization credentials
source: Needs authorization
th: ต้องการได้รับอนุญาตก่อน

# The VPN connection is being established
source: Connecting
th: กำลังเชื่อมต่อ

# The VPN connection is getting an IP address
source: Setting network address
th: กำลังตั้งที่อยู่เครือข่าย

# The VPN connection is active
source: Activated
th: เปิดใช้งานแล้ว

# The VPN connection failed
source: Failed
th: ล้มเหลว

# The VPN connection is disconnected
source: Failed
th: ล้มเหลว

# wireless network operation mode
source: Unknown
th: ไม่รู้จัก

# wireless network operation mode
source: Adhoc
th: เฉพาะกิจ

# wireless network operation mode
source: Infrastructure
th: โครงสร้างพื้นฐาน

# wireless network operation mode
source: Access point
th: แอกเซสพอยต์

# wireless network cipher
source: Group WEP40
th: กลุ่ม WEP40

# wireless network cipher
source: Group WEP104
th: กลุ่ม WEP104

# wireless network cipher
source: Group TKIP
th: กลุ่ม TKIP

# wireless network cipher
source: Group CCMP
th: กลุ่ม CCMP

# connection speed
source: %1 Bit/s
th: %1 บิต/วิ

# connection speed
source: %1 MBit/s
th: %1 เมบิต/วิ

# connection speed
source: %1 GBit/s
th: %1 กิบิต/วิ

# Gsm modes (2G/3G/any)
source: Any
th: อันไหนก็ได้

# Analog wireline modem
source: Analog
th: อนาล็อก

# Unknown cellular access technology
source: Unknown
th: ไม่รู้จัก

# Any cellular access technology
source: Any
th: อันไหนก็ได้

# possible SIM lock reason
source: Modem is unlocked.
th: โมเด็มถูกปลดล็อก

# possible SIM lock reason
source: SIM requires the PIN code.
th: SIM ต้องใช้รหัส PIN

# possible SIM lock reason
source: SIM requires the PIN2 code.
th: SIM ต้องใช้รหัส PIN2

# possible SIM lock reason
source: SIM requires the PUK code.
th: SIM ต้องใช้รหัส PUK

# possible SIM lock reason
source: SIM requires the PUK2 code.
th: SIM ต้องใช้รหัส PUK2

# possible SIM lock reason
source: Modem requires the service provider PIN code.
th: โมเด็มต้องใช้รหัส PIN ของผู้ให้บริการ

# possible SIM lock reason
source: Modem requires the service provider PUK code.
th: โมเด็มต้องใช้รหัส PUK ของผู้ให้บริการ

# possible SIM lock reason
source: Modem requires the network PIN code.
th: โมเด็มต้องใช้รหัส PIN เครือข่าย

# possible SIM lock reason
source: Modem requires the network PUK code.
th: โมเด็มต้องใช้รหัส PUK เครือข่าย

# possible SIM lock reason
source: Modem requires the PIN code.
th: โมเด็มต้องใช้รหัส PIN

# possible SIM lock reason
source: Modem requires the corporate PIN code.
th: โมเด็มต้องใช้รหัส PIN ของบริษัท

# possible SIM lock reason
source: Modem requires the corporate PUK code.
th: โมเด็มต้องใช้รหัส PUK ของบริษัท

# possible SIM lock reason
source: Modem requires the PH-FSIM PIN code.
th: โมเด็มต้องใช้รหัส PIN PH-FSIM

# possible SIM lock reason
source: Modem requires the PH-FSIM PUK code.
th: โมเด็มต้องใช้รหัส PUK PH-FSIM

# possible SIM lock reason
source: Modem requires the network subset PIN code.
th: โมเด็มต้องใช้รหัส PIN เครือข่ายรอง

# possible SIM lock reason
source: Modem requires the network subset PUK code.
th: โมเด็มต้องใช้รหัส PUK เครือข่ายรอง

# possible SIM lock reason
source: Lock reason unknown.
th: ไม่รู้สาเหตุที่ถูกล็อก

# @label no security
source: Insecure
th: ไม่ปลอดภัย

# @label WPA-PSK security
source: WPA-PSK
th: Dynamic WEP

# @label unknown security
source: Unknown security type
th: ไม่รู้จักความปลอดภัยชนิดนี้

source: Last used one minute ago
th: ใช้ไปก่อนหน้าเมื่อ %1 นาทีที่แล้ว

source: One minute ago
th: %1 นาทีที่แล้ว

source: Last used one hour ago
th: ใช้ไปก่อนหน้าเมื่อ %1 ชั่วโมงที่แล้ว

source: One hour ago
th: %1 ชั่วโมงที่แล้ว

# Label for last used time for a network connection used the previous day
source: Last used yesterday
th: ใช้ไปก่อนหน้าเมื่อวาน

# Label for last used time for a network connection used the previous day
source: Yesterday
th: เมื่อวาน

source: Last used on %1
th: ใช้ไปก่อนหน้าเมื่อ %1

# Label for last used time for a network connection that has never been used
source: Never used
th: ไม่เคยใช้

# Label for last used time for a network connection that has never been used
source: Never
th: ไม่เคยใช้

source: No VPN plugin found for type %1
th: ไม่พบปลั๊กอิน VPN สำหรับ %1

source: Importing this type of VPN is not implemented
th: ไม่รับรองการนำเข้า VPN ชนิดนี้

source: Not implemented
th: ไม่รับรอง

# @info:tooltip real user name is not available
source: Not Available
th: ไม่สามารถใช้งานได้

source: First select the SSID
th: เลือก SSID ก่อน

source: %1 (%2%) Frequency: %3 Mhz Channel: %4
th: %1 (%2%) ความถี่: %3 Mhz ช่อง: %4

# Header text for IPv4 route metric
source: Metric
th: เมตริก

# Header text for IPv6 route metric
source: Metric
th: เมตริก

# Mobile Connection Wizard
source: New Mobile Broadband Connection
th: การเชื่อมต่อบอร์ดแบนมือถือใหม่

# Mobile Connection Wizard
source: My plan is not listed…
th: แพ็กเกจไม่ได้อยู่ในรายการ…

# Mobile Connection Wizard
source: Unknown Provider
th: ผู้ให้บริการที่ไม่รู้จัก

# Mobile Connection Wizard
source: Default
th: ค่าเริ่มต้น

# Mobile Connection Wizard
source: Set up a Mobile Broadband Connection
th: เริ่มตั้งค่าการเชื่อมต่อบอร์ดแบนมือถือใหม่

# Mobile Connection Wizard
source: This assistant helps you easily set up a mobile broadband connection to a cellular (3G) network.
th: ตัวช่วยตัวนี้จะช่วยให้เริ่มการตั้งค่าการเชื่อมต่อบอร์ดแบนมือถือไปยังเครือข่ายเซลลูล่าร์ (3G)

# Mobile Connection Wizard
source: You will need the following information:
th: คุณต้องใช้ข้อมูลดังนี้:

# Mobile Connection Wizard
source: Your broadband provider's name
th: ชื่อผู้ให้บริการบร์อดแบน

# Mobile Connection Wizard
source: Your broadband billing plan name
th: ชื่อแพ็กเกจของคุณ

# Mobile Connection Wizard
source: (in some cases) Your broadband billing plan APN (Access Point Name)
th: (ในบางกรณี) ที่อยู่ APN ของแพ็กเกจบอร์ดแบน (Access Point Name)

# Mobile Connection Wizard
source: Create a connection for &this mobile broadband device:
th: สร้างการเชื่อมต่อสำหรับอุปกรณ์&บอร์ดแบนมือถือนี้

# Mobile Connection Wizard
source: Any GSM device
th: อุปกรณ์ GSM อันไหนก็ได้

# Mobile Connection Wizard
source: Any CDMA device
th: อุปกรณ์ CDMA อันไหนก็ได้

# Mobile Connection Wizard
source: Installed GSM device
th: อุปกรณ์ GSM ที่ติดตั้งไว้

# Mobile Connection Wizard
source: Installed CDMA device
th: อุปกรณ์ CDMA ที่ติดตั้งไว้

# Mobile Connection Wizard
source: Choose your Provider's Country
th: เลือกประเทศผู้ให้บริการ

# Mobile Connection Wizard
source: Country List:
th: รายการประเทศ:

# Mobile Connection Wizard
source: My country is not listed
th: ประเทศฉันไม่ได้อยู่ในนี้

# Mobile Connection Wizard
source: Choose your Provider
th: เลือกผู้ให้บริการของคุณ

# Mobile Connection Wizard
source: Select your provider from a &list:
th: เ&ลือกผู้ให้บริการของคุณจากรายการ:

# Mobile Connection Wizard
source: I cannot find my provider and I wish to enter it &manually:
th: ฉันไม่สามารถหาผู้ให้บริการของฉันได้ และฉันอยากจะตั้งค่าด้วย&ตนเอง:

# Mobile Connection Wizard
source: Choose your Billing Plan
th: เลือกแพ็กเกจของคุณ

# Mobile Connection Wizard
source: &Select your plan:
th: เลือก&แพ็กเกจของคุณ:

# Mobile Connection Wizard
source: Selected plan &APN (Access Point Name):
th: เลือกแพ็ก&เกจ APN (Access Point Name):

# Mobile Connection Wizard
source: Warning: Selecting an incorrect plan may result in billing issues for your broadband account or may prevent connectivity. If you are unsure of your plan please ask your provider for your plan's APN.
th: คำเตือน: ถ้าหากเลือกแพ็กเกจอาจทำให้มีปัญหากับการจ่ายเงินบัญชีบอร์ดแบนของคุณ หรืออาจทำให้เชื่อมต่อไม่ได้ ถ้าไม่แน่ใจให้ถามผู้ให้บริการบอร์ดแบนสำหรับ APN ของคุณ

# Mobile Connection Wizard
source: Confirm Mobile Broadband Settings
th: ยืนยันการตั้งค่าบอร์ดแบนมือถือ

# Mobile Connection Wizard
source: Your mobile broadband connection is configured with the following settings:
th: การตั้งค่าบอร์ดแบนมือถือของคุณได้ตั้งค่าไว้ดังนี้:

# Mobile Connection Wizard
source: Your Provider:
th: ผู้ให้บริการของคุณ:

# Mobile Connection Wizard
source: Your Plan:
th: แพ็กเกจของคุณ:

source: Change the visibility of the password
th: เปลี่ยนการมองเห็นของรหัสผ่าน

source: Store password for this user only (encrypted)
th: เก็บรหัสผ่านสำหรับผู้ใช้นี้่เท่านั้น (ถูกเข้ารหัส)

source: Store password for all users (not encrypted)
th: เก็บรหัสผ่านสำหรับผู้ใช้ทุกคน (ไม่ได้เข้ารหัส)

source: Ask for this password every time
th: ถามสำหรับรหัสผ่านนี้ตลอด

source: This password is not required
th: รหัสผ่านนี้ไม่จำเป็น

source: %1 (%2%) Security: %3 Frequency: %4 Mhz
th: %1 (%2%) ความปลอดภัย: %3 คลื่นความถี่: %4 Mhz

source: %1 (%2%) Security: Insecure Frequency: %3 Mhz
th: %1 (%2%) ความปลอดภัย: ไม่ปลอดภัย คลื่นความถี่: %3 Mhz

source: Available Users
th: ผู้ใช้ที่มี

source: Real Name
th: ชื่อจริง

# like in Username for athentication
source: Username
th: ชื่อผู้ใช้

source: Users allowed to activate the connection
th: ผู้ใช้ที่ถูกอนุญาตให้เปิดการเชื่อมต่อ

source: Edit IPv4 Routes
th: แก้ไขเส้นทาง IPv4

source: If enabled, this connection will never be used as the default network connection
th: ถ้าเปิดไว้อยู่ การเชื่อมต่อนี้จะไม่มีวันถูกใช้เป็นเครือข่ายค่าเริ่มต้น

source: Use only for resources on this connection
th: ใช้สำหรับทรัพยากรในการเชื่อมต่อนี้เท่านั้น

# Remove a selected row
source: Remove
th: ลบ

# Insert a row
source: Add
th: เพิ่ม

source: If enabled, automatically configured routes are ignored and only routes specified above are used
th: ถ้าหากเปิดอยู่ เส้นทางที่ถูกตั้งค่าโดยอัตโนมัติจะถูกละเว้นและใช้เส้นทางที่ถูกกำหนดไว้ข้างบน

source: Ignore automatically obtained routes
th: ละเว้นเส้นทางที่ได้รับโดยอัตโนมัติ

source: Edit IPv6 Routes
th: แก้ไขเส้นทาง IPv6

# Remove a selected row
source: R&emove
th: &ลบ

source: Plasma is missing support for '%1' VPN connections.
th: Plasma ขาดการรับรองการเชื่อมต่อ '%1' VPN

source: Report Bug
th: รายงานจุดบกพร่อง

source: NetworkManager is missing support for '%1' VPN connections.
th: NetworkManager ขาดการรับรองการเชื่อมต่อ '%1' VPN

source: Install
th: ติดตั้ง

source: Failed to activate %1
th: เปิดใช้งาน %1 ล้มเหลว

source: Failed to add connection %1
th: การเพิ่มการเชื่อมต่อ %1 ล้มเหลว

source: Connection %1 has been added
th: การเชื่อมต่อ %1 ได้ถูกเพิ่ม

source: Failed to add %1
th: การเพิ่ม %1 ล้มเหลว

source: Failed to deactivate %1
th: การปิด %1 ล้มเหลว

source: Failed to remove %1
th: การลบ %1 ล้มเหลว

source: Connection %1 has been removed
th: การเชื่อมต่อ %1 ได้ถูกลบแล้ว

source: Failed to update connection %1
th: การอัปเดตเการชื่อมต่อ %1 ล้มเหลว

source: Connection %1 has been updated
th: การเชื่อมต่อ %1 ได้ถูกอัปเดต

source: Failed to create hotspot %1
th: การสร้างฮอตสปอต %1 ล้มเหลว

source: Hardware based connections
th: การเชื่อมต่อแบบฮาร์ดแวร์

source: Some DSL description
th: คำอธิบาย DSL

source: Some infiniband description
th: คำอธิบาย infiniband

source: Mobile Broadband
th: บอร์ดแบนมือถือ

source: Some mobile broadband description
th: คำอธิบายเน็ตบรอดแบนด์มือถือ

source: Some wired ethernet description
th: คำอธิบายอีเทอร์เน็ต

source: Wired Ethernet (shared)
th: อีเทอร์เน็ตแบบสาย (ถูกแชร์)

source: Some wi-fi description
th: คำอธิบาย wi-fi

source: Wi-Fi (shared)
th: Wi-Fi (ถูกแชร์)

source: Virtual connections
th: การเชื่อมต่อเสมือนจริง

source: Some bond description
th: คำอธิบาย bond

source: Some team description
th: คำอธิบาย team

source: Some vlan description
th: คำอธิบาย vlan

source: VPN connections
th: การเชื่อมต่อ VPN

source: Import VPN connection…
th: นำเข้าการเชื่อมต่อ VPN...

source: Other
th: อื่น ๆ

source: Import a saved configuration file
th: นำเข้าไฟล์การตั้งค่าที่บันทึกไว้

# @info:tooltip
source: The connection type is Unknown
th: ชนิดของการเชื่อมต่อเป็นที่ไม่รู้จัก

# @info:tooltip
source: The connection type is ADSL
th: ชนิดของการเชื่อมต่อเป็น ADSL

# @info:tooltip
source: The connection type is Bluetooth
th: ชนิดของการเชื่อมต่อเป็นบลูทูธ

# @info:tooltip
source: The connection type is Bridge
th: ชนิดของการเชื่อมต่อเป็นแบบบริดจ์

# @info:tooltip
source: The connection type is CDMA
th: ชนิดของการเชื่อมต่อเป็น CDMA

# @info:tooltip
source: The connection type is GSM
th: ชนิดของการเชื่อมต่อเป็น GSM

# @info:tooltip
source: The connection type is Infiniband
th: ชนิดของการเชื่อมต่อเป็น Infiniband

# @info:tooltip
source: The connection type is OLPC Mesh
th: ชนิดของการเชื่อมต่อเป็น OLPC Mesh

# @info:tooltip
source: The connection type is PPOPE
th: ชนิดของการเชื่อมต่อเป็น VPN

# @info:tooltip
source: The connection type is VLAN
th: ชนิดของการเชื่อมต่อเป็น VLAN

# @info:tooltip
source: The connection type is VPN
th: ชนิดของการเชื่อมต่อเป็น VPN

# @info:tooltip
source: The connection type is Wimax
th: ชนิดของการเชื่อมต่อเป็น Wimax

# @info:tooltip
source: The connection type is Wired
th: ชนิดของการเชื่อมต่อเป็นต่อสาย

# @info:tooltip
source: The connection type is Wireless
th: ชนิดของการเชื่อมต่อเป็นไร้สาย

# @info:tooltip
source: The connection type is Team
th: ชนิดของการเชื่อมต่อเป็นทีม

# @info:tooltip
source: The connection type is Generic
th: ชนิดของการเชื่อมต่อเป็นสามัญ

# @info:tooltip
source: The connection type is Tunnel
th: ชนิดของการเชื่อมต่อเป็นทันเนล

# @info:tooltip
source: The connection type is IP Tunnel
th: ชนิดของการเชื่อมต่อเป็น IP ทันเนล

# @info:tooltip
source: The connection type is WireGuard
th: ชนิดของการเชื่อมต่อคือ WireGuard

source: IPv4 Address
th: ที่อยู่ IPv4

source: IPv4 Default Gateway
th: เกตเวย์ค่าเริ่มต้น IPv4

source: IPv4 Primary Nameserver
th: เนมเซิร์ฟเวอร์ IPv4 อันแรก

source: IPv4 Secondary Nameserver
th: เนมเซิร์ฟเวอร์ IPv4 อันที่สอง

source: IPv6 Address
th: ที่อยู่ IPv6

source: IPv6 ULA Address
th: ที่อยู่ ULA IPv6

source: IPv6 Default Gateway
th: เกตเวย์ค่าเริ่มต้น IPv6

source: IPv6 Primary Nameserver
th: เนมเซิร์ฟเวอร์ IPv6 อันแรก

source: IPv6 Secondary Nameserver
th: เนมเซิร์ฟเวอร์ IPv6 อันที่สอง

source: Connection speed
th: ความเร็วของการเชื่อมต่อ

source: MAC Address
th: ที่อยู่ MAC

source: Access Point (SSID)
th: แอกเซสพอยต์ (SSID)

source: Access point (SSID)
th: แอกเซสพอยต์ (SSID)

source: Signal Strength
th: ความแข็งแกร่งของสัญญาน

source: Signal strength
th: ความแข็งแกร่งของสัญญาน

source: Security Type
th: ชนิดความปลอดภัย

source: Security type
th: ชนิดความปลอดภัย

source: Connection Speed
th: ความเร็วการเชื่อมต่อ

source: Frequency
th: ความถี่

# Frequency (Channel)
source: %1 (Channel %2)
th: %1 (ช่อง %2)

source: Operator
th: ผู้ให้บริการ

source: Network ID
th: ID เครือข่าย

source: Signal Quality
th: คุณภาพสัญญาน

source: Access Technology
th: เทคโนโลยีในการเข้าถึง

source: VPN Plugin
th: ปลั๊กอิน VPN

source: VPN plugin
th: ปลั๊กอิน VPN

source: Banner
th: แบนเนอร์

source: Name
th: ชื่อ

source: Capabilities
th: ความสามารถ

source: Type
th: ชนิด

source: Vlan ID
th: ID วีแลน

source: Device
th: อุปกรณ์

# A network device is connected, but there is only link-local connectivity
source: Connected
th: เชื่อมต่อแล้ว

# A network device is connected, but there is only site-local connectivity
source: Connected
th: เชื่อมต่อแล้ว

# A network device is connected, with global network connectivity
source: Connected
th: เชื่อมต่อแล้ว

# Networking is inactive and all devices are disabled
source: Inactive
th: ไม่ใช้งาน

# There is no active network connection
source: Disconnected
th: ถอนการเชื่อมต่อแล้ว

# Network connections are being cleaned up
source: Disconnecting
th: กำลังถอนการเชื่อมต่อ

source: Connecting
th: กำลังเชื่อมต่อ

source: Connecting to %1
th: กำลังเชื่อมต่อไปยัง %1

source: Connected to %1 (no connectivity)
th: เชื่อมต่อไปยัง %1 (ไร้การเชื่อมต่อ)

source: Connected to %1 (limited connectivity)
th: เชื่อมต่อไปยัง %1 (การเชื่อมต่อถูกจำกัด)

source: Connected to %1 (log in required)
th: เชื่อมต่อไปยัง %1 (ต้องลงชื่อเข้าใช้)

source: Connected to %1
th: เชื่อมต่อไปยัง %1

source: NetworkManager not running
th: ไม่ได้เปิด NetworkManager

source: NetworkManager 0.9.8 required, found %1.
th: ต้องใช้ NetworkManager 0.9.8 ขึ้นไป แต่พบเจอ %1 แทน

# global connection state
source: Unknown
th: ไม่รู้จัก
