Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-nm/plasmanetworkmanagement-libs.po
Languages: th

# @title:tab General configuration
source: General
th: ทั่วไป

# General
source: General configuration
th: การตั้งค่าทั่วไป

source: Wired
th: แบบสาย

source: 802.1x Security
th: ความปลอดภัย 802.1x

source: Wi-Fi Security
th: ความปลอดภัย Wi-Fi

source: Mobile Broadband (%1)
th: บอร์ดแบนมือถือ (%1)

source: Bluetooth
th: บลูทูธ

source: Bridge
th: บริดจ์

source: Vlan
th: วีแลน

source: Team
th: ทีม

source: WireGuard Interface
th: อินเทอร์เฟซ WireGuard

source: Failed to get secrets for %1
th: ไม่สามารถรับรหัสลับสำหรับ %1 ได้

source: New Connection (%1)
th: การเชื่อมต่อใหม่ (%1)

source: Edit Connection '%1'
th: แก้ไขการเชื่อมต่อ '%1'

source: New %1 connection
th: การเชื่อต่อ %1 ใหม่

source: Connection name:
th: ชื่อการเชื่อมต่อ:

source: Ethernet
th: อีเทอร์เน็ต

# bond mode
source: Active backup
th: การสำรองข้อมูลเปิดใช้งานอยู่

# bond mode
source: Broadcast
th: บรอดแคสต์

# bond mode
source: Adaptive transmit load balancing
th: โหลดบาลานซ์การส่งผ่านแบบปรับตัว

# bond mode
source: Adaptive load balancing
th: โหลดบาลานซ์แบบปรับตัว

# bond link monitoring
source: MII (recommended)
th: MII (แนะนำ)

source: Do you want to remove the connection '%1'?
th: คุณอยากจะลบการเชื่อมต่อ '%1' หรือไม่?

source: Remove Connection
th: ลบการเชื่อมต่อ

source: VLAN
th: วีแลน

source: DUN (dial up networking)
th: DUN (ระบบเครือข่ายแบบไดล์อัป)

source: PAN (personal area network)
th: PAN (เครือข่ายพื้นที่ส่วนบุคคล)

# @title:window advanced permissions editor
source: Advanced Permissions Editor
th: ตัวแก้ไขสิทธิขั้นสูง

# infiniband transport mode
source: Datagram
th: เดตาแกรม

# infiniband transport mode
source: Connected
th: เชื่อมต่อแล้ว

# Header text for IPv4 address
source: Address
th: ที่อยู่

# Header text for IPv4 gateway
source: Gateway
th: เกตเวย์

source: Other DNS Servers:
th: เซิร์ฟเวอร์ DNS อื่น ๆ:

source: DNS Servers:
th: เซิร์ฟเวอร์ DNS:

source: <qt>You can find more information about these values here:<br/><a href='https://developer.gnome.org/NetworkManager/stable/ch01.html'>https://developer.gnome.org/NetworkManager/stable/ch01.htmlnm-settings-nmcli.html</a></qt>
th: <qt>คุณสามารถดูข้อมูลเพิ่มเติมได้ที่:<br/><a href='https://developer.gnome.org/NetworkManager/stable/ch01.html'>https://developer.gnome.org/NetworkManager/stable/ch01.htmlnm-settings-nmcli.html</a></qt>

source: Send hostname:
th: ส่งโฮสต์เนม:

source: DHCP hostname:
th: โฮสต์เนม DHCP:

source: Default
th: ค่าเริ่มต้น

source: Edit DNS servers
th: แก้ไขเซิร์ฟเวอร์ DNS

source: Edit DNS search domains
th: แก้ไขการค้นหาโดเมนเซิร์ฟเวอร์ DNS

# Header text for IPv6 address
source: Address
th: ที่อยู่

# Header text for IPv6 gateway
source: Gateway
th: เกตเวย์

source: Alternative Subject Matches
th: รายการที่ตรงกันอีก

source: <qt>This entry must be one of:<ul><li>DNS: &lt;name or ip address&gt;</li><li>EMAIL: &lt;email&gt;</li><li>URI: &lt;uri, e.g. https://www.kde.org&gt;</li></ul></qt>
th: <qt>ช่องนี้ต้องเป็น<ul><li>DNS: &lt;ชื่อ หรือ ที่อยู่ IP&gt;</li><li>EMAIL: &lt;email&gt;</li><li>URI: &lt;uri, เช่น https://www.kde.org&gt;</li></ul></qt>

source: Connect to these servers only
th: เชื่อมต่อไปยังเซิร์ฟเวอร์พวกนี้เท่านั้น

source: Select file to import
th: เลือกไฟล์ที่จะนำเข้า

source: Authentication:
th: การรับรองความถูกต้อง:

source: Tunneled TLS (TTLS)
th: TLS ที่ทันเนล

source: Protected EAP (PEAP)
th: EAP ที่ถูกปกป้อง (PEAP)

source: Username:
th: ชื่อผู้ใช้:

source: Password:
th: รหัสผ่าน:

source: Identity:
th: ตัวตน:

source: Domain:
th: โดเมน:

source: User certificate:
th: ใบรับรองผู้ใช้:

source: CA certificate:
th: ใบรับรอง CA:

source: Subject match:
th: รายการที่ตรงกัน:

source: Alternative subject matches:
th: รายการที่ตรงกันอีก:

source: Connect to these servers:
th: เชื่อต่อไปยังเซิร์ฟเวอร์พวกนี้:

source: Private key:
th: กุญแจส่วนตัว:

source: Private key password:
th: รหัสผ่านกุญแจส่วนตัว:

source: Anonymous identity:
th: ตัวตนที่ไม่ระบุตัวตน:

source: Automatic PAC provisioning
th: การจัดเตรียม PAC โดยอัตโนมัติ

source: Anonymous
th: ไม่ระบุตัวตน

source: Authenticated
th: ได้รับการรับรองความถูกต้องแล้ว

source: Both
th: ทั้งสอง

source: PAC file:
th: ไฟล์ PAC:

source: Inner authentication:
th: การรับรองความถูกต้องข้างใน:

source: PEAP version:
th: เวอร์ชัน PEAP:

# PEAP version
source: Automatic
th: อัตโนมัติ

source: Version 0
th: เวอร์ชัน 0

source: Version 1
th: เวอร์ชัน 1

source: Interface name:
th: ชื่ออินเทอร์เฟซ:

source: Bonded connections:
th: การเชื่อมต่อที่ผูกมัด:

source: Add…
th: เพิ่ม...

source: Edit…
th: แก้ไข...

source: Delete
th: ลบ

source: Mode:
th: โหมด:

source: Link monitoring:
th: การติดตามการลิงค์:

source: Monitoring frequency:
th: ความถี่การติดตาม:

source: Link up delay:
th: ความล่าช้าการ link up:

source: Link down delay:
th: ความล่าช้าการ link down:

source: ARP targets:
th: เป้าหมาย ARP:

source: An IP address or comma-separated list of addresses.
th: ที่อยู่ IP หรือรายการที่อยู่ที่แยกโดยเครื่องหมายจุลภาค

source: Bridged connections:
th: การเชื่อมต่อแบบบริดจ์:

source: Aging time:
th: เวลาแก่ลง:

# seconds
source: s
th: วิ

source: Enable STP (Spanning Tree Protocol)
th: เปิดใช้งาน STP (โพรโทคอล Spanning Tree)

source: Priority:
th: ลำดับความสำคัญ:

source: Forward delay:
th: ความล่าใช้ในการส่งต่อ:

source: Hello time:
th: เวลา Hello:

source: Max age:
th: อายุที่สูงสุด:

source: Address of the device:
th: ที่อยู่ของอุปกรณ์:

source: Connection type:
th: ชนิดการเชื่อมต่อ:

source: Number:
th: เลข:

source: Connect automatically with priority
th: เชื่อมต่อโดยอัตโนมัติไปก่อน

source: If the connection is set to autoconnect, connections with higher priority will be preferred. Defaults to 0. The higher number means higher priority. A negative number can be used to indicate priority lower than the default.
th: ถ้าการเชื่อมต่อได้ตั้งไว้เป็นการเชื่อมต่อแบบอัตโนมัติ การเชื่อมต่อจะเรียงตามลำดับความสำคัญ โดยค่าเริ่มต้นอยู่ที่ 0 ยิ่งสูงจะยิ่งสำคัญ แต่ถ้าหากเป็นตัวเลขติดลบหมายความว่ามีความสำคัญน้อยกว่าค่าเริ่มต้น

source: If the connection is set to autoconnect, connections with higher priority will be preferred. Defaults to 0. The higher number means higher priority. An negative number can be used to indicate priority lower than the default.
th: ถ้าการเชื่อมต่อได้ตั้งไว้เป็นการเชื่อมต่อแบบอัตโนมัติ การเชื่อมต่อจะเรียงตามลำดับความสำคัญ โดยค่าเริ่มต้นอยู่ที่ 0 ยิ่งสูงจะยิ่งสำคัญ แต่ถ้าหากเป็นตัวเลขติดลบหมายความว่ามีความสำคัญน้อยกว่าค่าเริ่มต้น

source: All users may connect to this network
th: ผู้ใช้ทุกคนสามารถเข้าสู่เครือข่ายนี้ได้

source: Edit advanced permissions for this connection
th: แก้ไขสิทธิขั้นสูงสำหรับการเชื่อมต่อนี้

source: Fine-grained permissions editor for this connection. It lets you choose which users can activate/modify/delete this connection.
th: ตัวแก้ไขสิทธิขั้นสูงที่อันเป็นเลิศสำหรับการเชื่อมต่อนี้ สามารถเลือกได้ว่าผู้ใช้ไหนสามารถ เปิด แก้ไข หรือลบการเชื่อมต่อนี้ได้

source: Advanced…
th: ขั้นสูง…

source: Automatically connect to VPN
th: เชื่อมต่อไปสู่ VPN อัตโนมัติ

source: Firewall zone:
th: โซน Firewall

source: Metered:
th: ถูกจำกัด:

source: NetworkManager indicates to applications whether the connection is metered and therefore data usage should be restricted.
th: NetworkManager จะบอกแอปพลิเคชันต่าง ๆ ว่าการเชื่อมต่อนี้ได้ถูกจำกัด และฉะนั้น ข้อมูลจะถูกจำกัด

# Item in the Metered: list
source: Automatic
th: อัตโนมัติ

source: Yes
th: ใช่

source: No
th: ไม่

source: Basic
th: พื้นฐาน

source: Advanced
th: ขั้นสูง

source: Allow roaming if home network is not available
th: อนุญาตการใช้โรมมิ่งถ้าไม่มีเครือข่ายถิ่น

source: Network ID:
th: ID เครือข่าย

source: Transport mode:
th: โหมด transport:

source: Restrict to device:
th: จำกัดให้กับอุปกรณ์:

# MTU:
source: Automatic
th: อัตโนมัติ

source: bytes
th: ไบต์

source: Advanced IP settings
th: การตั้งค่า IP ขั้นสูง

source: Method:
th: วิธีการ:

# Method:
source: Automatic
th: อัตโนมัติ

source: Automatic (Only addresses)
th: อัตโนมัติ (เฉพาะที่อยู่เท่านั้น)

# like in use Manual configuration
source: Manual
th: ทำเอง

source: Shared to other computers
th: แชร์ไปยังคอมพิวเตอร์เครื่องอื่น

# like in this setting is Disabled
source: Disabled
th: ถูกปิด

# @info
source: DNS Servers:
th: เซิร์ฟเวอร์ DNS:

source: Use this field to specify the IP address(es) of one or more DNS servers. Use ',' to separate entries.
th: ใช้ช่องนี้เพื่อที่จะกำหนดที่อยู่ IP ของเซิร์ฟเวอร์ DNS สามารถใช้เครื่องหมายจุลภาค ',' ในการแยกรายการได้หากมีหลายอัน

source: Edit DNS the list of servers
th: แก้ไขรายการเซิร์ฟเวอร์ DNS

# @info
source: Search Domains:
th: ค้นหาโดเมน

source: Use this field to specify one or more DNS domains to search. Use ',' to separate entries.
th: ใช้ช่องนี้เพื่อที่จะกำหนดโดเมน DNS ที่จะค้นหา สามารถใช้เครื่องหมายจุลภาค ',' ในการแยกรายการได้หากมีหลายอัน

source: Edit the list of DNS domains being searched
th: แก้ไขรายการโดเมน DNS ที่จะถูกค้นหา

source: Use this field to specify the DHCP client ID which is a string sent to the DHCP server to identify the local machine that the DHCP server may use to customize the DHCP lease and options.
th: ใช้ช่องนี้เพื่อที่จะกำหนด DHCP client ID ที่จะส่งไปยังเซิร์ฟเวอร์ DHCP เพื่อที่จะระบุตัวตนของเครื่อง เผื่อในกรณีที่เซิร์ฟเวอร์ DHCP อาจใช้เพื่อที่จะไปปรับแต่ง DHCP lease และตัวเลือกอื่น ๆ

source: Remove
th: ลบ

source: Add
th: เพิ่ม

source: IP addresses identify your computer on the network. Click the "Add" button to add an IP address
th: ที่อยู่ IP ระบุตัวตนของเครื่องคอมพิวเตอร์ของคุณบนเครือข่าย กดปุ่ม "เพิ่ม" เพิ่อที่จะเพิ่ม ที่อยู่ IP

source: Allows the connection to complete if IPv4 configuration fails but IPv6 configuration succeeds
th: อนุญาตให้การเชื่อมต่อได้เชื่อมต่ออย่างเสร็จสิ้น ในกรณีที่การตั้งค่า IPv4 ล้มเหลว แต่การตั้งค่า IPv6 บรรลุ

source: IPv4 is required for this connection
th: ต้องใช้ IPv6 ในการเชื่อมต่อนี้

source: Routes…
th: เส้นทาง...

source: When connecting to IPv4-capable networks, allows the connection to complete if IPv6 configuration fails but IPv4 configuration succeeds
th: เมื่อเชื่อมต่อไปยังเครือข่ายที่ใช้ IPv4 ได้ อนุญาตให้การเชื่อมต่อสำเร็จถ้า การเชื่อมต่อ IPv6 ล้มเหลว แต่ IPv4 บรรลุ

source: IPv6 is required for this connection
th: ต้องใช้ IPv6 ในการเชื่อมต่อนี้

source: Edit the list of DNS servers
th: แก้ไขรายการเซิร์ฟเวอร์ DNS

source: Configure IPv6 Privacy Extensions for SLAAC, described in RFC4941. If enabled, it makes the kernel generate a temporary IPv6 address in addition to the public one generated from MAC address via modified EUI-64.
th: ตั้งค่าส่วนขยาย IPv6 Privacy Extensions สำหรับ SLAAC ที่ถูกบรรยายไว้ใน RFC4941 ถ้าเปิดตัวเลือกนี้จะทำให้เคอร์เนลสร้าง ที่อยู่ IPv6 ชั่วคราวพร้อมกับ IPv6 สาธารณะที่ได้มาจากที่อยู่ MAC จากการเปลี่ยนแปลง EUI-64

# privacy disabled
source: Disabled
th: ถูกปิด

source: Enabled (prefer public address)
th: เปิด (เอาที่อยู่สาธารณะเป็นหลัก)

source: Enabled (prefer temporary addresses)
th: เปิด (เอาที่อยู่ชั่วคราวเป็นหลัก)

source: Automatic (Only DHCP)
th: อัตโนมัติ (DHCP เท่านั้น)

# like in this setting is Disabled
source: Ignored
th: ละเว้น

source: Disabled
th: ถูกปิด

source: Privacy:
th: ความเป็นส่วนตัว:

source: Authentication
th: การรับรองความถูกต้อง

source: Compression
th: การบีบอัด

source: Use point-to-point encryption (MPPE)
th: ใช้การเข้ารหัส point-to-point (MPPE)

source: Use BSD data compression
th: ใช้การบีบอัดข้อมูลแบบ BSD

source: Use Deflate data compression
th: ใช้การบีบอัดข้อมูลแบบ Deflate

source: Use TCP header compression
th: ใช้การบีบอัด TCP header

source: Require 128-bit encryption
th: บังคับใช้การเข้ารหัส 128-bit

source: Use stateful MPPE
th: ใช้การเข้ารหัส stateful MPPE

source: Send PPP echo packets
th: ส่งแพ็คเก็ต PPP echo

source: Service:
th: บริการ:

source: If specified, instruct PPPoE to only initiate sessions with access concentrators that provide the specified service. For most providers, this should be left blank. It is only required if there are multiple access concentrators or a specific service is known to be required.
th: ถ้าตั้งค่าไว้ จะเป็นการบอกให้ PPPoE เริ่มการเชื่อมต่อการเข้าถึงไปยัง concentrator ที่ให้บริการที่ระบุไว้เท่านั้น ถ้าเป็นผู้บริการส่วนใหญ่นั้นควรจะไม่ตั้งการตั้งค่านี้ ต้องใช้ในกรณีที่มีการเข้าถึง concentrator หลายครั้ง หรือต้องใช้บริการจำเพาะเท่านั้น

source: Teamed connections:
th: การเชื่อมต่อแบบทีม:

source: JSON config:
th: การตั้งค่า JSON:

source: Import configuration from file…
th: นำเข้าไฟล์การตั้งค่าที่บันทึกไว้…

source: Parent interface:
th: ชื่ออินเทอร์เฟซหลัก:

source: VLAN id:
th: ID วีแลน:

source: VLAN interface name:
th: ชื่ออินเทอร์เฟซวีแลน:

source: Output packet headers reordering
th: การเอาต์พุตการจัดเรียงใหม่ของ header แพกเก็ต

source: GARP VLAN Registration Protocol
th: โพรโทคอล GARP VLAN Registration

source: Loose binding
th: การผูกมัดแบบหลวม

source: Infrastructure
th: โครงสร้างพื้นฐาน

source: Ad-hoc
th: เฉพาะกิจ

source: Access Point
th: แอกเซสพอยต์

source: This option locks this connection to the Wi-Fi access point (AP) specified by the BSSID entered here. Example: 00:11:22:33:44:55
th: ตัวเลือกนี้ล๊อกการเชื่อมต่อนี้ไปยังแอกเซสพอยต์ Wi-Fi ที่กำหนดไว้โดย BBSID ที่ถูกใส่ที่นี้ เช่น 00:11:22:33:44:55

source: Band:
th: ความถี่

source: This option locks the connection to the Wi-Fi network associated to the specified band. This setting depends on specific driver capability and may not work with all drivers
th: ตัวเลือกนี้ล๊อกการเชื่อมต่อนี้ไปยังแอกเซสพอยต์ Wi-Fi ที่กำหนดไว้โดยคลื่นความถี่ ตัวเลือกนี้ขึ้นอยู่กับความสามารถของไดร์เวอร์และอาจจะไม่สามารถใช้งานได้กับไดร์เวอร์ทุกตัว

# Band:
source: Automatic
th: อัตโนมัติ

source: Channel:
th: ช่อง:

source: Wireless channel to use for the Wi-Fi connection. The device will only join (or create for Ad-Hoc networks) a Wi-Fi network on the specified channel
th: ช่องไร้สายที่จพใช้สำหรับการเชื่อมต่อ Wi-Fi อุปกรณ์จะเข้าร่วม (หรือสร้างสำหรับเครือข่ายเฉพาะกิจ) เครือข่าย Wi-Fi บนช่องที่ระบุไว้

source: Cloned MAC address:
th: ที่อยู่ MAC ที่โคลนมา:

source: Random…
th: สุ่ม...

source: Mark this if you want to create a connection for a hidden network
th: กดตรงนี้ถ้าหากท่านอยากสร้างการเชื่อมต่อสำหรับเครือข่ายที่ซ่อนอยู่

source: Visibility:
th: การมองเห็น:

source: Hidden network
th: เครือข่ายที่ซ่อนอยู่

source: Wifi Security
th: ความปลอดภัย Wi-Fi

# no security
source: None
th: ไม่มี

source: WEP key 40/128 bits (Hex or ASCII)
th: กุญแจ WEP 40/128 บิต (Hex หรือ ASCII)

source: WEP key 128 bits
th: กุญแจ WEP 128 บิต

source: WPA3 Enterprise 192-bit
th: WPA3 Enterprise 192 บิต

source: Security:
th: ความปลอดภัย:

source: Key:
th: กุญแจ:

source: WEP index:
th: รายการ WEP:

source: Open System
th: ระบบเปิด

source: Shared Key
th: กุญแจที่ถูกแชร์

source: This option locks this connection to the network device specified by its permanent MAC address entered here. Example: 00:11:22:33:44:55
th: ตัวเลือกนี้ล๊อกการเชื่อมต่อนี้ไปยังอุปกรณ์เครือข่ายที่กำหนดไว้ โดยใช้ที่อยู่ MAC ถาวรที่ถูกใส่ที่นี้ เช่น 00:11:22:33:44:55

source: The MAC address entered here will be used as hardware address for the network device this connection is activated on. This feature is known as MAC cloning or spoofing. Example 11:22:33:44:55
th: ที่อยู่ MAC ที่ถูกใส่จะถูกใช้เป็นที่อยู่ของฮาร์ตแวร์สำหรับอุปกรณ์เครือข่ายสำหรับารเชื่อมต่อนี้ คุณสมบัตินี้เรียกว่าการโคลนหรือการปลอมแปลง MAC เช่น 00:11:22:33:44:55

source: Random
th: สุ่ม

source: Only transmit packets of the specified size or smaller, breaking larger packets up into multiple Ethernet frames
th: ถ่ายโอนแพ็กเก็ตในขนาดที่กำหนดไว้หรือเล็กลงเท่านั้น โดยการแบ่งแพ็กเก็ตเป็นเฟรมอีเทอร์เน็ตหลายอัน

source: Speed:
th: ความเร็ว:

source: Duplex:
th: ดูเพล็กซ์:

source: Request that the device use the specified duplex mode. Either "half" or "full"
th: ขอให้อุปกรณ์ใช้โหมดดูเพล็กซ์ที่กำหนดไว้ มี "ครึ่ง" หรือ "เต็ม"

source: Half
th: ครึ่ง

source: Full
th: เต็ม

source: Link negotiation:
th: การเจรจาการลิงค์:

source: Device link negotiation. If “Manual” is chosen, “Speed” and “Duplex” values will be forced without checking the device compatibility. If unsure, leave here “Ignore” or pick “Automatic”.
th: การเจรจาอุปกรณ์ ถ้าหากเลือกตัวเลือก "ทำเอง" ค่า "ความเร็ว" และ "ดูเพล็กซ์" จะถูกใช้งานโดยไม่ตรวจสอบ ว่าอุปกรณ์รับรองไหม ถ้าไม่แน่ใจเลือก "ละเว้น" หรือ "อัตโนมัติ"

source: Ignore
th: ละเว้น

# Link negotiation:
source: Automatic
th: อัตโนมัติ

source: Manual
th: ทำเอง

source: Request that the device use only the specified speed.
th: ขอให้อุปกรณ์ใช้ความเร็วที่กำหนดไว้เท่านั้น

source: Use 802.1x security for this connection
th: ใช้ความปลอดภัย 802.1x สำหรับการเชื่อมต่อนี้

source: WireGuard Settings
th: การตั้งค่า WireGuard

source: Interface
th: อินเทอร์เฟซ

source: Required. Network interface name.
th: จำเป็น ชื่ออินเทอร์เฟซ

source: Required. A base64 private key generated by wg genkey.
th: จำเป็น กุญแจส่วนตัว base64 ที่ถูกสร้างโดย wg genkey

source: Listen port:
th: ฟังพอร์ต

source: Optional. Listen port number. Chosen randomly if left as 'Automatic'.
th: ไม่จำเป็น ฟังเลขพอร์ต จะถูกเลือกแบบสุ่มถ้าหากตั้งเป็นอัตโนมัติ

source: Optional. An fwmark for outgoing packets. If set to 0 or 'off', this option is disabled. May be specified in hexadecimal by prepending '0x'.
th: ไม่จำเป็น fwmark สำหรับแพ็กเก็ตขาออก ถ้าตั้งเป็น 0 หรือปิด ตัวเลือกนี้จะถูกปิด สามารถตั้งเป็นค่าเลขฐานสิบหกได้ โดยการใส่ '0x' ก่อนค่านั้น ๆ

source: Optional. If not specified, the MTU is automatically determined from the endpoint addresses or the system default route, which is usually a sane choice. However, to manually specify an MTU and to override this automatic discovery, this value may be specified explicitly.
th: ไม่จำเป็น ถ้าไม่ได้กรอก ค่า MTU จะถูกตั้งอัตโนมัติจากที่อยู่ปลายทาง หรือจากเส้นทางค่าเริ่มต้นของระบบ ซึ่งโดยปกติแล้วเป็น ค่าที่ถูกต้องอยู่แล้ว แต่ยังไงก็ตาม ถ้าหากจะตั้งค่านี้เอง และทำการปิดการตั้งค่าอัตโนมัติ ก็สามารถตั้งค่าได้

source: Autoroute peers:
th: เพียร์ autoroute:

source: Whether to automatically add routes for the AllowedIPs ranges of the peers.
th: จะเพิ่มเส้นทางโดยอัตโนมัติสำหรับช่วงระหว่าง IP ที่อนุญาต ของเพียร์

source: Peers…
th: เพียร์...

source: Public key:
th: กุญแจสาธารณะ:

source: Required. A base64 public key calculated by wg pubkey from a private key, and usually transmitted out of band to the author of the configuration file.
th: จำเป็น กุญแจสาธารณะที่ถูกคำนวนโดย wg pubkey ที่คำนวนมาจากกุญแจส่วนตัว และโดยปกติแล้ว ไม่ได้เกี่ยวข้องกับผู้เขียนของไฟล์การกำหนดค่า

source: Allowed IPs:
th: IP ที่อนุญาต:

source: Required. A comma-separated list of IP (v4 or v6) addresses with CIDR masks from which incoming traffic for this peer is allowed and to which outgoing traffic for this peer is directed. The catch-all 0.0.0.0/0 may be specified for matching all IPv4 addresses, and ::/0 may be specified for matching all IPv6 addresses.
th: จำเป็น รายการที่แยกโดยใช้เครื่องหมายจุลภาคของที่อยู่ IP (v4 หรือ v6) ที่มี CIDR masks จากการรับข้อมูลขาเข้าสำหรับเพียร์นี้ และกำหนดการส่งออกข้อมูลขาออก สามารถใช้ 0.0.0.0/0 ในการเลือกที่อยู่ IPv4 ทั้งหมด และ ::/0 ในการเลือก ที่อยู่ IPv6 ทั้งหมดได้เช่นกัน

source: Endpoint address:
th: ที่อยู่ปลายทาง:

source: Optional. An endpoint for the connection. Can be an IPv4 address, IPv6 address, or FQDN (fully qualified domain name such as abc.com). If present, Endpoint port must also be set.
th: ไม่จำเป็น ที่อยู่ปลายทางของการเชื่อมต่อ สามารถเป็น ที่อยู่ IPv4 ที่อยู่ IPv6 หรือ FQDN (ชื่อโดเมน ที่มีคุณสมบัติครบถ้วนเช่น abc.com) ถ้าพบ เจอ ต้องกำหนดค่าพอร์ตที่อยู่ปลายทางด้วย

source: Endpoint port:
th: พอร์ตที่อยู่ปลายทาง:

source: Optional. The port number of an endpoint. If present Endpoint Address must also be set.
th: ไม่บังคับ หมายเลขพอร์ตของปลายทาง ถ้ากรอกไว้ต้องกรอกค่า ที่อยู่ปลายทางด้วย

source: Preshared key:
th: กุญแจที่แลกเปลี่ยนล่วงหน้า:

source: Optional. A base64 preshared key generated by wg genpsk. This option adds an additional layer of symmetric-key cryptography to be mixed into the already existing public-key cryptography, for post-quantum resistance.
th: ไม่บังคับ ค่ากุญแจที่แลกเปลี่ยนล่วงหน้าที่เป็น base64 ที่ถูก สร้างโดย wg genpsk ตัวเลือกนี้เพิ่มความปลอดภัย แบบการเข้ารหัสแบบกุญแจสมมาตรอีกชั้นหนึ่ง สำหรับใช้เผื่อในโลกอนาคตที่มีเครื่องคณิตกรควอนตัม

source: Persistent keepalive:
th: การอยู่ต่อเนื่อง (keepalive):

source: Optional. A seconds interval, between 1 and 65535 inclusive, of how often to send an authenticated empty packet to the peer for the purpose of keeping a stateful firewall or NAT mapping valid persistently. For example, if the interface very rarely sends traffic, but it might at anytime receive traffic from a peer, and it is behind NAT, the interface might benefit from having a persistent keepalive interval of 25 seconds. If set to 0 or "off", this option is disabled. By default or when unspecified, this option is off. Most users will not need this.
th: ไม่จำเป็น ระยะห่างเวลาวินาทีระหว่าง 1 ถึง 65535 ที่จะส่งแพ็กเก็ตว่างเปล่า ที่ได้รับการรับรองไปยังเพียร์เพื่อที่จะใช้กับไฟวอลล์ stateful หรือ การ NAT mapping ให้คงอยู่ตลอด เช่น ถ้าอินเทอร์เฟซแทบไม่ได้ ส่งข้อมูลขาออก แต่อาจได้รับข้อมูลขาเข้าจากเพียร์อื่น และอยู่ใน NAT อินเทอร์เฟซอาจจะได้รับประโยชน์จากการมีเวลาการอยู่ต่อเนื่อง (keepalive) เป็นค่า 25 วินาที ถ้าหากตั้งเป็น 0 หรือ "ปิดใช้งาน" ตังเลือกนี้จะถูกปิดใช้งาน ถ้าหากเป็นค่าเริ่มต้นหรือไม่ได้ตั้งไว้ ตัวเลือกนี้จะปิดไว้ ผู้ใช้ส่วนใหญ่ไม่จำเป็นจะต้องใช้ตัวเลือกนี้

source: Peer 1
th: เพียร์ 1

source: Add new Peer
th: เพิ่มเพียร์ใหม่

source: Remove this Peer
th: ลบเพียร์นี้

# @title: window wireguard peers properties
source: WireGuard peers properties
th: คุณสมบัติเพียร์ WireGuard

# title of the interface widget in nm's popup
source: Bluetooth
th: บลูทูธ

# title of the interface widget in nm's popup
source: Virtual (bond)
th: จำลอง (Bond)

# title of the interface widget in nm's popup
source: Virtual (bridge)
th: จำลอง (บริดจ์)

# title of the interface widget in nm's popup
source: Virtual (vlan)
th: จำลอง (วีแลน)

# title of the interface widget in nm's popup
source: Virtual (team)
th: จำลอง (ทีม)

# title of the interface widget in nm's popup
source: Serial Modem
th: โมเด็มซีเรียล

# title of the interface widget in nm's popup
source: Mobile Broadband
th: บอร์ดแบนมือถือ

# title of the interface widget in nm's popup
source: Loopback
th: วนคืน

# title of the interface widget in nm's popup
source: Wired Ethernet
th: อีเทอร์เน็ตแบบสาย

source: Mobile broadband
th: บอร์ดแบนมือถือ

source: Olpc mesh
th: Olpc mesg

source: Wired Ethernet
th: อีเทอร์เน็ตแบบสาย

source: WireGuard VPN
th: VPN WireGuard

source: Loopback
th: วนคืน

source: Unknown connection type
th: ไม่ทราบชนิดการเชื่อมต่อ

source: Wireless Interface (%1)
th: อินเทอร์เฟซไร้สาย (%1)

source: Wired Interface (%1)
th: อินเทอร์เฟซแบบสาย (%1)

source: Bluetooth (%1)
th: บลูทูธ (%1)

source: Modem (%1)
th: โมเด็ม (%1)

source: VLan (%1)
th: วีแลน (%1)

source: Bridge (%1)
th: บริดจ์ (%1)

source: Loopback Interface (%1)
th: อินเทอร์เฟซวนคืน (%1)

# description of unknown network interface state
source: Unknown
th: ไม่รู้จัก

# description of unmanaged network interface state
source: Unmanaged
th: ไม่ได้จัดการ

# description of unavailable network interface state
source: Unavailable
th: ไม่สามารถใช้งานได้

# description of unconnected network interface state
source: Not connected
th: ไม่ได้เชื่อมต่อ

# description of preparing to connect network interface state
source: Preparing to connect
th: เตรียมที่จะเชื่อมต่อ

# description of configuring hardware network interface state
source: Configuring interface
th: กำลังตั้งค่าอินเทอร์เฟซ

# description of waiting for authentication network interface state
source: Waiting for authorization
th: กำลังรอการอนุญาต

# network interface doing dhcp request in most cases
source: Setting network address
th: กำลังตั้งที่อยู่เครือข่าย

# is other action required to fully connect? captive portals, etc.
source: Checking further connectivity
th: กำลังตรวจสอบการเชื่อมต่อเพิ่มเติม

# a secondary connection (e.g. VPN) has to be activated first to continue
source: Waiting for a secondary connection
th: กำลังรอการเชื่อมต่อครั้งที่สอง
