Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-nm/plasma-nm._desktop_.po
Languages: th

# Name
source: Network Management
th: การจัดการเครือข่าย

# Comment
source: Network management
th: การจัดการเครือข่าย

# Name
source: Connection Activated
th: ได้เปิดการเชื่อมต่อ

# Name
source: Connection Deactivated
th: การเชื่อมต่อถูกปิด

# Name
source: Connection Added
th: การเชื่อมต่อถูกเพิ่ม

# Name
source: Connection Removed
th: การเชื่อมต่อถูกลบ

# Name
source: Connection Updated
th: การเชื่อมต่อถูกอัปเดต

# Name
source: Device Failed
th: อุปกรณ์ล้มเหลว

# Name
source: Failed to Activate Connection
th: การเปิดการเชื่อมต่อล้มเหลว

# Name
source: Failed to Add Connection
th: การเชื่อมต่อล้มเหลว

# Name
source: Failed to Deactivate Connection
th: การปิดการเชื่อมต่อล้มเหลว

# Name
source: Failed to Remove Connection
th: การลบการเชื่อมต่อล้มเหลว

# Name
source: Failed to Get Secrets
th: การกู้รหัสลับล้มเหลว

# Name
source: Failed to Update Connection
th: การอัปเดตการเชื่อมต่อล้มเหลว

# Name
source: Missing VPN Plugin
th: ปลั๊กอิน VPN ขาดหาย

# Name
source: No Longer Connected to a Network
th: ไม่ได้เชื่อมต่อเครือข่ายอีกต่อไป

# Name
source: Captive Portal Detected
th: พบเจอ Captive Portal

# Name
source: Limited Connectivity
th: การเชื่อมต่อจำกัด

# Name
source: Failed to Create Hotspot
th: การสร้างฮ๊อตสปอตล้มเหลว

# Name
source: VPN Importer
th: ตัวนำเข้า VPN
