Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-nm/plasma-nm._json_.po
Languages: th

# X-KDE-Keywords
source: network,internet,ethernet,wireless,wifi,wlan,vpn
th: เครือข่าย,อินเทอร์เน็ต,อีเทอร์เน็ต,ไร้สาย,wifi,wlan,vpn

# Name
source: Networks
th: เครือข่าย

# Description
source: Network status and control
th: สถานะและการควบคุมเครือข่าย

# X-KDE-Keywords
source: mobile,data,network
th: มือถือ,ข้อมูล,เครือข่าย

# Name
source: Cellular Network
th: เครือข่ายเซลลูล่าร์

# Description
source: Management of cellular networks
th: การจัดการเครือข่ายเซลลูล่าร์

# X-KDE-Keywords
source: networks,wifi,wi-fi,ethernet,mobile,cdma,gsm,lte,wimax,apn,carrier,2g,3g,4g,5g,5ge,broadband,internet,traffic,connections,websites,web,DSL,infiniband,wired,wireless,bssid,ipv4,ipv6,mac address,ip,access point,dns,gateway,wep,leap,wpa,wpa2,wpa3,dhcp,shared network,private network,public network,vpn,openvpn,wireguard,fortinet,juniper,l2tp,pptp,sstp,ssh,iodine,ipsec,anyconnect,openconnect
th: เครือข่าย,wifi,wi-fi,อีเทอร์เน็ต,มือถือ,cdma,gsm,lte,wimax,apn,ผู้ให้บริการ,2g,3g,4g,5g,5ge,บรอดแบนด์,อินเทอร์เน็ต,traffic,การเชื่อมต่อ,เว็บไซต์,เว็บ,DSL,infiniband,สาย,ไร้สาย,bssid,ipv4,ipv6,ที่อยู่ mac,ip,แอกเซสพอยต์,dns,gateway,wep,leap,wpa,wpa2,wpa3,dhcp,เครือข่ายที่ถูกแชร์,เครือข่ายส่วนตัว,เครือข่ายสาธารณะ,vpn,openvpn,wireguard,fortinet,juniper,l2tp,pptp,sstp,ssh,iodine,ipsec,anyconnect,openconnect

# Name
source: Wi-Fi & Networking
th: Wi-Fi & เครือข่าย

# Description
source: Edit network connections
th: แก้ไขการเชื่อมต่อเครือข่าย

# Name
source: Hotspot
th: ฮ๊อตสปอต

# Description
source: Wi-Fi Hotspot
th: ฮ๊อตสปอต Wi-Fi

# X-KDE-Keywords
source: wifi,network
th: wifi,เครือข่าย

# Description
source: Wireless network setting
th: การตั้งค่าเครือข่ายไร้สาย

# Name
source: Plasma Network Management module
th: ฮ๊อตสปอต Plasma Network Management

# Description
source: Provides secrets to the NetworkManager daemon
th: จัดเตรียมรหัสลับให้

# Description
source: Fortinet SSLVPN virtual private networks
th: เครือข่ายส่วนตัวเสมือน Fortinet SSLVPN

# Name
source: Iodine DNS tunnel (iodine)
th: ทันเนล Iodine DNS (iodine)

# Description
source: Tunnel connections via DNS
th: การเชื่อมต่อทันเนลผ่าน DNS

# Name
source: Layer 2 Tunneling Protocol (L2TP)
th: โพรโทคอลทันเนลเลเยอร์ที่ 2 (L2TP)

# Description
source: Compatible with L2TP VPN servers
th: เข้ากันได้กับเซิร์ฟเวอร์ L2TP VPN

# Name
source: IPsec based VPN (libreswan)
th: VPN ที่ใช้ IPsec (libreswan)

# Name
source: Cisco AnyConnect Compatible VPN (openconnect)
th: VPN ที่เข้ากันได้กับ Cisco AnyConnect (openconnect)

# Description
source: Compatible with Cisco AnyConnect SSL VPN
th: เข้ากันได้กับ Cisco AnyConnect SSL VPN

# Name
source: Array Networks Compatible VPN (openconnect)
th: VPN ที่เข้ากันได้กับ Array Networks (openconnect)

# Description
source: Compatible with Array Networks SSL VPN
th: เข้ากันได้กับ Array Networks SSL VPN

# Name
source: F5 BIG-IP Compatible VPN (openconnect)
th: VPN ที่เข้ากันได้กับ F5 BIG-IP (openconnect)

# Description
source: Compatible with F5 BIG-IP SSL VPN
th: เข้ากันได้กับ F5 BIG-IP SSL VPN

# Name
source: Fortinet Compatible VPN (openconnect)
th: VPN ที่เข้ากันได้กับ Fortinet (openconnect)

# Description
source: Compatible with Fortinet VPN
th: เข้ากันได้กับ Fortinet VPN

# Description
source: Compatible with PAN GlobalProtect SSL VPN
th: เข้ากันได้กับ PAN GlobalProtect SSL VPN

# Description
source: Compatible with Juniper Network Connect
th: เข้ากันได้กับ Juniper Network Connect

# Description
source: Compatible with Pulse Connect Secure SSL VPN
th: เข้ากันได้กับ Pulse Connect Secure SSL VPN

# Description
source: Compatible with the OpenVPN server
th: เข้ากันได้กับเซิร์ฟเวอร์ OpenVPN

# Name
source: Point-to-Point Tunneling Protocol (PPTP)
th: โพรโทคอล Point-to-Point Tunneling

# Description
source: Compatible with Microsoft and other PPTP VPN servers
th: เข้ากันได้กับ Microsoft และเซิร์ฟเวอร์ PPTP VPN อื่น ๆ

# Description
source: Compatible with the SSH server
th: เข้ากันได้กับเซิร์ฟเวอร์ SSH

# Name
source: Secure Socket Tunneling Protocol (SSTP)
th: โพรโทคอล Secure Socket Tunneling (SSTP)

# Description
source: Compatible with Microsoft and other SSTP VPN servers
th: เข้ากันได้กับ Microsoft และเซิร์ฟเวอร์ SSTP VPN อื่น ๆ

# Name
source: Cisco Compatible VPN (vpnc)
th: VPN เข้ากันได้กับ Cisco (vpnc)

# Description
source: Compatible with various Cisco, Juniper, Netscreen and Sonicwall IPsec-based VPN gateways
th: เข้ากันได้กับเกตเวย์ที่ใช้ IPsec VPN อย่าง Cisco Juniper Netscreen และ Sonicwall

# Name
source: Connections
th: การเชื่อมต่อ

# Description
source: Edit your Network Connections
th: แก้ไขการเชื่อมต่อเครือข่ายของคุณ
