Repository: Xerusion/kde-l10n-th
Catalog: messages/plasma-nm/plasmanetworkmanagement-kded.po
Languages: th

source: Only 'dun' and 'nap' services are supported.
th: รับรองแค่บริการ 'dun' และ 'nap'

source: Network authentication
th: การรับรองความถูกต้องเครือข่าย

source: You need to log into this network
th: คุณต้องลงชื่อเข้าใช้เครือข่ายนี้

source: Log in
th: ลงชื่อเข้าใช้

source: Limited Connectivity
th: การเชื่อมต่อถูกจำกัด

source: This device appears to be connected to a network but is unable to reach the Internet.
th: อุปกรณ์นี้เชื่อมต่อเครือข่ายแล้ว แต่ไม่สามารถเข้าถึงอินเทอร์เน็ตได้

source: This device appears to be connected to a network but is unable to reach the internet.
th: อุปกรณ์นี้เชื่อมต่อเครือข่ายแล้ว แต่ไม่สามารถเข้าถึงอินเทอร์เน็ตได้

# Text in GSM PIN/PUK unlock error dialog
source: Error unlocking modem: %1
th: การปลดล็อกโมเด็มล้มเหลว: %1

# Title for GSM PIN/PUK unlock error dialog
source: PIN/PUK unlock error
th: การปลดล็อก PIN/PUK ผิดพลาด

# @info:status Notification when the device failed due to ConfigFailedReason
source: The device could not be configured
th: อุปกรณ์ไม่สามารถตั้งค่าได้

# @info:status Notification when the device failed due to ConfigUnavailableReason
source: IP configuration was unavailable
th: การตั้งค่า IP ไม่พร้อมใช้งาน

# @info:status Notification when the device failed due to ConfigExpiredReason
source: IP configuration expired
th: การตั้งค่า IP หมดอายุ

# @info:status Notification when the device failed due to NoSecretsReason
source: No secrets were provided
th: ไม่มีรหัสลับให้มา

source: Authorization supplicant disconnected
th: โปรแกรมขออนุญาตได้ถอนการเชื่อมต่อ

source: Authorization supplicant's configuration failed
th: การตั้งค่าโปรแกรมขออนุญาตล้มเหลว

source: Authorization supplicant failed
th: โปรแกรมขออนุญาตล้มเหลว

source: Authorization supplicant timed out
th: โปรแกรมขออนุญาตหมดเวลา

# @info:status Notification when the device failed due to PppStartFailedReason
source: PPP failed to start
th: การเริ่ม PPP ล้มเหลว

# @info:status Notification when the device failed due to PppDisconnectReason
source: PPP disconnected
th: PPP ตัดการเชื่อมต่อ

# @info:status Notification when the device failed due to PppFailedReason
source: PPP failed
th: PPP ล้มเหลว

# @info:status Notification when the device failed due to DhcpStartFailedReason
source: DHCP failed to start
th: การเริ่ม DHCP ล้มเหลว

# @info:status Notification when the device failed due to DhcpErrorReason
source: A DHCP error occurred
th: เกิดข้อผิดพลาด DHCP ขึ้น

# @info:status Notification when the device failed due to DhcpFailedReason
source: DHCP failed
th: DHCP ล้มเหลว

# @info:status Notification when the device failed due to SharedStartFailedReason
source: The shared service failed to start
th: การเริ่มบริการที่ถูกแชร์ล้มเหลว

# @info:status Notification when the device failed due to SharedFailedReason
source: The shared service failed
th: บริการที่ถูกแชร์ล้มเหลว

# @info:status Notification when the device failed due to AutoIpStartFailedReason
source: The auto IP service failed to start
th: การเริ่มบริการ IP อัตโนมัติล้มเหลว

# @info:status Notification when the device failed due to AutoIpErrorReason
source: The auto IP service reported an error
th: บริการ IP อัตโนมัติรายงานข้อผิดพลาด

# @info:status Notification when the device failed due to AutoIpFailedReason
source: The auto IP service failed
th: บริการ IP อัตโนมัติรายงานล้มเหลว

# @info:status Notification when the device failed due to ModemBusyReason
source: The modem is busy
th: โมเด็มไม่ว่าง

# @info:status Notification when the device failed due to ModemNoDialToneReason
source: The modem has no dial tone
th: โมเด็มไม่มีเสียงโทรเข้า

# @info:status Notification when the device failed due to ModemNoCarrierReason
source: The modem shows no carrier
th: โมเด็มไม่มีผู้ให้บริการ

# @info:status Notification when the device failed due to ModemDialTimeoutReason
source: The modem dial timed out
th: การโทรโมเด็มหมดเวลา

# @info:status Notification when the device failed due to ModemDialFailedReason
source: The modem dial failed
th: การโทรโมเด็มล้มเหลว

# @info:status Notification when the device failed due to ModemInitFailedReason
source: The modem could not be initialized
th: ไม่สามารถเตรียมการทำงานของโมเด็มได้

# @info:status Notification when the device failed due to GsmApnSelectFailedReason
source: The GSM APN could not be selected
th: ไม่สามารถเลือก GSM APN ได้

# @info:status Notification when the device failed due to GsmNotSearchingReason
source: The GSM modem is not searching
th: โมเด็ม GSM ไม่ค้นหาให้

source: GSM network registration was denied
th: การลงทะเบียนเครือข่าย GSM ได้ถูกปฏิเสธ

source: GSM network registration timed out
th: การลงทะเบียนเครือข่าย GSM ได้หมดเวลา

source: GSM registration failed
th: การลงทะเบียนเครือข่าย GSM ล้มเหลว

# @info:status Notification when the device failed due to GsmPinCheckFailedReason
source: The GSM PIN check failed
th: การตรวจสอบ PIN GSM ล้มเหลว

# @info:status Notification when the device failed due to FirmwareMissingReason
source: Device firmware is missing
th: เฟิร์มแวร์อุปกรณ์ขาดหาย

# @info:status Notification when the device failed due to DeviceRemovedReason
source: The device was removed
th: อุปกรณ์ได้ถูกดึงออก

# @info:status Notification when the device failed due to SleepingReason
source: The networking system is now sleeping
th: ระบบเครือข่ายกำลังถูกพักอยู่

# @info:status Notification when the device failed due to ConnectionRemovedReason
source: The connection was removed
th: การเชื่อมต่อถูกลบ

# @info:status Notification when the device failed due to CarrierReason
source: The cable was disconnected
th: สายถูกถอดออก

# @info:status Notification when the device failed due to ModemNotFoundReason
source: The modem could not be found
th: ไม่สามารถหาโมเด็มได้

# @info:status Notification when the device failed due to SsidNotFound
source: The WiFi network could not be found
th: ไม่พบเจอเครือข่าย WiFi

# @info:status Notification when the device failed due to BluetoothFailedReason
source: The bluetooth connection failed or timed out
th: การเชื่อมต่อบลูทูธล้มเหลวหรือหมดเวลา

# @info:status Notification when the device failed due to GsmSimNotInserted
source: GSM Modem's SIM Card not inserted
th: ไม่ได้ใส่ SIM การ์ดของโมเด็ม GSM

# @info:status Notification when the device failed due to GsmSimPinRequired
source: GSM Modem's SIM Pin required
th: ต้องใช้ PIN SIM การ์ดของโมเด็ม GSM

# @info:status Notification when the device failed due to GsmSimPukRequired
source: GSM Modem's SIM Puk required
th: ต้องใช้ PUK SIM การ์ดของโมเด็ม GSM

# @info:status Notification when the device failed due to GsmSimWrong
source: GSM Modem's SIM wrong
th: SIM การ์ดของโมเด็ม GSM ผิด

# @info:status Notification when the device failed due to InfiniBandMode
source: InfiniBand device does not support connected mode
th: อุปกรณ์ InfiniBand ไม่รับรองโหมดที่ถูกเชื่อมต่อ

# @info:status Notification when the device failed due to DependencyFailed
source: A dependency of the connection failed
th: การพึงพาการเชื่อมต่อล้มเหลว

# @info:status Notification when the device failed due to Br2684Failed
source: Problem with the RFC 2684 Ethernet over ADSL bridge
th: พบปัญหากับอีเทอร์เน็ต RFC 2684 ผ่านบริดจ์ ADSL

# @info:status Notification when the device failed due to ModemManagerUnavailable
source: ModemManager not running
th: ModemManager ยังไม่ทำงาน

source: A secondary connection of the base connection failed
th: การเชื่อมต่ออันที่สองของฐานการเชื่อมต่อล้มเหลว

# @info:status Notification when the device failed due to DcbFcoeFailed
source: DCB or FCoE setup failed
th: การตั้งค่า DCB หรือ FCoE ล้มเหลว

# @info:status Notification when the device failed due to TeamdControlFailed
source: teamd control failed
th: การควบคุม teamd ล้มเหลว

# @info:status Notification when the device failed due to ModemFailed
source: Modem failed or no longer available
th: โมเด็มล้มเหลวหรือไม่พร้อมใช้งาน

# @info:status Notification when the device failed due to ModemAvailable
source: Modem now ready and available
th: โมเด็มพร้อมใช้งาน

# @info:status Notification when the device failed due to SimPinIncorrect
source: The SIM PIN was incorrect
th: รหัสผ่าน SIM PIN ไม่ถูกต้อง

# @info:status Notification when the device failed due to NewActivation
source: A new connection activation was enqueued
th: การเปิดการเชื่อมต่อใหม่ได้เข้าคิว

# @info:status Notification when the device failed due to ParentChanged
source: The device's parent changed
th: อุปกรณ์หลักได้ถูกเปลี่ยน

# @info:status Notification when the device failed due to ParentManagedChanged
source: The device parent's management changed
th: การจัดการอุปกรณ์หลักได้ถูกเปลี่ยน

source: Connection '%1' activated.
th: ได้เปิดการเชื่อมต่อ '%1'

source: Connection '%1' deactivated.
th: การเชื่อมต่อ '%1' ถูกปิด

source: VPN connection '%1' activated.
th: ได้เปิดการเชื่อมต่อ VPN '%1'

source: VPN connection '%1' failed to activate.
th: การเปิดการเชื่อมต่อ VPN '%1' ล้มเหลว

source: VPN connection '%1' deactivated.
th: การเชื่อมต่อ VPN '%1' ถูกปิด

source: VPN connection '%1' was deactivated because the device it was using was disconnected.
th: การเชื่อมต่อ VPN '%1' ถูกปิดเพราะว่าอุปกรณ์ที่ถูกใช้งานโดย VPN ได้ตัดการเชื่อมต่อ

source: The service providing the VPN connection '%1' was stopped.
th: บริการที่ให้บริการการเชื่อมต่อ VPN '%1' ได้หยุด

source: The IP config of the VPN connection '%1', was invalid.
th: การตั้งค่า IP สำหรับการเชื่อมต่อ VPN '%1' ไม่ถูกต้อง

source: The connection attempt to the VPN service timed out.
th: การลองการเชื่อมต่อไปยังบริการ VPN หมดเวลา

source: A timeout occurred while starting the service providing the VPN connection '%1'.
th: หมดเวลาการเริ่ิมให้บริการการเชื่อมต่อ VPN '%1'

source: Starting the service providing the VPN connection '%1' failed.
th: การเริ่มต้นให้บริการการเชื่อมต่อ VPN '%1' ล้มเหลว

source: Necessary secrets for the VPN connection '%1' were not provided.
th: ขาดรหัสลับที่จำเป็นต้องใช้สำหรับการเชื่อมต่อ VPN '%1'

source: Authentication to the VPN server failed.
th: การรับรองความถูกต้องไปยังเซิร์ฟเวอร์ VPN ล้มเหลว

source: The connection was deleted.
th: การเชื่อมต่อได้ถูกลบ

source: No Network Connection
th: ไม่มีการเชื่อมต่อเครือข่าย

source: You are no longer connected to a network.
th: คุณไม่ได้เชื่อมต่อเครือข่ายอีกต่อไป

source: Authenticate %1
th: ตรวจสอบสิทธิเข้าใช %1

# @info:status 'secrets' means the authentication needed for a VPN
source: No secrets were requested
th: ไม่มีรหัสลับที่ถูกขอ

source: Incorrect password for the wireless network "%1". Please try again.
th: รหัสผ่านผิดสำหรับเครือข่ายไร้สาย "%1" กรุณาลองอีกครั้ง

source: Enter the password for the wireless network "%1":
th: ป้อนรหัสผ่านสำหรับเครือข่ายไร้สาย "%1":

source: Provide the password for the wireless network '%1':
th: ใส่รหัสผ่านสำหรับเครือข่ายไร้สาย "%1":

source: Incorrect password for the connection "%1". Please try again.
th: รหัสผ่านไม่ถูกต้องสำหรับการเชื่อมต่อ "%1" โปรดลองใหม่อีกครั้ง

source: Enter the password for the connection "%1":
th: ป้อนรหัสผ่านสำหรับเครือข่าย "%1":

source: Provide the password for the connection '%1':
th: ใส่รหัสผ่านสำหรับเครือข่าย "%1":

source: %1 password dialog
th: กล่องรหัสผ่าน %1

# @info:status
source: VPN settings are missing
th: การตั้งค่า VPN ขาดหาย

source: Provide the secrets for the VPN connection "%1":
th: ใส่รหัสผ่านลับสำหรับเครือข่าย VPN "%1":

source: Provide the secrets for the VPN connection '%1':
th: ใส่รหัสผ่านลับสำหรับเครือข่าย VPN '%1':

source: VPN secrets (%1) dialog
th: กล่องรหัสลับ VPN %1

source: Password dialog
th: กล่องรหัสผ่าน

source: Password:
th: รหัสผ่าน:

source: Service provider PUK
th: PUK ผู้ให้บริการ

source: Network PUK
th: PUK เครือข่าย

source: Corporate PUK
th: PUK องค์กร

source: Network Subset PUK
th: PUK เครือข่ายย่อย

source: %1 unlock required
th: ต้องปลดล็อก %1

source: %1 Unlock Required
th: ต้องปลดล็อก %1

source: The mobile broadband device '%1' requires a %2 code before it can be used.
th: อุปกรณ์บอร์ดแบนมือถือ '%1' ต้องใช้รหัส %2 ก่อนที่จะสามารถใช้งานได้

source: %1 code:
th: รหัส %1:

source: New PIN code:
th: รหัส PIN ใหม่:

source: Re-enter new PIN code:
th: ใส่รหัส PIN อีกครั้่ง:

source: Show PIN/PUK code
th: แสดงรหัส PIN/PUK

source: Service provider PIN
th: PIN ผู้บริการ

source: Network PIN
th: PIN เครือข่าย

source: Corporate PIN
th: PIN องค์กร

source: Network Subset PIN
th: PIN เครือข่ายย่อย

source: Show PIN code
th: แสดงรหัส PIN

source: PIN code too short. It should be at least 4 digits.
th: รหัส PIN สั้นเกินไป ต้องอย่างมรน้อย 4 ตัวเลข

source: The two PIN codes do not match
th: รหัส PIN ไม่ตรงกัน

source: PUK code too short. It should be 8 digits.
th: รหัส PUK สั้นไป ควรจะเป็นเลข 8 ตัว

source: Unknown Error
th: ข้อผิดพลาดไม่รู้จัก

source: SIM PIN unlock required
th: ต้องใช้ PIN ปลดล็อก

source: The mobile broadband device '%1' requires a SIM PIN code before it can be used.
th: อุปกรณ์บอร์ดแบนมือถือ '%1' ต้องใช้รหัส SIM PIN ก่อนที่จะสามารถใช้งานได้

source: PUK code:
th: รหัส PUK:

source: Re-enter PIN code:
th: ใส่รหัส PIN ใหม่:

source: Authentication to %1 failed. Wrong password?
th: การรับรองความถูกต้องไปยัง %1 ล้มเหลว รหัสผิดหรือเปล่า?
