Repository: Xerusion/kde-l10n-th
Catalog: messages/ark/ark._json_.po
Languages: th

# Name
source: Ark Extract Here
th: Ark แตกไฟล์ตรงนี้

# Name
source: 'Compress' service menu
th: เมนูบริการ 'บีบอัด'

# Name
source: 'Extract' service menu
th: เมนูบริการ 'แตกไฟล์'

# Name
source: Archiver
th: ตัวสร้างไฟล์อาร์ไคฟ์

# Description
source: Archive Handling Tool
th: เครื่องมือการจัดการไฟล์อาร์ไคฟ์

# Name
source: 7z plugin
th: ปลั๊กอิน 7z

# Description
source: Full support for the zip and 7z archive formats
th: การสนับสนุนเต็มรูปแบบของไฟล์อาร์ไคฟ์ฟอร์แมท zip และ 7z

# Name
source: ARJ plugin
th: ปลั๊กอิน ARJ

# Description
source: Full support for the ARJ archive formats
th: การสนับสนุนเต็มรูปแบบของไฟล์อาร์ไคฟ์ฟอร์แมท ARJ

# Name
source: RAR plugin
th: ปลั๊กอิน RAR

# Description
source: Full support for the RAR archive format
th: การสนับสนุนเต็มรูปแบบของไฟล์อาร์ไคฟ์ฟอร์แมท RAR

# Name
source: The Unarchiver plugin
th: ปลั๊กอิน Unarchiver

# Description
source: Open and extract RAR and LHA archives
th: เปิดและแตกไฟล์อาร์ไคฟ์ RAR และ LHA

# Name
source: Info-zip plugin
th: ปลั๊กอิน Info-zip

# Description
source: Legacy support for the zip archive format
th: การรับรองไฟล์อาร์ไคฟ์ฟอร์แมท zip แบบดั้งเดิม

# Name
source: Libarchive plugin
th: ปลั๊กอิน Libarchive

# Description
source: Full support for compressed TAR archives
th: การสนับสนุนเต็มรูปแบบของไฟล์อาร์ไคฟ์ TAR ที่บีบอัด

# Name
source: Libarchive plugin (read-only formats)
th: ปลั๊กอิน Libarchive (ฟอร์แมทแบบอ่านเท่านั้น)

# Description
source: Open and extract DEB, RPM, ISO, AppImage, XAR, CAB, and EXE files
th: เปิดและแตกไฟล์ DEB RPM ISO AppImage XAR CAB และ EXE
