Repository: Xerusion/kde-l10n-th
Catalog: messages/powerdevil/plasma_applet_org.kde.plasma.battery.po
Languages: th

source: Charging
th: กำลังชาร์จ

source: Discharging
th: กำลังคายประจุ

source: Fully Charged
th: ชาร์จเต็มแล้ว

source: Not Charging
th: ไม่ได้ชาร์จอยู่

# Battery is currently not present in the bay
source: Not present
th: ไม่มีอยู่

source: This battery's health is at only %1% and it should be replaced. Contact the manufacturer.
th: สุขภาพของแบตเตอรี่นี้เหลือเพียง %1% เท่านั้น และควรเปลี่ยนใหม่ โปรดติดต่อผู้ผลิต

source: Remaining Time:
th: เวลาที่เหลือ

# @info
source: Estimating…
th: กำลังประเมิน…

source: Battery Health:
th: สุขภาพแบตเตอรี่:

source: Battery is configured to charge up to approximately %1%.
th: แบตเตอรี่ถูกตั้งค่าให้ชาร์จได้สูงสุดประมาณ %1%

# @title:group
source: Sleep and Screen Locking after Inactivity
th: การพักเครื่องและล็อกหน้าจอหลังจากไม่มีการใช้งาน

source: Power Management
th: การจัดการพลังงาน

# accessible-only status text
source: Automatic sleep and screen locking are currently blocked.
th: การพักเครื่องและการล็อกหน้าจออัตโนมัติถูกบล็อกอยู่

# accessible-only status text
source: Screen locking is currently blocked. Sleep is automatic after inactivity.
th: การล็อกหน้าจอถูกบล็อกอยู่ เครื่องจะพักโดยอัตโนมัติเมื่อไม่ได้ใช้งาน

# accessible-only status text
source: Sleep is currently blocked. Screen locking is automatic after inactivity.
th: การพักเครื่องถูกบล็อกอยู่ เครื่องจะพักหน้าจอโดยอัตโนมัติเมื่อไม่ได้ใช้งาน

# accessible-only status text
source: Sleep and screen locking are automatic after inactivity.
th: เครื่องจะพักและล็อกหน้าจอโดยอัตโนมัติเมื่อไม่ได้ใช้งาน

# @action:button Block sleep and screen locking after inactivity
source: Manually Block Sleep and Screen Locking
th: บล็อกการพักเครื่องและการล็อกหน้าจอเอง

source: Failed to unblock automatic sleep and screen locking
th: ไม่สามารถเลิกบล็อกการพักเครื่องอัตโนมัติและการล็อกหน้าจอได้

source: Failed to block automatic sleep and screen locking
th: ไม่สามารถบล็อกการพักเครื่องอัตโนมัติและการล็อกหน้าจอได้

# @label corresponding to Manually Block Sleep and Screen Locking toggle
source: This will result in higher energy consumption.
th: สิ่งนี้จะส่งผลให้ใช้พลังงานมากขึ้น

source: You have manually blocked automatic sleep and screen locking. This will result in higher energy consumption.
th: คุณได้บล็อกการพักเครื่องและการล็อกหน้าจออัตโนมัติไว้ สิ่งนี้จะส่งผลให้ใช้พลังงานมากขึ้น

# Minimize the length of this string as much as possible
source: Your laptop is configured not to sleep when closing the lid while an external monitor is connected.
th: แล็ปท็อปของคุณถูกตั้งค่าไม่ให้พักเครื่องเมื่อปิดฝาขณะที่เชื่อมต่อกับจอภายนอกอยู่

# An application's reason for inhibiting sleep and/or screen locking
source: Unknown reason.
th: ไม่ทราบสาเหตุ

source: %1 wants to block sleep and screen locking. (%2)
th: %1 ต้องการบล็อกการพักเครื่องและการล็อกหน้าจอ (%2)

source: %1 wants to block screen locking. (%2)
th: %1 ต้องการบล็อกการล็อกหน้าจอ (%2)

source: %1 wants to block sleep. (%2)
th: %1 ต้องการบล็อกการพักเครื่อง (%2)

source: %1 is also blocking sleep and screen locking. (%2)
th: %1 ยังบล็อกการพักเครื่องและการล็อกหน้าจออยู่ด้วย (%2)

source: %1 is also blocking screen locking. (%2)
th: %1 ยังบล็อกการล็อกหน้าจออยู่ด้วย (%2)

source: %1 is also blocking sleep. (%2)
th: %1 ยังบล็อกการพักเครื่องอยู่ด้วย (%2)

source: %1 is blocking sleep and screen locking. (%2)
th: %1 บล็อกการพักเครื่องและการล็อกหน้าจออยู่ (%2)

source: %1 is blocking screen locking. (%2)
th: %1 บล็อกการล็อกหน้าจออยู่ (%2)

source: %1 is blocking sleep. (%2)
th: %1 บล็อกการพักเครื่องอยู่ (%2)

source: Unblock
th: เลิกบล็อก

source: Allow
th: อนุญาต

source: Power and Battery
th: พลังงานและแบตเตอรี่

source: Battery is not present in the bay
th: ไม่มีแบตเตอรี่อยู่ในช่อง

source: Battery and Brightness
th: แบตเตอรี่และความสว่าง

source: Brightness
th: ความสว่าง

source: Battery at %1%, not Charging
th: แบตเตอรี่เหลือ %1% ไม่ได้ชาร์จอยู่

source: Battery at %1%, plugged in but still discharging
th: แบตเตอรี่เหลือ %1% เสียบปลั๊กแล้วแต่ยังคงคายประจุอยู่

source: Battery at %1%, Charging
th: แบตเตอรี่เหลือ %1% กำลังชาร์จอยู่

source: Battery at %1%
th: แบตเตอรี่เหลือ %1%

source: Battery
th: แบตเตอรี่

source: The power supply is not powerful enough to charge the battery
th: แหล่งจ่ายไฟมีกำลังไฟไม่เพียงพอที่จะชาร์จแบตเตอรี่

# time until fully charged - HH:MM
source: %1 until fully charged
th: 1% จนกว่าจะชาร์จเต็ม

# remaining time left of battery usage - HH:MM
source: %1 remaining
th: เหลืออีก %1

source: Not charging
th: ไม่ได้ชาร์จอยู่

source: Automatic sleep and screen locking are disabled; middle-click to re-enable
th: การพักเครื่องและการพักหน้าจออัตโนมัติถูกปิดอยู่; คลิกกลางเพื่อเปิดใหม่

source: Automatic sleep and screen locking are disabled
th: การพักเครื่องและการพักหน้าจออัตโนมัติถูกปิดอยู่

source: Middle-click to disable automatic sleep and screen locking
th: คลิกกลางเพื่อปิดการพักเครื่องและการล็อกหน้าจออัตโนมัติ

source: An application has requested activating Performance mode
th: %1 แอปพลิเคชันขอเปิดใช้งานโหมดประสิทธิภาพ

source: System is in Performance mode
th: ระบบอยู่ในโหมดประสิทธิภาพ

source: An application has requested activating Power Save mode
th: %1 แอปพลิเคชันขอเปิดใช้งานโหมดประหยัดพลังงาน

source: System is in Power Save mode
th: ระบบอยู่ในโหมดประหยัดพลังงาน

source: &Show Energy Information…
th: แ&สดงข้อมูลพลังงาน

source: Show Battery Percentage on Icon When Not Fully Charged
th: แสดงเปอร์เซ็นต์แบตเตอรี่บนไอคอนเมื่อแบตเตอรี่ชาร์จไม่เต็ม

source: &Configure Power Management…
th: &ตั้งค่ากาารจัดการพลังงาน

source: &Configure Energy Saving…
th: &ตั้งค่ากาารประหยัดพลังงาน

source: Power Save
th: ประหยัดพลังงาน

source: Balanced
th: สมดุล

source: Performance
th: ประสิทธิภาพ

source: Power Profile
th: โปรไฟล์พลังงาน

# Power profile
source: Automatic
th: อัตโนมัติ

# Power profile
source: Not available
th: ไม่สามารถใช้งานได้

source: Failed to activate %1 mode
th: ไม่สามารถเปิดใช้งานโหมด%1ได้

source: Performance mode has been disabled to reduce heat generation because the computer has detected that it may be sitting on your lap.
th: โหมดประสิทธิภาพถูกปิดใช้งานเพื่อลดความร้อน เนื่องจากคอมพิวเตอร์ตรวจพบว่าอาจวางอยู่บนตักของคุณ

source: Performance mode is unavailable because the computer is running too hot.
th: โหมดประสิทธิภาพไม่สามารถใช้งานได้เนื่องจากคอมพิวเตอร์ร้อนเกินไป

source: Performance mode is unavailable.
th: โหมดประสิทธิภาพไม่สามารถใช้งานได้

source: Performance may be lowered to reduce heat generation because the computer has detected that it may be sitting on your lap.
th: ประสิทธิภาพการทำงานอาจลดลงเพื่อลดความร้อน เนื่องจากคอมพิวเตอร์ตรวจพบว่าอาจวางอยู่บนตักของคุณ

source: Performance may be reduced because the computer is running too hot.
th: ประสิทธิภาพการทำงานอาจลดลงเนื่องจากคอมพิวเตอร์ร้อนเกินไป

source: Performance may be reduced.
th: ประสิทธิภาพการทำงานอาจลดลง

source: Display Brightness
th: ความสว่างของจอภาพ

source: Keyboard Brightness
th: ความสว่างของแป้นพิมพ์

source: %1 application is currently blocking sleep and screen locking:
th: %1 แอปพลิเคชันกำลังบล็อกการพักเครื่องและการล็อกหน้าจออยู่

source: %1 is currently blocking sleep and screen locking (%2)
th: %1 กำลังบล็อกการพักเครื่องและการล็อกหน้าจออยู่ (%2)

source: %1 is currently blocking sleep and screen locking (unknown reason)
th: %1 กำลังบล็อกการพักเครื่องและการล็อกหน้าจออยู่ (ไม่ทราบสาเหตุ)

# Application name: reason for preventing sleep and screen locking
source: %1: unknown reason
th: %1: ไม่ทราบสาเหตุ
