Repository: Xerusion/kde-l10n-th
Catalog: messages/print-manager/plasma_applet_org.kde.plasma.printmanager.po
Languages: th

source: Printers
th: เครื่องพิมพ์

source: Printer Groups
th: กลุ่มเครื่องพิมพ์

source: There is one print job in the queue
th: มีงานพิมพ์ %1 งานอยู่ในคิว

source: Print queue is empty
th: คิวการพิมพ์ว่างเปล่า

source: &Configure Printers…
th: &กำหนดค่าเครื่องพิมพ์…

source: Resume
th: ทำต่อ

source: Pause
th: หยุดชั่วคราว

source: Configure printer…
th: กำหนดค่าเครื่องพิมพ์…

source: View print queue…
th: ดูคิวการพิมพ์…

# @action:button
source: Cancel
th: ยกเลิก

# Number of additional print jobs
source: %1 more job
th: อีก %1 งาน
