Repository: Xerusion/kde-l10n-th
Catalog: messages/krfb/krfb._desktop_.po
Languages: th

# Comment
source: Desktop Sharing
th: ใช้งานพื้นที่ทำงานร่วมกัน

# Name
source: User Accepts Connection
th: ผู้ใช้ยอมรับการเชื่อมต่อ

# Comment
source: User accepts connection
th: ผู้ใช้ยอมรับการเชื่อมต่อ

# Name
source: User Refuses Connection
th: ผู้ใช้ปฏิเสธการเชื่อมต่อ

# Comment
source: User refuses connection
th: ผู้ใช้ปฏิเสธการเชื่อมต่อ

# Name
source: Connection Closed
th: การเชื่อมต่อยุติ

# Comment
source: Connection closed
th: การเชื่อมต่อยุติ

# Name
source: Invalid Password
th: รหัสผ่านไม่ถูกต้อง

# Comment
source: Invalid password
th: รหัสผ่านไม่ถูกต้อง

# Name
source: Invalid Password Invitations
th: รหัสผ่านของการเชื้อเชิญไม่ถูกต้อง

# Comment
source: The invited party sent an invalid password. Connection refused.
th: ผู้เข้าร่วมการเชิญชวนส่งรหัสผ่านมาไม่ถูกต้อง ทำการปฏิเสธการเชื่อมต่อ

# Name
source: New Connection on Hold
th: การเชื่อมต่อใหม่ถูกพักรอไว้ก่อน

# Comment
source: Connection requested, user must accept
th: มีการร้องขอเชื่อมต่อมา ผู้ใช้ต้องทำการยอมรับก่อน

# Name
source: New Connection Auto Accepted
th: รับการเชื่อมต่อใหม่โดยอัตโนมัติ

# Comment
source: New connection automatically established
th: การเชื่อมต่อใหม่จะถูกทำการเชื่อมต่อโดยอัตโนมัติ

# Name
source: Too Many Connections
th: มีการเชื่อมต่อมากเกินไป

# Comment
source: Busy, connection refused
th: ยังไม่ว่าง ทำการปฏิเสธการเชื่อมต่อ

# Name
source: Unexpected Connection
th: เกิดการเชื่อมต่อที่ไม่คาดคิด

# Comment
source: Received unexpected connection, abort
th: ได้รับการเชื่อมต่อมาอย่างไม่คาดคิด ทำการยกเลิก
